圣使带队自动前往半山脚本，无泡菜自动停止，料理名可自行修改  星落制作：274100927

设置("timer", 100)	
设置("高速遇敌",1)
设置(auto_protect, AutoMoveType, 4)

::begin::
	当前地图名 = 取当前地图名()
	x,y=取当前坐标()	
	地图编号=取当前地图编号()
	if (当前地图名=="艾尔莎岛" )then	
		goto aiersa  
	elseif (当前地图名=="里谢里雅堡" )then	
		goto libao  			
	elseif (当前地图名=="杰诺瓦镇的传送点" )then	
		goto jiecun  	
	elseif (当前地图名=="蒂娜村的传送点" )then	
		goto dina  	 
	elseif (当前地图名=="启程之间" )then	
		goto chuansong  	
	elseif (当前地图名=="莎莲娜东方洞窟 地下1楼" )then	
		goto GoYiDai  	
	elseif (当前地图名=="佛利波罗" )then	
		goto BingDong  	
	elseif (当前地图名=="莎莲娜" and x==385 and y==112 )then	--一代
		goto NaShu
	elseif (当前地图名=="冰雪之牢城 第2层" and x==74 and y==35 )then	--一代
		goto DiErCeng2
	elseif (当前地图名=="冰雪之牢城 第3层" and x==60 and y==79 )then	
		goto DiSanCeng2
	end	
	等待(1000)
	goto begin
::aiersa::
	等待到指定地图("艾尔莎岛")		
	对话选是(1)		
::libao::
	等待到指定地图("里谢里雅堡")	
	自动寻路(34,89)
	回复(1)		
::chufa::	
    自动寻路(41, 50)	
	等待到指定地图("里谢里雅堡 1楼")
	自动寻路(45,20)
::chuansong::
	等待到指定地图("启程之间")		
	自动寻路(25, 4)
	喊话("请自行离开队伍进行传送",2,3,5)
	等待(5000)
	对话选是(2)		
	if (取当前地图名()=="蒂娜村的传送点" )then	
		goto dina  
	end	
	自动寻路(15, 4)	
	对话选是(2)		
	自动寻路(6, 8)
	goto jiecunhanhua
::jiecunhanhua::
	喊话("杰村到了，请加队，队满重新执行脚本",2,3,5)
	等待(1000)
    goto jiecunhanhua

::jiecun::	
	喊话("脚本启动前往蒂娜，请不要离开队伍谢谢",2,3,5)
	自动寻路(14, 6)	
	等待到指定地图("村长的家")
	自动寻路(1, 9)	
	等待到指定地图("杰诺瓦镇", 1)
	自动寻路(10, 71, 18)
	等待到指定地图("莎莲娜", 1)	
	自动寻路(557, 323)	
	goto YiDai
::dinahan::	
	自动寻路(6, 6)
	goto dinahanhua
::dinahanhua::
	喊话("蒂娜村到了，请加满队伍重新执行脚本",2,3,5)
	等待(1000)
    goto dinahanhua
	
::dina::
	
	喊话("脚本启动前往一代，请不要离开队伍谢谢",2,3,5)		
	自动寻路(11, 2)
	等待到指定地图("4214")
	自动寻路(7, 1)	
	等待到指定地图("4213")		
	自动寻路(1, 7)	
	等待到指定地图("4212")	
	自动寻路(1, 6)	
	等待到指定地图("蒂娜村")		
	自动寻路(30, 21)	
::YiDai::
	等待到指定地图("莎莲娜")
	自动寻路(527, 210)	
	自动寻路(527, 209)	
	自动寻路(527, 210)	
	自动寻路(527, 209)	
	自动寻路(527, 210)
	对话选是(528,209)	
	等待到指定地图("莎莲娜")	
::WaitDuiWu::
	if(取队伍人数() > 4)then
		goto begin
	end
	等待(1000)
	goto WaitDuiWu
::GoYiDai::
	等待到指定地图("莎莲娜东方洞窟 地下1楼")
	等待(1000)
	自动寻路(18,5)
	等待到指定地图("莎莲娜东方洞窟 地下2楼")
	自动寻路(32,9)
	等待到指定地图("莎莲娜东方洞窟 地下3楼")
	自动寻路(9,17)
	等待到指定地图("莎莲娜东方洞窟 地下2楼")
	自动寻路(9,12)
	等待到指定地图("莎莲娜东方洞窟 地下1楼")
	自动寻路(10,15)
	
::NaShu::
	等待到指定地图("莎莲娜")
	自动寻路(381,82)
	自动寻路(382,82)
	等待到指定地图("废屋")
	自动寻路(15,9)
	自动寻路(15,7)
	自动寻路(15,9)
	对话选是(16,8)	
	自动寻路(3,10)
	等待到指定地图("莎莲娜")
	自动寻路(380,28)
	自动寻路(381,27)
::DaYiDai::
	等待到指定地图("被封闭的祭坛")
	自动寻路(9,10)
	对话选是(10,9)
	等待(3000)
	等待空闲()	
::DengDaiYiDai::
	等待到指定地图("4502")
	自动寻路(14,5)
	自动寻路(14,4)
	自动寻路(14,6)
	自动寻路(14,4)
	对话选是(15,5)
::BingDong::
	等待到指定地图("佛利波罗")
	自动寻路(96,166)
	等待到指定地图("冰之洞窟")
	自动寻路(66,16)
	等待到指定地图("佛利波罗")
	自动寻路(174,103)
::LaoCheng::
	等待到指定地图("冰雪之牢城 第1层")
	自动寻路(16,47)
	自动寻路(18,47)
	自动寻路(16,47)
	自动寻路(18,47)
	对话选是(17,46)
	自动寻路(26,50)
	自动寻路(24,50)
	自动寻路(26,50)
	自动寻路(24,50)
	对话选是(25,51)
	等待(5000)	--队友点火
	自动寻路(30,51)
::DiYiCeng::
	等待到指定地图("20514")
	自动寻路(75,50)
	对话选是(2)
	等待到指定地图("20501")
	自动寻路(16,80)
::DiErCeng::
	等待到指定地图("冰雪之牢城 第2层")
	自动寻路(16,71)
	等待到指定地图("冰雪之牢城 第2层",9,71)
	自动寻路(27,62)
	等待到指定地图("冰雪之牢城 第2层",34,60)
	自动寻路(44,66)
	对话选是(2)
	自动寻路(76,71)
::DiSanCeng::
	等待到指定地图("冰雪之牢城 第3层",73,73)
	自动寻路(72,33)
	
::DiErCeng2::
	等待到指定地图("冰雪之牢城 第2层",74,35)
	自动寻路(63,34)
	等待到指定地图("冰雪之牢城 第2层",56,36)
	自动寻路(41,21)
	等待到指定地图("冰雪之牢城 第2层",41,15)
	自动寻路(61,81)
	
::DiSanCeng2::
	等待到指定地图("冰雪之牢城 第3层",60,79)
	自动寻路(33,79)
	等待到指定地图("冰雪之牢城 第3层",26,82)
	自动寻路(12,70)
	对话选是(2)
	
	等待到指定地图("20516")
	自动寻路(23,69)
::DiSiCeng::
	等待到指定地图("冰雪之牢城 第4层",22,74)
	自动寻路(19,85)
	对话选是(4)
	自动寻路(27,81)
	对话选是(2)
	--自动寻路(30,47)
	--对话选是(6)	--让队友融化  求人不如求几
	--单人点火把
	自动寻路(53,79)
	对话选是(4)
	自动寻路(30,48)
	对话选是(6)
	等待到指定地图("冰雪之牢城 第4层",27,48)
	自动寻路(25,50)
	对话选是(4)
	自动寻路(62,15)
	对话选是(2)
	等待到指定地图("冰雪之牢城 第4层",65,15)
	自动寻路(75,16)
::FiveFloor::
	等待到指定地图("冰雪之牢城 第5层",80,11)
	--一个人 点个火
	自动寻路(27,47)
	等待到指定地图("冰雪之牢城 第5层",3,6)
	自动寻路(9,6)
	对话选是(2)
	自动寻路(3,6)
	等待到指定地图("冰雪之牢城 第5层",27,47)
	自动寻路(51,46)
	等待到指定地图("冰雪之牢城 第5层",60,46)
	自动寻路(92,46)
::SixFloor::
	等待到指定地图("冰雪之牢城 第6层",82,47)
	自动寻路(78,47)
	对话选是(6)
	等待到指定地图("20506")
	自动寻路(36,47)
	等待到指定地图("冰雪之牢城 第6层",26,50)
	自动寻路(53,83)
	等待到指定地图("冰雪之牢城 第6层",67,81)
	自动寻路(86,83)
::SevenFloor::
	等待到指定地图("冰雪之牢城 第7层",84,76)
	自动寻路(21,46)
	等待到指定地图("冰雪之牢城 第7层",24,46)
	自动寻路(42,46)
	等待到指定地图("冰雪之牢城 第7层",45,46)
	自动寻路(63,46)
::EightFloor::
	等待到指定地图("冰雪之牢城 第8层",34,47)
	自动寻路(45,46)	--对话选是(3,10)
	喊话("打露比咯。。",2,3,5)  --地图代码 20527
	goto begin