支持艾尔莎岛，法兰城


local 福袋=用户勾选框("福袋",1)

::begin::
	等待空闲()
	mapNum=取当前地图编号()
	if(取当前地图名() ==  "艾尔莎岛")then goto   aiersa end    
	if(取当前地图名() ==  "芙蕾雅")then goto  map100 end    
	if(mapNum==11033)then goto map11033 end
	if(mapNum==11034)then goto map11034 end
	if(mapNum==11035)then goto map11035 end
	if(mapNum==11036)then goto map11036 end
	if(mapNum==11037)then goto map11037 end
	if(人物("坐标")  == "162,130")then	goto  s2 end	        -- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1 end	        -- 西1登录点
	if(人物("坐标")  == "72,123")then	goto  w2 end	        -- 西2登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	        -- 南1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	        -- 东1登录点
	if(人物("坐标")  == "233,78")then	goto  e2 end	        -- 东2登录点	
	等待(2000)
	goto begin 

::aiersa::	
	移动(140,105)
	转向(1)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("里谢里雅堡")	
	移动(34,89)
	回复(1)	
	移动(41,98,"法兰城")		
	移动(162,130)
	goto begin 
::s2::	-- 南2登录点
	等待到指定地图("法兰城",162, 130)	
	转向(2)	
	等待到指定地图("法兰城", 72, 123)	
	转向(2)	
	等待到指定地图("法兰城", 233, 78)		
    if(福袋==1)then goto  judge end	
	移动(281,88)	
	goto tudong1 
::w1::	-- 西1登录点
	等待到指定地图("法兰城",63, 79)	
	转向(0)	
	等待到指定地图("法兰城", 242, 100)		
    if(福袋==1)then goto  judge end			
	移动(281,88)	
	goto tudong1 

::w2::	-- 西2登录点
	等待到指定地图("法兰城", 72, 123)	
	转向(2)	
	等待到指定地图("法兰城", 233, 78)		
	if(福袋==1)then goto  judge end		
	移动(281,88)	
	goto tudong1 

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)	
	转向(0, "")	
	等待到指定地图("法兰城", 63, 79)	
	转向(0, "")	
	等待到指定地图("法兰城", 242, 100)	
	if(福袋==1)then goto  judge end	
	移动(281,88)
	goto tudong1 

::e1::	-- 东1登录点
	等待到指定地图("法兰城", 242, 100)	
	if(福袋==1)then goto  judge end		
	移动(281,88)	
	goto tudong1 

::e2::	-- 东2登录点
	等待到指定地图("法兰城", 233, 78)	
   if(福袋==1)then goto  judge end	
	移动(281,88)	
	goto tudong1 

::judge::
	if(取物品数量( "地的水晶") >  0)then goto  start end
	if(取物品叠加数量( "地的水晶碎片") >  100)then goto  crystal end	
	goto start 

::start::
	等待到指定地图("法兰城")	
	移动(281,88)	
	goto tudong1 

::crystal::
	等待到指定地图("法兰城")		
	移动(238,64,"冒险者旅馆")		
	移动(43,26,"水晶交换所")		
	移动(28,17)
	等待(500)	
	转向(4, "")
	等待服务器返回()	
	对话选择("0", "1", "")
	等待服务器返回()	
	对话选择("0", "0", "")
	等待服务器返回()	
	等待(1000)
	回城()	
	goto begin 
::map100::
::tudong1::
	等待到指定地图("芙蕾雅")	
	移动(583,172,"土之洞窟")
::map11033::
	移动(13,5)	
	转向(0)
	等待服务器返回()
	对话选择(4,0)
	等待服务器返回()
	对话选择(1, 0)
::map11034::			--土之洞窟第一层
	if(目标是否可达(74,61))then
		移动(74,61)		
	elseif(目标是否可达(70,41))then
		移动(70,41)
	elseif(目标是否可达(49,37))then
		移动(49,37)
	elseif(目标是否可达(22,29))then
		移动(22,29)
	elseif(目标是否可达(13,68))then
		移动(13,68)
	elseif(目标是否可达(14,34))then
		移动(14,34)		
	elseif(目标是否可达(18,73))then
		移动(18,73,"土之迷宫第1层")
		自动穿越迷宫()
	end
	goto begin
::map11035::			--土之洞窟第二层
	if(目标是否可达(74,53))then
		移动(74,53)	
	elseif(目标是否可达(62,37))then
		移动(62,37)	
	elseif(目标是否可达(46,45))then
		移动(46,45)
	elseif(目标是否可达(22,44))then
		移动(22,44)	
	elseif(目标是否可达(6,56))then
		移动(6,56)	
	elseif(目标是否可达(42,70))then
		移动(42,70)	
	end		
	goto begin
::map11036::			--土之洞窟第三层
	if(目标是否可达(66,45))then			
		移动(66,44)	
		移动(66,45,"土之洞窟第二层")		
	elseif(目标是否可达(10,41))then
		移动(10,41)
	elseif(目标是否可达(37,61))then
		移动(37,61)	
	elseif(目标是否可达(74,73))then
		移动(74,73)	
	elseif(目标是否可达(50,50))then
		移动(50,50)	
	elseif(目标是否可达(72,7))then
		移动(72,7)	
		goto Boss
	end		
	goto begin
::map11037::			--土之洞窟第四层
	if(目标是否可达(5,25))then			
		移动(5,25)
	elseif(目标是否可达(46,57))then
		移动(46,57)		
	elseif(目标是否可达(38,40))then
		移动(38,40)	
	end
	goto begin
::Boss::	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("充满谜的房间")	
	移动(8,3)	
	转向(7)
	等待服务器返回()
	对话选择("4", "", "")	
	等待(2000)	
	转向(3, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待(2000)
	移动(10,3)	
	转向(0, "")
	等待服务器返回()
	对话选择("1", "", "")
	等待到指定地图("芙蕾雅")	
    回城()
	等待(1000)
	

