支持艾尔莎岛，法兰城，因土之迷宫地图为随机，所以到达迷宫时需要手动走过迷宫。再到达土之洞窟脚本自动执行完毕


设置("timer", 200)
设置("自动战斗", 1) 

福袋= 用户输入框("领取精灵福袋打11111，不领取打0","0")

::begin::
	if(取当前地图名() ==  "艾尔莎岛")then goto   aiersa end    
	if(人物("坐标")  == "162,130")then	goto  s2 end	        -- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1 end	        -- 西1登录点
	if(人物("坐标")  == "72,123")then	goto  w2 end	        -- 西2登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	        -- 南1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	        -- 东1登录点
	if(人物("坐标")  == "233,78")then	goto  e2 end	        -- 东2登录点
	if(人物("坐标")  == "18,73")then	goto  tudong2 end	-- 土洞
	goto begin 

::aiersa::

	回城()
	等待到指定地图("艾尔莎岛", 1)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡", 1)
	
	移动(27,90)
	移动(34,90)
	移动(34,89)
	回复(1)
	
	
	移动(33,90)
	移动(31,90)
	移动(31,83)
	移动(41,83)
	移动(41,97)
	移动(41,98)
	
	等待到指定地图("法兰城", 1)
	
	移动(153,130)
	移动(162,130)
	goto begin 


::s2::	-- 南2登录点
	等待到指定地图("法兰城",162, 130)
	
	转向(2, "")
	
	等待到指定地图("法兰城", 72, 123)
	
	转向(2, "")
	
	等待到指定地图("法兰城", 233, 78)
	
	移动(242,78)
	移动(242,88)
	等待(500)
        if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::w1::	-- 西1登录点
	等待到指定地图("法兰城",63, 79)
	
	转向(0, "")
	
	等待到指定地图("法兰城", 242, 100)
	
	移动(242,88)
	等待(500)
	if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::w2::	-- 西2登录点
	等待到指定地图("法兰城", 72, 123)
	
	转向(2, "")
	
	等待到指定地图("法兰城", 233, 78)
	
	移动(242,78)
	移动(242,88)
	等待(500)
        if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)
	
	转向(0, "")
	
	等待到指定地图("法兰城", 63, 79)
	
	转向(0, "")
	
	等待到指定地图("法兰城", 242, 100)
	
	移动(242,88)
	等待(500)
        if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::e1::	-- 东1登录点
	等待到指定地图("法兰城", 242, 100)
	
	移动(242,88)
	等待(500)
        if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::e2::	-- 东2登录点
	等待到指定地图("法兰城", 233, 78)
	
	移动(242,78)
	移动(242,88)
	等待(500)
        if(人物("血") < 福袋)then goto  judge end
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::judge::
	
	等待(500)
        if(取物品数量( "地的水晶") >  0)then goto  start end
	
	等待(500)
        if("物品数量", "地的水晶碎片", >, 100 ,"crystal")
	
	goto start 

::start::
	等待到指定地图("法兰城", 1)
	
	移动(280,88)
	移动(281,88)
	
	goto tudong1 

::crystal::
	等待到指定地图("法兰城", 1)
	
	移动(242,78)
	移动(235,78)
	移动(235,64)
	移动(237,64)
	移动(238,64)
	
	等待到指定地图("冒险者旅馆", 1)
	
	移动(41,29)
	移动(41,26)
	移动(43,26)
	
	等待到指定地图("水晶交换所", 1)
	
	移动(8,22)
	移动(15,22)
	移动(15,17)
	移动(28,17)
	等待(500)
	
	转向(4, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	等待(1000)
	回城()
	
	goto begin 

::tudong1::
	等待到指定地图("芙蕾雅", 1)	
	移动(584,172)	
	移动(583,172)
	等待(1000)
	移动(6,24)
	移动(7,24)
	移动(7,23)
	移动(9,21)
	移动(9,19)
	移动(12,16)
	移动(16,16)
	移动(16,11)
	移动(13,11)
	移动(13,5)
	等待(500)
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	等待(1500)
	移动(74,62)
	
	移动(74,61)
	
	等待(1500)
	移动(70,61)
	
	移动(70,53)
	
	移动(73,53)
	
	移动(74,53)
	
	等待(1500)
	移动(74,41)
	
	移动(71,41)
	
	移动(70,41)
	
	等待(1500)
	移动(70,42)
	
	移动(69,42)
	
	移动(69,44)
	
	移动(68,44)
	
	移动(68,45)
	
	移动(66,45)
	
	等待(1500)
	移动(66,44)
	
	移动(66,45)
	
	等待(1500)
	移动(64,45)
	
	移动(63,45)
	
	移动(63,44)
	
	移动(62,44)
	
	移动(62,43)
	
	移动(62,38)
	
	移动(62,37)
	
	等待(1500)
	移动(62,41)
	
	移动(54,41)
	
	移动(54,37)
	
	移动(50,37)
	
	移动(49,37)
	
	等待(500)
	移动(46,37)
	
	移动(46,44)
	
	移动(46,45)
	
	等待(500)
	移动(42,45)
	
	移动(42,33)
	
	移动(39,33)
	
	移动(38,33)
	
	等待(500)
	移动(38,34)
	
	移动(38,33)
	
	等待(500)
	移动(34,33)
	
	移动(34,29)
	
	移动(23,29)
	
	移动(22,29)
	
	等待(500)
	移动(22,43)
	
	移动(22,44)
	
	等待(500)
	移动(22,57)
	
	移动(14,57)
	
	移动(14,68)
	
	移动(13,68)
	
	等待(500)
	移动(13,63)
	
	移动(12,63)
	
	移动(12,62)
	
	移动(10,62)
	
	移动(10,61)
	
	移动(7,61)
	
	移动(7,60)
	
	移动(6,60)
	
	移动(6,57)
	
	移动(6,56)
	
	等待(500)
	移动(6,49)
	
	移动(10,49)
	
	移动(10,42)
	
	移动(10,41)
	
	等待(500)
	移动(6,41)
	
	移动(6,33)
	
	移动(10,33)
	
	移动(10,25)
	
	移动(6,25)
	
	移动(5,25)
	
	等待(500)
	移动(10,25)
	
	移动(10,34)
	
	移动(13,34)
	
	等待(1000)
        移动一格(2)
	
	等待到指定地图("土之洞窟第一层", 9, 75)
	
	移动(9,76)
	
	移动(18,76)
	
	移动(18,74)
	
	移动(18,73)
	
	等待(1000)
        喊话("请手动走过土之迷宫，到达土之洞窟脚本自动运行。",0v1,01,01)
	自动穿越迷宫()
	goto begin 

::tudong2::
	等待到指定地图("土之洞窟第三层", 1)
	
	移动(22,73)
	
	移动(22,69)
	
	移动(26,69)
	
	移动(26,65)
	
	移动(30,65)
	
	移动(30,61)
	
	移动(36,61)
	
	移动(37,61)
	
	等待(1000)
	移动(37,57)
	
	移动(38,57)
	
	移动(38,55)
	
	移动(39,55)
	
	移动(39,54)
	
	移动(44,54)
	
	移动(44,55)
	
	移动(45,55)
	
	移动(45,56)
	
	移动(45,57)
	
	移动(46,57)
	
	移动(46,66)
	
	移动(45,66)
	
	移动(45,68)
	
	移动(44,68)
	
	移动(44,69)
	
	移动(42,69)
	
	移动(42,70)
	
	等待(500)
	移动(42,69)
	
	移动(46,65)
	
	移动(50,65)
	
	移动(50,73)
	
	移动(66,73)
	
	移动(66,69)
	
	移动(74,69)
	
	移动(74,72)
	
	移动(74,73)
	
	等待(500)
	移动(74,69)
	
	移动(46,69)
	
	移动(46,58)
	
	移动(46,57)
	
	等待(500)
	移动(46,50)
	
	移动(49,50)
	
	移动(50,50)
	
	等待(500)
	移动(50,49)
	
	移动(38,49)
	
	移动(38,41)
	
	移动(38,40)
	
	等待(500)
	移动(39,40)
	
	移动(72,7)
	
	等待(500)
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("充满谜的房间", 1)
	
	等待(1000)
	移动(8,3)
	
	转向(7, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待(2000)
	
	转向(3, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待(2000)
	移动(10,3)
	
	转向(0, "")
	等待服务器返回()
	对话选择("1", "", "")
	等待到指定地图("芙蕾雅", 1)
	
        回城()
	等待(1000)
	goto end 

::end::
	等待(1000)
        喊话("-==阿神制作==-土之乐谱脚本执行完毕，老板请查收。",0v1,01,01)
	等待(60000)
	goto end 


