守护，进入星之领域1层开始-----------------

设置("timer", 300)


::begin::    
    等待到指定地图("星之领域　１层", 1)    
	自动寻路(98,17)
	自动寻路(99,17)	
	等待(1000)	
	goto ercheng 	
::ercheng::    
    等待到指定地图("星之领域　２层", 1)  	
	自动寻路(29,89)	
	等待(1000)	
	goto sancheng 	
::sancheng::    
    等待到指定地图("星之领域　３层")	
	自动寻路(106,170)
	自动寻路(107,170)
	自动寻路(107,168)
	自动寻路(107,167)	
	等待(1000)	
	goto ercheng2 	
::ercheng2::    
    等待到指定地图("星之领域　２层")    	
	自动寻路(166,101)
	等待(800)
	自动寻路(166,102)	
	等待(1000)	
	goto sancheng2 	
::sancheng2::    
    等待到指定地图("星之领域　３层", 168,101)	
	自动寻路(96,28)
	自动寻路(97,28)	
	等待(1000)	
	goto sicheng 	
::sicheng::    
    等待到指定地图("星之领域　４层")    	
	自动寻路(107,98)
	自动寻路(108,98)	
	等待(1000)	
	goto wucheng 	
::wucheng::    
    等待到指定地图("星之领域　５层", 110,97) 
	自动寻路(70,97)
	自动寻路(69,97)	
	goto wucheng2 	
::wucheng2::   
	自动寻路(141,83)
	自动寻路(141,113)	
	转向(2)		
	等待(800)
	goto jiance 	
::jiance::    
	if(人物("坐标")   ==  "83,129")then	goto  conglai end
	if(人物("坐标")   ==  "32,99")then	goto  jieshu end	
	goto jiance 	
::conglai::
    自动寻路(83,126)
	自动寻路(69,126)
	goto wucheng2 	
::jieshu::
    自动寻路(35,99)
		