守护，进入星之领域1层开始-----------------

设置("timer", 300)


::begin::    
    等待到指定地图("星之领域　１层", 1)    
	移动(98,17)
	移动(99,17)	
	等待(1000)	
	goto ercheng 	
::ercheng::    
    等待到指定地图("星之领域　２层", 1)  	
	移动(29,89)	
	等待(1000)	
	goto sancheng 	
::sancheng::    
    等待到指定地图("星之领域　３层")	
	移动(106,170)
	移动(107,170)
	移动(107,168)
	移动(107,167)	
	等待(1000)	
	goto ercheng2 	
::ercheng2::    
    等待到指定地图("星之领域　２层")    	
	移动(166,101)
	等待(800)
	移动(166,102)	
	等待(1000)	
	goto sancheng2 	
::sancheng2::    
    等待到指定地图("星之领域　３层", 168,101)	
	移动(96,28)
	移动(97,28)	
	等待(1000)	
	goto sicheng 	
::sicheng::    
    等待到指定地图("星之领域　４层")    	
	移动(107,98)
	移动(108,98)	
	等待(1000)	
	goto wucheng 	
::wucheng::    
    等待到指定地图("星之领域　５层", 110,97) 
	移动(70,97)
	移动(69,97)	
	goto wucheng2 	
::wucheng2::   
	移动(141,83)
	移动(141,113)	
	转向(2)		
	等待(800)
	goto jiance 	
::jiance::    
	if(人物("坐标")   ==  "83,129")then	goto  conglai end
	if(人物("坐标")   ==  "32,99")then	goto  jieshu end	
	goto jiance 	
::conglai::
    移动(83,126)
	移动(69,126)
	goto wucheng2 	
::jieshu::
    移动(35,99)
		