进入树海后开始，若是组队跑的，在遇敌的时候点脚本“暂停”，等队友加队后再点“恢复”，千万别点到“停止”脚本了

设置("timer", 200)



::begin::  
  等待到指定地图("树海")  
  喊话("即将开宝箱，包内必须有一个空",02,03,05)  
  等待(5000)  
  移动(65,50)
  移动(66,50)
  移动(66,52)  
  等待(800)  
  转向(2)
  等待服务器返回()
  对话选择("4", "", "")
  等待(2000)  
  等待到指定地图("树海", 81,7)  
  等待(800)  
  喊话("队员加队后请打“继“”续”",02,03,05)  
  清除系统消息() 
  移动(82,7)
  goto aaa   
::aaa::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  bbb	end  
  goto aaa   
::bbb::    
  移动(215,260)  
  喊话("物理技能，学完后打“继”“续”",02,03,05)
  清除系统消息()   
  移动(217,260)
  等待(500)  
  goto ccc 
  
::ccc::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  ddd	end  
  goto ccc   
::ddd::    
  移动(97,393)
  喊话("状态技能，学完后打“继”“续”",02,03,05)
  清除系统消息()   
  等待(500)
  移动(99,393)
  移动(97,393)  
  等待(500)  
  goto eee 
  
::eee::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  fff	end  
  goto eee   
::fff::  
  移动(281,357)  
  喊话("即将开宝箱，包内必须有一个空",02,03,05)  
  等待(5000)  
  移动(280,357)  
  等待(500)  
  转向(0, "")
  等待服务器返回()
  对话选择("4", "", "")
  等待(500)  
  等待到指定地图("树海", 275,349)  
  等待(800)  
  喊话("队员加队后请打“继“”续”",02,03,05)  
  清除系统消息() 
  移动(276,349)
  goto ggg 
  
::ggg::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  hhh	end  
  goto ggg   
::hhh::   
  移动(392,392)  
  喊话("即将开宝箱，包内必须有一个空",02,03,05)  
  等待(5000)  
  移动(393,392)  
  等待(500)  
  转向(2, "")
  等待服务器返回()
  对话选择("4", "", "")
  等待(500)  
  等待到指定地图("树海", 115,5)  
  等待(800)  
  喊话("队员加队后请打“继“”续”",02,03,05)  
  清除系统消息() 
  移动(116,6)
  goto iii   
::iii::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  jjj	end  
  goto iii 
  
::jjj::    
  移动(337,167)
  等待(500)  
  喊话("即将开宝箱，包内必须有一个空",02,03,05)  
  等待(5000)  
  移动(337,165)
  移动(337,164)  
  等待(500)  
  转向(0, "")
  等待服务器返回()
  对话选择("4", "", "")
  等待(500)  
  等待到指定地图("树海", 384,157)  
  等待(800)  
  喊话("队员加队后请打“继“”续”",02,03,05)  
  清除系统消息() 
  移动(383,156)
  等待(800)
  goto kkk 
  
::kkk::
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  lll	end
  goto kkk 
  
::lll::    
  移动(359,18)
  等待(500)  
  喊话("魔法技能，学完后打出“继“”续”则去打BOSS，不打BOSS就停止脚本吧",02,03,05)  
  清除系统消息()   
  等待(500)
  移动(361,18)
  移动(359,18)  
  等待(500)  
  goto mmm 
  
::mmm::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  nnn	end
  goto mmm 
  
::nnn::  
  等待(800)  
  移动(385,21)  
  等待(500)  
  等待到指定地图("树海", 283,264)  
  等待(800)  
  喊话("队员加队后请打“继“”续”",02,03,05)  
  清除系统消息() 
  移动(282,265)
  等待(800)
  goto ooo   
::ooo::  
  清除系统消息()   
  if(string.find(聊天(50),"继续")~=nil)then goto  ppp	end  
  goto ooo   
::ppp::  
  移动(393,249)  
  喊话("第一个问题答：万物皆生自四元素终必毁灭",02,03,04)  
  等待(500)  
  喊话("第二个问题答：地归地水归水火归火风归风",02,03,04)  
  移动(393,248)
  等待(500)
  移动(393,247)  
  等待(500)  
  goto qqq 
  
::qqq::  
  移动(392,247)
  移动(394,247)
  移动(392,247)  
  转向(1, "")
  等待服务器返回()
  对话选择("1", "", "")
  等待(500)
  喊话("万物皆生自四元素终必毁灭",02,03,05)
  等待服务器返回()
  对话选择("1", "", "")
  等待(1000)
  喊话("地归地水归水火归火风归风",02,03,05)
  等待(500)
  等待服务器返回()
  对话选择("1", "", "")  
  等待(800)  
  等待到指定地图("树海", 394,243)  
  等待(800)  
  移动(394,242)  
  等待(500)  
  移动(394,241)
  清除系统消息()
  