▲自动去跑记忆 ::启动点::艾尔莎,公寓  光之路  辛梅尔  此为王冠脚本	
	
	
common=require("common")
	
设置("高速延时", 3)	
	

::begin::	
	等待空闲()
	mapNum=取当前地图编号()
	mapName=取当前地图名()
	if(mapNum == 59513)then goto map59513 
	elseif(mapNum==59984)then goto map59984
	elseif(mapNum==59982)then goto map59982
	elseif(mapNum==59988)then goto map59988
	elseif(mapNum==59986)then goto map59986
	elseif(mapNum==59987)then goto map59987
	elseif(mapName== "公寓")then goto 补魔  
	elseif(mapName == "辛梅尔")then goto map59987  
	elseif(mapName == "艾尔莎岛")then goto 出发 
	elseif(人物("坐标")  == "319,139")then	goto yiji 
	elseif(人物("坐标")  == "26,15")then	goto najiyi end
	等待(1000)
	goto begin
::补魔::	
	移动(91,58)   	 
	回复(0)		
	移动(100,70,"辛梅尔")	
	goto begin	
::出发::	
	common.supplyCastle()
	common.checkHealth()
	common.sellCastle()
	回城()
	等待空闲()
	等待到指定地图("艾尔莎岛")	
	移动(165,153)	
	转向(4, "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("利夏岛")	
	移动(90,99,"国民会馆")	
	移动(108,39,"雪拉威森塔１层")
	移动(34,95)	
	转向(2, "")
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
::map59987::		--辛梅尔
	if(目标是否可达(26,15))then
		移动(25,15)	
		对话选是(1)		
		if(取物品数量("托尔丘的记忆") > 0)then
			日志("记忆任务完成",1)
			return			
		end
	else
		移动(187,88)   
		移动(192,83) 
		移动(192, 82,"第二宝座")		
		移动(105, 20,"辛梅尔")	   
	end
	goto begin
::map59513::
	if(目标是否可达(153, 121))then
		移动(153, 121)
	end
	if(目标是否可达(167,28))then
		移动(167, 26)
		移动(169, 26)		
		对话选是(2)
		移动(169, 20)		
		对话选是(7)
		移动(167, 16)			
		对话选是(0)
		移动(162, 22)	
		对话选是(4)
	end
	if(目标是否可达(116, 69))then
		移动(118, 67)	
		对话选是(2)	
	end
	goto begin
::map59984::		--？？？
	if(目标是否可达(161,58))then	
		移动(161, 58)	
		对话选是(2)	
	end
	if(目标是否可达(121,98))then	
		移动(121, 98)	
		对话选是(2)	
	end	
	if(目标是否可达(201, 18))then	
		移动(201, 18)	
		对话选是(2)	
	end
	if(目标是否可达(318, 135))then	
		移动(318, 135)	
		日志("学一击必中的赶紧哦，10秒后继续下一步",1)
		--对话选是(2)	
		移动(319, 148)		
		对话选择("4", "", "")	
	end
	goto begin
::map59982::
	if(目标是否可达(101, 137))then
		移动(101, 137)	
		对话选是(0)
	end
	if(目标是否可达(205, 55))then
		移动(205, 55)				
	end
	if(目标是否可达(165, 105))then
		移动(165, 105)				
	end
	if(目标是否可达(234, 106))then
		移动(234, 106)					
	end
	if(目标是否可达(193, 132))then
		移动(193, 132)				
	end
	if(目标是否可达(208, 239))then		--第一个boss
		移动(208, 239)			
		对话选是(7)		
		等待战斗结束()
	end
	if(目标是否可达(193, 216))then		--第2个boss
		移动(193, 216)		
		对话选是(1)		
		等待战斗结束()
	end	
	if(目标是否可达(227, 198))then		--第3个boss
		移动(227, 198)		
		对话选是(3)		
		等待战斗结束()
	end
	if(目标是否可达(258, 229))then		--第4个boss
		移动(258, 229)		
		对话选是(3)		
		等待战斗结束()
	end
	if(目标是否可达(282, 156))then		--第5个boss
		移动(282, 156)		
		对话选是(5)				
	end
	if(目标是否可达(81, 138))then		--第6个boss
		移动(81, 138)		
		对话选是(2)			
	end
	goto begin
::map59988::
	等待到指定地图("？？？")		
	移动(358, 173)		
	对话选是(0)
	goto begin
::map59986::
	等待到指定地图("？？？")		
	移动(139, 63)
	移动(141, 61)	
	对话选是(0)
	goto begin

::yiji::	
	等待到指定地图("？？？")	
	移动(318, 139)
	移动(318, 148)
	移动(319, 148)		
	对话选择("4", "", "")	
::najiyi::
	等待(1000)	
	转向(0, "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	if(人物("坐标")  == "188,70")then	goto pd end
	goto jieshu 
::pd::
	if(取当前地图名() == "？？？")then goto pd1 end 
	goto najiyi 
::pd1::
	移动(318, 148)
	移动(319, 148)
	
			
	对话选择("4", "", "")
	goto najiyi 
::jieshu::
	
	if(取物品数量("托尔丘的记忆") < 1)then goto  najiyi end
	回城()
::dashu::
	喊话("自动跑记忆脚本结束，星落制作，谢谢使用",02,03,05)
	
	等待(1000)
        goto dashu 
::hunt::
	等待(1000)
	if(是否战斗中())then goto  hunt end
	等待(2000)
	goto begin 