设置脚本简介("▲自动去4转换花地方 启动点:艾尔莎,公寓  光之路  辛梅尔  此为王冠脚本")
	
	
	
设置("timer", 100)	

::选择::
	local 当前地图名 = 取当前地图名()
	if (当前地图名=="公寓" )then	
		goto 补魔
	elseif (当前地图名=="辛梅尔" )then	
		goto 开始
	elseif (当前地图名=="艾尔莎岛" )then	
		goto 出发
	elseif (当前地图名=="光之路" )then	
		goto 四转
	end	 	
	goto 选择
::出发::
	等待到指定地图("艾尔莎岛", 140,105)
	移动(165, 153)
	对话选是(4)
	等待到指定地图("利夏岛")	
	移动(90,99,"国民会馆")
	移动(108,39,"雪拉威森塔１层")
	移动(34,95)		
	转向(2)
	等待服务器返回()
	对话选择(4,0)
	等待服务器返回()
	对话选择(32, 0)
	等待服务器返回()
	对话选择(32, 0)
	等待服务器返回()
	对话选择(1, 0)
	
::开始::	
	等待到指定地图("辛梅尔", 1)	
	移动(185,86)
	移动(181,82)
	
	移动(181,81) 
	等待到指定地图("公寓", 1)
	
	移动(100,65)   
	移动(93,58)   
::补魔::
	移动(91,58)   
	转向(0)			-- 转向北边恢复人宠血魔
	等待回补()	 
	移动(93,58)   
	移动(100,65)   
	移动(100,69)
	   
	移动(100,70)
	等待到指定地图("辛梅尔")	   
	移动(181,82)
	等待(500)
	移动(181,82)
	移动(191,93)   
	移动(191,99)   
	移动(202,99)   
	移动(202,93)   
	移动(205,93)   
	移动(206,92)	
	移动(207,91) 
	等待(2000)
	等待到指定地图("光之路")	
::四转::
	移动(197, 34)
	移动(194, 37)
	移动(194, 44)
	移动(201, 50)
	移动(201, 50)
	移动(201, 71)
	移动(197, 78)
	移动(190, 85)
	移动(190, 85)
	移动(168, 85)
	移动(165, 82)		
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("白色方舟·第一层")	
	等待(500)	
	goto hanhua
::hanhua::
	喊话("方舟到了，请换脚本执行换花",2,3,5)	
	等待(1000)
	goto hanhua