▲自动去4转换花地方 ::启动点::艾尔莎,公寓  光之路  辛梅尔  此为单人自动坐大象脚本	

	
	
	
设置("timer", 100)	
	
	
设置("高速延时", 3)	
	

::选择::	
	if(取当前地图名() == "公寓")then goto 补魔 end 
	if(取当前地图名() == "辛梅尔")then goto 开始 end 
	if(取当前地图名() == "艾尔莎岛")then goto 出发 end
	if(取当前地图名() == "利夏岛")then goto zuoxiang end
        if(取当前地图名() == "光之路")then goto zhuan4 end 
 	
	goto 选择 
::出发::	
	等待到指定地图("艾尔莎岛", 140,105)	
	移动(165,153)	
	转向(4, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	
::zuoxiang::
	
	等待到指定地图("利夏岛", 1)
	
	移动(90,88)
	
	移动(102,100)
	
	移动(117,100)
	
::zuo::
	
	转向(3, "")
	等待(500)
	等待服务器返回()
	对话选择("4", "", "")
	等待(500)
	等待服务器返回()
	对话选择("1", "", "")
	等待(500)
	等待服务器返回()
	对话选择("1", "", "")
	
	等待(15000)
	if(取当前地图名() == "丘斯特村")then goto kaishi end
	goto zuo 

::kaishi::
	等待(6000)
	移动(83,141)
	
	移动(79,137)
	
	移动(79,135)
	移动(79,129)
	移动(81,127)
	移动(83,125)
	移动(84,124)
	移动(83,122)
	移动(83,114)
	移动(84,112)
	移动(84,110)
	移动(84,108)
	移动(83,107)
	移动(85,105)
	移动(87,104)
	移动(89,105)
	移动(91,105)
	移动(93,106)
	移动(103,106)
	移动(105,107)
	移动(112,107)
	移动(113,105)
	移动(114,103)
	移动(114,101)
	移动(115,99)
	移动(116,97)
	移动(117,95)
	移动(118,93)
	移动(119,91)
	移动(119,90)
	移动(121,88)
	移动(130,88)
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("丘斯特村", 1)
	
	
	移动(26,19)
::gle::
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待(15000)
	if(取当前地图名() == "修拉特瓦尔号")then goto  tdn end
	goto gle 




::tdn::
	等待(150000)
::tdn1::
        if(string.find(聊天(50),"  本船已到达了辛梅尔港。")~=nil)then goto xia	end
	goto tdn1 
::xia::
	移动(18,18)
	
	转向(4, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待(15000)
	if(取当前地图名() == "辛梅尔")then goto  tig end
	goto xia 




::tig::

	移动(18,18)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("辛梅尔", 1)
	



::开始::	
	Work(100, 7)
	等待到指定地图("辛梅尔", 1)
	
	移动(185,86)
	移动(181,82)
	
	移动(181,81) 
	等待到指定地图("公寓", 1)
	
	移动(100,65)   
	移动(93,58)   
::补魔::	
	移动(91,58)   
	 
	回复(0)
	
	printf("钱")
	 
	移动(93,58)   
	移动(100,65)   
	移动(100,69)
	   
	移动(100,70)
	等待到指定地图("辛梅尔", 1)
	   
	移动(181,82)
	等待(500)
	移动(181,82)
	移动(191,93)   
	移动(191,99)   
	移动(202,99)   
	移动(202,93)   
	移动(205,93)   
	移动(206,92)
	
	移动(207,91) 
	等待(2000)
	等待到指定地图("光之路", 1)
	
::zhuan4::
	移动(197, 34)
	移动(194, 37)
	移动(194, 44)
	移动(201, 50)
	移动(201, 50)
	移动(201, 71)
	移动(197, 78)
	移动(190, 85)
	移动(190, 85)
	移动(168, 85)
	移动(165, 82)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("白色方舟·第一层", 1)
	
	等待(500)
	
	goto hanhua 
::hanhua::
	喊话("方舟到了，请换脚本执行换花",02,03,05)
	
	等待(1000)
        goto hanhua 