▲自动去4转换花地方 ::启动点::艾尔莎,公寓  光之路  辛梅尔  此为单人自动坐大象脚本	

	
	
	
设置("timer", 100)	
	
	
设置("高速延时", 3)	
	

::选择::	
	if(取当前地图名() == "公寓")then goto 补魔 end 
	if(取当前地图名() == "辛梅尔")then goto 开始 end 
	if(取当前地图名() == "艾尔莎岛")then goto 出发 end
	if(取当前地图名() == "利夏岛")then goto zuoxiang end
        if(取当前地图名() == "光之路")then goto zhuan4 end 
 	
	goto 选择 
::出发::	
	等待到指定地图("艾尔莎岛", 140,105)	
	自动寻路(165,153)	
	转向(4, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	
::zuoxiang::
	
	等待到指定地图("利夏岛", 1)
	
	自动寻路(90,88)
	
	自动寻路(102,100)
	
	自动寻路(117,100)
	
::zuo::
	
	转向(3, "")
	等待(500)
	等待服务器返回()
	对话选择("4", "", "")
	等待(500)
	等待服务器返回()
	对话选择("1", "", "")
	等待(500)
	等待服务器返回()
	对话选择("1", "", "")
	
	等待(15000)
	if(取当前地图名() == "丘斯特村")then goto kaishi end
	goto zuo 

::kaishi::
	等待(6000)
	自动寻路(83,141)
	
	自动寻路(79,137)
	
	自动寻路(79,135)
	自动寻路(79,129)
	自动寻路(81,127)
	自动寻路(83,125)
	自动寻路(84,124)
	自动寻路(83,122)
	自动寻路(83,114)
	自动寻路(84,112)
	自动寻路(84,110)
	自动寻路(84,108)
	自动寻路(83,107)
	自动寻路(85,105)
	自动寻路(87,104)
	自动寻路(89,105)
	自动寻路(91,105)
	自动寻路(93,106)
	自动寻路(103,106)
	自动寻路(105,107)
	自动寻路(112,107)
	自动寻路(113,105)
	自动寻路(114,103)
	自动寻路(114,101)
	自动寻路(115,99)
	自动寻路(116,97)
	自动寻路(117,95)
	自动寻路(118,93)
	自动寻路(119,91)
	自动寻路(119,90)
	自动寻路(121,88)
	自动寻路(130,88)
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("丘斯特村", 1)
	
	
	自动寻路(26,19)
::gle::
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待(15000)
	if(取当前地图名() == "修拉特瓦尔号")then goto  tdn end
	goto gle 




::tdn::
	等待(150000)
::tdn1::
        if(string.find(聊天(50),"  本船已到达了辛梅尔港。")~=nil)then goto xia	end
	goto tdn1 
::xia::
	自动寻路(18,18)
	
	转向(4, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待(15000)
	if(取当前地图名() == "辛梅尔")then goto  tig end
	goto xia 




::tig::

	自动寻路(18,18)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("辛梅尔", 1)
	



::开始::	
	Work(100, 7)
	等待到指定地图("辛梅尔", 1)
	
	自动寻路(185,86)
	自动寻路(181,82)
	
	自动寻路(181,81) 
	等待到指定地图("公寓", 1)
	
	自动寻路(100,65)   
	自动寻路(93,58)   
::补魔::	
	自动寻路(91,58)   
	 
	回复(0)
	
	printf("钱")
	 
	自动寻路(93,58)   
	自动寻路(100,65)   
	自动寻路(100,69)
	   
	自动寻路(100,70)
	等待到指定地图("辛梅尔", 1)
	   
	自动寻路(181,82)
	等待(500)
	自动寻路(181,82)
	自动寻路(191,93)   
	自动寻路(191,99)   
	自动寻路(202,99)   
	自动寻路(202,93)   
	自动寻路(205,93)   
	自动寻路(206,92)
	
	自动寻路(207,91) 
	等待(2000)
	等待到指定地图("光之路", 1)
	
::zhuan4::
	自动寻路(197, 34)
	自动寻路(194, 37)
	自动寻路(194, 44)
	自动寻路(201, 50)
	自动寻路(201, 50)
	自动寻路(201, 71)
	自动寻路(197, 78)
	自动寻路(190, 85)
	自动寻路(190, 85)
	自动寻路(168, 85)
	自动寻路(165, 82)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("白色方舟·第一层", 1)
	
	等待(500)
	
	goto hanhua 
::hanhua::
	喊话("方舟到了，请换脚本执行换花",02,03,05)
	
	等待(1000)
        goto hanhua 