站在守墓者的下方对着守墓者（就是人面朝北的方向），找任意一个守墓者可无限杀不用等时间！狐狸制作！





::StartBegin::
        
        转向(0, "")
        等待服务器返回()
	对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        goto zhanglao 
::zhanglao::
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        goto zhanglao 
::finiEnd::
	等待(200000)
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        等待服务器返回()
        对话选择("1", "", "")
