��男薷陌�启动点艾尔莎岛登入点或黄金龙坐标130.187启动均可----------------QQ278142863

设置("timer", 100)


HJLGDZ补魔值=用户输入框("HJLGDZ补魔值",30)
HJLGDZ补血值=用户输入框("HJLGDZ补血值",30)
HJLGDZ宠补血值=用户输入框("HJLGDZ宠补血值",30)
HJLGDZ宠补血值=用户输入框("HJLGDZ宠补血值",30)

if(人物("坐标")   ==  "130,187")then	goto  yudi end

-- 设定自动及保护设置
                         -- 自动遇敌
                    -- ::0::园圈自动遇敌，1东西行走，2南北行走，3随机行走4原地         
::begin::
	移动(160, 125)
	移动(180, 125)
	移动(225, 170)
	移动(225, 171)
	
	等待到指定地图("艾夏岛", 1)
	

	移动(91, 65)
	移动(91, 66)
	移动(99, 74)
	移动(99, 77)
	移动(100, 78)
	移动(100, 82)
::care::
	移动(112, 82)
	移动(112, 81)
	
	等待到指定地图("医院", 1)
	
	
	移动(34, 46)
	移动(35, 46)
	移动(35, 47)
	移动(35, 45)
	移动(35, 47)
	回复(1)         -- 恢复人宠
	
	等待(10000)
	移动(28, 47)
	移动(28, 52)
	
	等待到指定地图("艾夏岛", 1)
	
::start_1::
	移动(112, 88)
	移动(128, 88)
	移动(128, 93)
	移动(131, 93)
	移动(140, 102)
	移动(143, 99)
	移动(147, 99)
	移动(153, 105)
	移动(163, 105)
	移动(163, 108)
	移动(169, 108)
	移动(169, 114)
	移动(186, 115)
	移动(190, 116)
	
	
	等待到指定地图("盖雷布伦森林", 1)
	

::start_2::

	移动(211, 211)
	移动(211, 224)
	移动(214, 224)
	移动(214, 229)
	移动(224, 229)
	移动(230, 223)
	移动(231, 222)
	
	
	等待到指定地图("布拉基姆高地", 1)
	
	
	移动(33, 190)
	移动(33, 188)
	移动(41, 188)
	移动(49, 196)
	移动(57, 196)
	移动(65, 188)
	移动(91, 214)
	移动(111, 214)
	移动(111, 210)
	移动(113, 210)
	移动(117, 206)
	移动(117, 190)
	移动(110, 190)
	移动(110, 180)
	移动(119, 180)
	移动(122, 177)
	移动(129, 185)
	移动(130, 185)


::yudi::
	移动(130, 190)
	设置("timer", 100)				-- 设置定时器,单位毫秒
					-- 设置定时器,单位毫秒
	开始遇敌()                        -- 开始自动遇敌
  	goto scriptstart 

::scriptstart::
	--	战斗中会停在此句 节省资源
    	if(人物("魔") < HJLGDZ补魔值)then goto  back end 
    	if(人物("血") < HJLGDZ补血值)then goto  back end
    	if(宠物("血") < HJLGDZ宠补血值)then goto  back end
    	if(宠物("魔") < HJLGDZ宠补魔值)then goto  back end
	goto scriptstart          --自动遇敌中 循环判断血魔



::back::             --回去部分
	
	
	
	停止遇敌()                 -- 结束战斗
	
	
	移动(130, 187)
	移动(130, 185)
	移动(129, 185)
	移动(122, 177)
	移动(119, 180)
	移动(110, 180)
	移动(110, 190)
	移动(117, 190)
	移动(117, 206)
	移动(113, 210)
	移动(111, 210)
	移动(111, 214)
	移动(91, 214)
	移动(65, 188)
	移动(57, 196)
	移动(49, 196)
	移动(41, 188)
	移动(34, 188)
	移动(30, 192)
        移动(30, 193)
        移动( 27,192)
	

	等待到指定地图("盖雷布伦森林", 1)
	
	移动(224, 229)
	移动(214, 229)
	移动(214, 224)
	移动(211, 224)
	移动(211, 211)
	移动(200, 211)
	移动(199, 211)
	

	等待到指定地图("艾夏岛", 1)
	
	移动(190, 116)
	移动(182, 116)
	移动(182, 114)
	移动(169, 114)
	移动(169, 108)
	移动(163, 108)
	移动(163, 99)
	移动(147, 99)
	移动(132, 99)
	移动(132, 93)
	移动(128, 93)
	移动(128, 88)
	移动(112, 88)
	goto care 


