1-160全自动练级

common=require("common")

local 补血值=取脚本界面数据("人补血")
local 补魔值=取脚本界面数据("人补魔")
local 宠补血值=取脚本界面数据("宠补血")
local 宠补魔值=取脚本界面数据("宠补魔")
local 队伍人数=取脚本界面数据("队伍人数")
local 设置队员列表=取脚本界面数据("队员列表")
local 队员列表={}
local 是否练宠=取脚本界面数据("是否练宠")
if(补血值==nil or 补血值==0)then
	补血值=用户输入框("多少血以下补血", "430")
else
	补血值=tonumber(补血值)
end
if(补魔值==nil or 补魔值==0)then
	补魔值 = 用户输入框("多少魔以下补魔", "200")
else
	补魔值=tonumber(补魔值)
end
if(宠补血值==nil or 宠补血值==0)then
	宠补血值 = 用户输入框( "宠多少血以下补血", "50")
else
	宠补血值=tonumber(宠补血值)
end
if(宠补魔值==nil or 宠补魔值==0)then
	宠补魔值=用户输入框( "宠多少魔以下补魔", "50")
else
	宠补魔值=tonumber(宠补魔值)
end
if(队伍人数==nil or 队伍人数==0)then
	队伍人数 = 用户输入框("练级队伍人数，不足则固定点等待！",5)
else
	队伍人数=tonumber(队伍人数)
end
if(设置队员列表==nil or 设置队员列表=="")then
	设置队员列表 = 用户输入框("练级队员列表，不设置则不判断队员！","")
end
if(设置队员列表 ~= nil and string.find(设置队员列表,"|") ~= nil)then
	队员列表=common.luaStringSplit(设置队员列表,"|")
end
if(是否练宠==nil or 是否练宠 ==0)then
	是否练宠 = 用户输入框("是否练宠,是1，否0",0)
else
	是否练宠=tonumber(是否练宠)
end
local 练级地点=用户下拉框("高地练级地点","鸡场|龙骨|黄金龙骨","鸡场")
local 是否卖石=用户输入框("是否卖魔石,是1，否0",1)
local 走路加速值=110	--脚本走路中可以设定移动速度  到达目的地后，再还原值即可
local 走路还原值=100	--防止掉线 还原速度
local 身上最少金币=100000	--10w
local 多少金币去拿钱=10000	--1w

local 卖店物品列表="魔石|卡片？|锹型虫的卡片|狮鹫兽的卡片|水蜘蛛的卡片|虎头蜂的卡片|水晶怪的卡片|哥布林的卡片|红帽哥布林的卡片|迷你蝙蝠的卡片|绿色口臭鬼的卡片|锥形水晶"		--可以增加多个 不影响速度
local 医生名称={"星落护士","谢谢惠顾☆"}
local 遇敌总次数=0
local 练级前经验=0
local 练级前时间=os.time() 
local 半山西门=true	--半山是西门还是里堡二楼
local 是否自动购买水晶=false

local 扔物品列表={'时间的碎片','时间的结晶','绿头盔','红头盔','秘文之皮','星之砂','奇香木','巨石','龙角','坚硬的鳞片','传说的鹿皮','碎石头'}
设置("自动叠",1, "时间的结晶&20")	
设置("自动叠",1, "时间的碎片&20")	
for i,v in pairs(扔物品列表) do
	设置("自动扔",1, v)	
end


--不踢人 踢人可以用common接口
function 等待队伍人数达标(练级点)				--等待队友	
::begin::
	喊话(练级点 .."练级脚本，来打手人够脚本自动前往【"..练级点.."】++++",2,3,5)
	等待(5000)
	if(队伍("人数") < 队伍人数) then	--数量不足 等待
		goto begin
	end	
	喊话("人数达标，自动前往【"..练级点.."】，请不要离开队伍,谢谢！",2,3,5)
	return 
end

	
function 布拉基姆高地练级(目标等级,练级坐标x,练级坐标y,练级地名称)
	日志("布拉基姆高地练级-"..练级地名称,1)
	设置个人简介("玩家称号",目标等级)
	清除系统消息()
	练级前经验=人物("经验")
	练级前宠经验=宠物("经验")
	练级前金币=人物("金币")
	水晶名称="火风的水晶（5：5）"
	common.checkHealth(医生名称)
	common.checkCrystal(水晶名称)	
::begin::						--开始
	等待空闲()
	local 当前地图名 = 取当前地图名()
	local x,y=取当前坐标()	
	if (当前地图名=="艾尔莎岛" )then	
		goto erDao	
	elseif(取当前地图编号() == 1112)then
		回城()
		goto begin
	elseif (当前地图名=="医院" )then	
		goto erYiYuan
	elseif (当前地图名=="冒险者旅馆" )then	
		goto sale
	elseif (当前地图名=="盖雷布伦森林" )then	
		goto toGaoDi
	elseif (当前地图名=="布拉基姆高地" )then	
		goto toUpgradePos
	elseif (当前地图名=="艾夏岛" )then	
		goto aiXiaDao
	end
	回城()
	等待(1000)
	goto begin
::erDao::
	等待到指定地图("艾尔莎岛")	
	自动寻路(144,105)
	自动寻路(157,93)
	转向(2)	
	等待到指定地图("艾夏岛")		
	goto aiXiaDao
	
::aiXiaDao::					--去医院
	自动寻路(112, 81)	
	goto erYiYuan
::erYiYuan::	
	等待到指定地图("医院")	
	自动寻路(34, 46)
	自动寻路(35, 46)
	自动寻路(35, 47)
	自动寻路(35, 45)
	自动寻路(35, 47)
	renew(1)        			-- 恢复人宠        
	等待(8000)
	自动寻路(28, 47)
	if(队伍("人数") < 队伍人数)then	--数量不足 等待
		等待队伍人数达标(练级地名称)
	end
	
	自动寻路(28, 52)	
	等待到指定地图("艾夏岛")	
	goto toSenLin
::toSenLin::					--去练级点		
	等待到指定地图("艾夏岛")
	自动寻路(190, 116)	
	goto toGaoDi
::toGaoDi::
	等待到指定地图("盖雷布伦森林")
	自动寻路(231, 222)	
	goto toUpgradePos
::toUpgradePos::
	等待到指定地图("布拉基姆高地")	
	自动寻路(练级坐标x,练级坐标y)	         
	goto kaishi
::kaishi::						--开始遇敌		
	开始遇敌()      
	goto battle
::battle::						--状态判断			--自动遇敌中 循环判断血魔
	if (人物("血") < 补血值 )then		
		日志(人物("血").."<"..补血值.."回补",1)
		goto back
	elseif (人物("魔") < 补魔值 )then	
		日志(人物("魔").."<"..补血值.."回补",1)
		goto back
	elseif (宠物("血") < 宠补血值 )then	
		日志(宠物("血").."<"..宠补血值.."回补",1)
		goto back
	elseif (宠物("魔") < 宠补魔值 )then	
		日志(宠物("魔").."<"..宠补魔值.."回补",1)
		goto back		
	elseif 是否战斗中() then
		遇敌总次数=遇敌总次数+1
		等待战斗结束()
	end		
	等待(1000)	
	goto battle      
::back::						--回补
	停止遇敌()                 	-- 结束战斗			
	日志("共遇敌次数"..遇敌总次数,2,3,5)
	common.statistics(练级前时间,练级前经验,练级前宠经验,练级前金币)	--统计脚本效率		
	等待(1000)
	自动寻路(30,193)	
	等待到指定地图("盖雷布伦森林")	
	自动寻路(199, 211)
	等待到指定地图("艾夏岛")		
	自动寻路(112, 88)
	-- if(是否卖石 == 1)then 
		-- 自动寻路(102, 115)	
		-- goto sale 
	-- end
	自动寻路(112, 81)	
	goto erYiYuan
::sale::	--卖石	
	等待到指定地图("冒险者旅馆")	
	自动寻路(37,30)
	自动寻路(38,30)
	自动寻路(37,30)
	自动寻路(38,30)
	自动寻路(37,30)
	卖(37,29,卖店物品列表)		
	等待(3000)
	自动寻路(38, 48)
	goto begin
end
function main()

	if(练级地点 == "鸡场")then
		布拉基姆高地练级(27,31,191,"鸡场")			
	elseif(练级地点=="龙骨")then
		布拉基姆高地练级(32,112,203,"龙骨")
	elseif(练级地点=="黄金龙骨")then	
		布拉基姆高地练级(37,130, 190,"黄金龙骨")			
    end
	等待(2000)
end
main()