★高地杀黄金龙多练脚本带队。医院35,47起点，高地"31,191"，

补魔值 = 用户输入框("多少魔以下补魔", "50")
补血值=用户输入框("多少血以下补血", "430")
宠补血值=用户输入框( "宠多少血以下补血", "50")
宠补魔值=用户输入框( "宠多少魔以下补血", "100")
-- 设定自动及保护设置
--set(auto_protect, AutoMove, 1)                         -- 自动遇敌
--set(auto_protect, AutoMoveType, 4)                     -- 0:园圈自动遇敌，1东西行走，2南北行走，3随机行走4原地     

function main()
    遇敌总次数=0
::menuBegin::
	当前地图名 = 取当前地图名()
	x,y=取当前坐标()	
	if (当前地图名=="艾尔莎岛" )then	
		goto erdao	
	elseif (当前地图名=="医院" )then	
		goto 艾医院
	elseif (当前地图名=="布拉基姆高地" )then	
		goto aa
	elseif (x==35 and y==47 )then	
		goto care22
	elseif (x==31 and y==191 )then	
		goto aa
	end
	goto menuBegin
::erdao::	
	等待到指定地图("艾尔莎岛", 1)	
	自动寻路(144,105)
	自动寻路(157,93)
	转向(2, "")	
	等待到指定地图("艾夏岛", 1)	
	自动寻路(112, 81)	
	goto 艾医院
::begin::     
	自动寻路(225, 171)	
	等待到指定地图("艾夏岛", 1)	
	自动寻路(100, 82)
::care::
	自动寻路(112, 82)
	自动寻路(112, 81)	
::艾医院::
	等待到指定地图("医院", 1)	
	自动寻路(34, 46)
	自动寻路(35, 46)
	自动寻路(35, 47)
	自动寻路(35, 45)
	自动寻路(35, 47)
	renew(1)         -- 恢复人宠        
	等待(8000)
::care22::
	自动寻路(28, 47)
	自动寻路(28, 52)	
	等待到指定地图("艾夏岛", 1)	
::start_1::	
	自动寻路(190, 116)	
	等待到指定地图("盖雷布伦森林", 1)
::start_2::
	自动寻路(231, 222)		
	等待到指定地图("布拉基姆高地", 1)	
	自动寻路(130, 190)	   
::aa::
	自动寻路(130, 190)	   
	开始遇敌()         -- 开始自动遇敌
  	goto scriptstart

::scriptstart::
	--战斗中会停在此句 节省资源
	if (人物("血") < 补血值 )then		
		goto back
	elseif (人物("魔") < 补魔值 )then	
		goto back
	elseif (宠物("血") < 宠补血值 )then	
		goto back
	elseif (宠物("魔") < 宠补魔值 )then	
		goto back
	elseif 是否战斗中() then
		遇敌总次数=遇敌总次数+1
		等待战斗结束()
	end		
	等待(1000)	
	goto scriptstart         --自动遇敌中 循环判断血魔



::back::             --回去部分	
	停止遇敌()                 -- 结束战斗			
	喊话("共遇敌次数"..遇敌总次数,2,3,5)
	回城()
	goto menuBegin
    自动寻路(30,193)	
	等待到指定地图("盖雷布伦森林", 1)	
	自动寻路(199, 211)
	等待到指定地图("艾夏岛", 1)		
	自动寻路(112, 88)
	goto care
end
main()