圣使带队自动前往半山脚本，无泡菜自动停止，料理名可自行修改  星落制作：274100927
--亡魂？

::menu1::
	goto menu2 

::menu2::
	设置("timer", 100)
	
	set("高速遇敌",1)
	
	
	等待(500)
      	
	goto begin 
::begin::
	清除系统消息()
        if(取当前地图名() ==  "艾尔莎岛")then goto   aiersa end  
	if(取当前地图名() ==  "里谢里雅堡")then goto start end
	if(取当前地图名() ==  "杰诺瓦镇的传送点")then goto jiecun end
	if(取当前地图名() ==  "蒂娜村的传送点")then goto dina end
	if(取当前地图名() ==  "小岛")then goto shangshan end
	if(取当前地图名() ==  "半山腰")then goto banshan end
	if(人物("坐标")   ==  "6,8")then	goto jiecun end
        if(人物("坐标")   ==  "6,6")then	goto dina end
        if(人物("坐标")   ==  "66,97")then	goto shangshan end
        goto begin 
::aiersa::
	等待到指定地图("艾尔莎岛", 1)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡", 1)
	
	自动寻路(54,82)
	goto start 
::start::
	自动寻路(54,77)
	喊话("半山传教带队，来打手",02,03,05)
	自动寻路(54,83)
	goto lu1 
::lu1::
	自动寻路(30, 83)
	自动寻路(30, 90)
	自动寻路(33, 90)
	自动寻路(34, 89)
	自动寻路(34, 88)
	自动寻路(34, 89)
	自动寻路(34, 88)
	自动寻路(34, 89)
	自动寻路(34, 88)
	
	回复(2)
	
	等待(5000)
::daka::
	自动寻路(34, 90)
	自动寻路(30, 90)
	自动寻路(30, 83)
	自动寻路(59, 83)
	自动寻路(57, 83)
	自动寻路(59, 83)
	喊话("请打卡，打卡时间15秒，脚本自动执行，不等人，谢谢合作",02,03,05)
	等待(15000)
	
	转向(5, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
::chufa::
	 自动寻路(41, 80)
        自动寻路(41, 53)
        自动寻路(41, 50)
	
	等待到指定地图("里谢里雅堡 1楼", 1)
	
        自动寻路(74, 24)
	
        自动寻路(45, 24)
	
        自动寻路(45, 20)
	
	等待到指定地图("启程之间", 1)
	
        自动寻路(25, 29)
	
        自动寻路(20, 29)
	
        自动寻路(20, 15)
	
        自动寻路(25, 10)
	
        自动寻路(25, 4)
	
        自动寻路(26, 5)
	
        自动寻路(25, 4)
	
        自动寻路(26, 5)
	
        自动寻路(25, 4)
	喊话("请自行离开队伍进行传送",02,03,05)
	等待(5000)
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "(null)", "")
	
	if(取当前地图名() ==  "蒂娜村的传送点")then goto dina end
	自动寻路(25, 12)
	自动寻路(14, 12)
	自动寻路(14, 11)
	
        自动寻路(14, 5)
	
        自动寻路(15, 4)
	自动寻路(16, 5)
	自动寻路(15, 4)
	自动寻路(16, 5)
	自动寻路(15, 4)
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "(null)", "")
	自动寻路(6, 8)
	goto jiecunhanhua 
::jiecunhanhua::
	喊话("杰村到了，请加队，队满重新执行脚本",02,03,05)
	
	等待(1000)
        goto jiecunhanhua 

::jiecun::
	
	喊话("脚本启动前往蒂娜，请不要离开队伍谢谢",02,03,05)
	
        自动寻路(14, 8)
	
        自动寻路(14, 6)
	
	等待到指定地图("村长的家", 1)
	
        自动寻路(13, 9)
	
        自动寻路(1, 9)
	
	等待到指定地图("杰诺瓦镇", 1)
	
        自动寻路(54, 43)
	
        自动寻路(54, 35)
	自动寻路( 71, 18)
	等待到指定地图("莎莲娜", 1)
	自动寻路(279, 420)
	
	自动寻路(295, 420)
	
	自动寻路(301, 426)
	
	自动寻路(317, 426)
	
	自动寻路(317, 439)
	
	自动寻路(329, 451)
	
	自动寻路(332, 454)
	
	自动寻路(336, 456)
	
	自动寻路(355, 456)
	
	自动寻路(372, 439)
	
	自动寻路(372, 417)
	
	自动寻路(376, 413)
	
	自动寻路(376, 400)
	
	自动寻路(373, 397)
	
	自动寻路(373, 390)
	
	自动寻路(376, 387)
	
	自动寻路(376, 371)
	
	自动寻路(389, 358)
	
	自动寻路(389, 342)
	
	自动寻路(395, 336)
	
	自动寻路(395, 325)
	
	自动寻路(393, 323)
	
	自动寻路(393, 317)
	
	自动寻路(401, 309)
	
	自动寻路(401, 306)
	
	自动寻路(401, 306)
	
	自动寻路(408, 299)
	
	自动寻路(420, 299)
	
	自动寻路(424, 295)
	
	自动寻路(424, 288)
	
	自动寻路(433, 279)
	
	自动寻路(437, 283)
	
	自动寻路(439, 283)
	
	自动寻路(447, 291)
	
	自动寻路(494, 291)
	
	自动寻路(504, 301)
	
	自动寻路(527, 301)
	
	自动寻路(532, 296)
	
	自动寻路(538, 296)
	
	自动寻路(543, 291)
	
	自动寻路(552, 291)
	
	自动寻路(555, 294)
	
	自动寻路(555, 311)
	
	自动寻路(557, 313)
	
	自动寻路(557, 323)
	
	goto shangdao 
::dinahan::
	
	自动寻路(6, 6)
       	goto dinahanhua 
::dinahanhua::
	喊话("蒂娜村到了，请加满队伍重新执行脚本",02,03,05)
	
	等待(1000)
        goto dinahanhua 

	
::dina::
	
	喊话("脚本启动前往半山，请不要离开队伍谢谢",02,03,05)
	
	自动寻路(11, 6)
	自动寻路(11, 2)
	等待到指定地图("村长的家", 1)
	
        自动寻路(10, 6)
	自动寻路(7, 3)
        自动寻路(7, 1)
	
	等待到指定地图("村长的家", 1)
	
	自动寻路(7, 11)
        自动寻路(3, 7)
	自动寻路(1, 7)
	
	等待到指定地图("村长的家", 1)
	
	自动寻路(8, 6)
	自动寻路(1, 6)
	
	等待到指定地图("蒂娜村", 1)
	
        自动寻路(28, 59)
	
	自动寻路(28, 53)
	
	自动寻路(31, 50)
	
	自动寻路(42, 50)
	
	自动寻路(42, 58)
	
	自动寻路(44, 60)
	
	自动寻路(44, 62)
	goto shangdao 
	
::shangdao::
	
	自动寻路(585, 323)
	
	自动寻路(594, 323)
	
	自动寻路(602, 315)
	
	自动寻路(649, 315)
	
	自动寻路(651, 319)
	
	自动寻路(668, 319)
	
	自动寻路(668, 320)
	
	自动寻路(668, 319)
	
	自动寻路(668, 320)
	
	自动寻路(668, 319)
	
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")
	goto shangshanhan 
::shangshanhan::
	
	自动寻路(66, 97)
	
	goto shangshanhanhua 
::shangshanhanhua::
	喊话("小岛到了，请加满队伍重新执行脚本",02,03,05)
	
	等待(1000)
        goto shangshanhanhua 


::shangshan::
	
	喊话("脚本启动上山，请不要离开队伍谢谢",02,03,05)
	
	
	自动寻路(69, 97)
	
	自动寻路(72, 94)
	
	自动寻路(72, 92)
	
	自动寻路(99, 65)
	
	自动寻路(99, 52)
	
	自动寻路(93, 46)
	
	自动寻路(65, 46)
	
	自动寻路(64, 45)
	chat(脚本停止，请手动穿越迷宫,到达半山脚本自动运行,2,v3,5)
	goto begin 
::banshan::
	
	自动寻路(60, 65)
	if("状态", "GameCommand.ActionStat", "==", 0, hunt)
	goto kaishi 
::hunt::
	自动寻路(62,65)
	if("状态", "GameCommand.ActionStat", "==", 1, kaishi)
	自动寻路(64,65)
	if("状态", "GameCommand.ActionStat", "==", 1, kaishi)
	自动寻路(60,65)
	if("状态", "GameCommand.ActionStat", "==", 1, kaishi)
	goto hunt 
::kaishi::
    	  
    	等待(2000)
      	
      	开始遇敌()       
      	goto yudi 
::yudi::
	if(取物品数量( "寿喜锅") <  "1")then goto  panduan end
	if(string.find(最新系统消息()," 您将被强制离开")~=nil)then goto  begin	end
        goto yudi 

::panduan::
	if("物品数量", "寿喜锅", >, 0 ,panduan)
	if(string.find(最新系统消息()," 您将被强制离开")~=nil)then goto  begin	end
	goto panduanren 
::panduanren::
	if(人物("魔") < 350)then goto  tingzhi end
	if(string.find(最新系统消息()," 您将被强制离开")~=nil)then goto  begin	end
	goto panduanren 
::tingzhi::
	
        停止遇敌()
        
        等待(1000)
	goto hanhua 
::hanhua::
	喊话("料理已用完，脚本到此停止，请自行寻找队伍",02,03,05)
        
	等待(1000)
	
	喊话("料理已用完，脚本到此停止，请自行寻找队伍",02,03,05)
        
	等待(4000) 
	喊话("料理已用完，脚本到此停止，请自行寻找队伍",02,03,05)
        
  	 等待(4000) 
       回城()
       等待(4000) 
       exit