脚本支持任意地点启动，支持黑白记忆，请设置好自动战斗,谢谢支持魔力辅助程序.脚本发现BUG联系群14873104-----------zzg123


是否卖 =用户输入框("鹿皮卖否？ 是1 否0","1")
是否打卡 =用户输入框("是否打卡？ 是1 否0","0")
::begin::	
	回城()	
	等待(1000)	--切换	
    local 当前地图名 = 取当前地图名()
	x,y=取当前坐标()	
	if (当前地图名=="艾尔莎岛" )then	
		goto star	
	elseif (x==175 and y==182 )then	
		goto work
	elseif (x==72 and y==123 )then	
		goto w2
	elseif (x==233 and y==78 )then	
		goto e2
	elseif (x==162 and y==130 )then	
		goto s2
	elseif (x==63 and y==79 )then	
		goto w1
	elseif (x==242 and y==100 )then	
		goto e1
	elseif (x==141 and y==148 )then	
		goto s1
	end	
	
	等待(2000)	
	goto begin
::w2::	-- 西2登录点
	转向(2)	
	等待到指定地图("法兰城",233,78)
::e2::	-- 东2登录点
	转向(0)	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0)

::s2::	-- 南2登录点	
	等待到指定地图("法兰城",162,130)	
	自动寻路(153,130)
	goto Go
::w1::	-- 西1登录点
	转向(0)	
	等待到指定地图("法兰城", 242, 100)
::e1::	-- 东1登录点
	转向(2)	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0)
::s1::	-- 南1登录点	
	等待到指定地图("法兰城",141,148)
	自动寻路(153,148)
::Go::
	自动寻路(153,102)
	自动寻路(153,100)
	等待到指定地图("里谢里雅堡")	
::Go2::        
	自动寻路(41,93)
	自动寻路(28,93)
	自动寻路(28,88)
	等待服务器返回()
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("？")	
	自动寻路(19,21)
 	自动寻路(19,21)		
	等待到指定地图("法兰城遗迹")	
	自动寻路(98,59)	
	自动寻路(108,69)	
	自动寻路(118,69)
	自动寻路(118,77)
	自动寻路(119,77)
	自动寻路(119,86)
	自动寻路(105,86)
	自动寻路(105,90)
	自动寻路(98,90)
	自动寻路(98,137)
	自动寻路(98,138)
	等待到指定地图("盖雷布伦森林")
	自动寻路(108,135)
	自动寻路(113,140)
	自动寻路(113,144)
	自动寻路(124,155)
	自动寻路(124,168)

	等待到指定地图("温迪尔平原")
	
	自动寻路(224,72)
	自动寻路(236,84)
	
	自动寻路(237,84)
	自动寻路(243,90)
	自动寻路(243,94)
	自动寻路(248,99)
	自动寻路(248,108)
	自动寻路(264,108)
	

	等待到指定地图("艾尔莎岛")
	
	自动寻路(121,102)
	
	自动寻路(121,103)
	自动寻路(128,103)
	自动寻路(130,105)
	自动寻路(140,105)
	自动寻路(141,106)	
	转向(1)
	等待服务器返回()
	对话选择(4,0)

::star::
    自动寻路(140,105)
	if (人物("魔") < 1 )then	
		goto bu
	end
	if (取包裹空格() < 2 )then	
		goto mai
	end
	if (是否打卡 == 0) then
		goto go
	end
	自动寻路(150, 105)
	自动寻路(157, 96)
	自动寻路(200, 96)
	自动寻路( 201, 96)
	等待到指定地图("神殿　伽蓝")	
	自动寻路(85, 92)
    自动寻路(94, 88)	
	转向(2)
	等待服务器返回()
	对话选择(4,0)
	等待服务器返回()
	对话选择(1,0)	
	自动寻路(87, 87)
	自动寻路(87, 58)
	自动寻路(80, 55)
	自动寻路( 79, 55)
	等待到指定地图("艾尔莎岛")	
	自动寻路(156, 62)
	自动寻路(148, 57)
	自动寻路(138, 61)
	自动寻路(138, 59)
	自动寻路(138, 58)
	自动寻路(131, 51)
	自动寻路( 130, 50)	
	等待到指定地图("盖雷布伦森林")
	goto gogogo
        
::go::
	自动寻路(143,105)
	自动寻路(161,87) 
	自动寻路(161,81)
	自动寻路(140,60)
	自动寻路(138,60)
	自动寻路(138, 59)
	自动寻路(138, 58)
	自动寻路(131, 51)
	自动寻路( 130, 50)       
       
::gogogo::
	等待到指定地图("盖雷布伦森林")	
	自动寻路(178,179)
	自动寻路(175,182)        
	扔("魔石")
	扔("地的水晶碎片")
	扔("水的水晶碎片")
	扔("火的水晶碎片")
	扔("风的水晶碎片")
::work::
	工作("狩猎",0,5000)
	等待工作返回(5000)
	if (取包裹空格() < 1 )then	
		goto begin
	end	
	if (人物("魔") < 1 )then	
		goto begin
	end			
    goto work
::bu::
	自动寻路(140,105)     	
	转向(1)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")	
	自动寻路(31,82)
	自动寻路(31,90)
	自动寻路(34,90)
	自动寻路(34,89)
	转向(0)			-- 转向北边恢复人宠血魔
	等待回补()
	goto begin
::mai::	
	转向(1)
	等待服务器返回()
	对话选择(4,0)
	等待到指定地图("里谢里雅堡")
	if(是否卖 ~= 1)then
		goto cun
	end	
	自动寻路(30, 82)
	自动寻路(30, 79)
	扔叠加物("鹿皮", 40)	
	卖(0,"鹿皮")	
	等待(1000)	
	--卖(0,"鹿皮")	
	--printf(钱)
	goto begin
::cun::

	自动寻路(41, 82)
	自动寻路(41, 97)
	自动寻路( 41, 98)	
	等待(1000)	--切换	
	自动寻路(153, 130)
	自动寻路(162, 130)	
	转向(2)
		
	等待(1000)	--切换		
	转向(2)	
	等待(1000)	--切换	
	自动寻路(233,88)
	自动寻路(237,92)
	自动寻路(237,104)
	自动寻路(235,106)
	自动寻路(235,111)
	自动寻路(237,111)
	等待(3000)
	自动寻路(238,111)	
	等待到指定地图("银行")	
	
	扔叠加物("鹿皮", 40)
	自动寻路(6,13)
	自动寻路(11,8)
	等待到指定地图("银行", 11, 8)	
	转向(2)
	等待服务器返回()

::sale_4::
	银行("全存","鹿皮",40)
	goto begin


::manle::
	if (取包裹空格() < 2 )then	
		goto begin
	end
::Endl::
	
        
	








                                   

