阿开路法村多挂点打石脚本,适合20级左右人物，起如点在阿凯鲁法村99, 165登录点.注意,如果是弓手请多带平民弓放于银行,不然每次坐船回去买弓是很麻烦的
-- 设定自动战斗设置
设置("timer", 100)						-- 设置定时器，单位毫秒
停止遇敌()

设置("自动战斗", 1)
设置("高速战斗", 5)
设置("高速延时", 6)

勾玉补魔值=用户输入框( "多少魔以下补魔", "100")
勾玉补血值=用户输入框( "多少血以下补血", "100")
勾玉宠补血值=用户输入框( "宠多少血以下补血", "100")
勾玉宠补魔值=用户输入框( "宠多少魔以下补魔", "100")
勾玉数=用户输入框( "打到多少组勾玉退出", "10")


-- 设定自动及保护设置
				-- 自动遇敌
设置("timer", 300)		-- 设置定时器，单位毫秒

		-- 设置成原地随机遇敌
	-- 设置定时器，单位毫秒


清除系统消息()
if(人物("坐标")  == "9,4")then	goto jixu end
if(取当前地图名() ==  "时波之祠地下1楼")then goto kaishi end
goto begin 


::begin::
	set("auto_action", "AutoFlee", 1)		-- 全跑
	
	回城()
	等待(3000)
	等待到指定地图("阿凯鲁法村", 99, 165)
	移动(94, 165)
	移动(94, 170)
	移动(104, 180)
	移动(116, 180)
	移动(119, 183)
	移动(119, 188)
	移动(137, 188)
	移动(142, 193)
	移动(171, 193)
	移动(178, 200)
	
::jiaxie::
	移动(178, 211)
	移动(192, 211)
	移动( 192, 208)
	等待到指定地图("冒险者旅馆 1楼",1)
	移动(4, 21)
	移动(7, 19)
	移动(21, 19)
	移动(21, 17)
	移动(22, 17)
	回复("north")		-- 恢复人宠
	
	移动(14, 17)
	移动(12, 19)
	移动(4, 19)
	移动( 4, 23)
	等待到指定地图("阿凯鲁法村", 1)
	移动(192, 211)
	移动(178, 211)
::budaka::
	移动(178, 222)
	移动( 178, 227)
	等待到指定地图("米内葛尔岛", 1)
	移动(203, 397)
	移动(208, 402)
	移动(208, 412)
	移动(194, 426)
	移动(194, 445)
	移动(187, 452)
	移动(187, 461)
	移动(193, 467)
	移动(193, 473)
	移动(200, 480)
	移动(200, 484)
	移动(208, 484)
	移动(208, 486)
	移动(211, 486)
	移动(211, 487)
	移动(221, 487)
	移动(222, 486)
	移动(233, 486)
	移动(236, 489)
	移动(244, 489)
	移动(246, 487)
	移动(247, 487)
	移动(247, 477)
	移动(249, 477)
	移动(249, 467)
	移动(244, 462)
	移动(244, 453)
	移动(248, 449)
	移动(248, 442)
	移动(246, 440)
	移动(243, 440)
	移动(239, 436)
	移动(239, 429)
	移动(230, 429)
	移动(230, 414)
	移动(235, 409)
	移动(235, 407)
	移动(241, 401)
	移动(250, 401)
	移动(250, 405)
	移动(254, 409)
	移动(254, 413)
	移动(257, 413)
	移动(257, 415)
	移动(260, 418)
	移动(260, 423)
	移动(263, 426)
	移动(263, 434)
	移动(271, 434)
	移动(275, 438)
	移动(275, 445)
	移动(273, 447)
	移动(277, 451)
	移动(277, 456)
	移动(278, 456)
	移动(278, 457)
	移动(281, 457)
	移动( 283, 457)
	等待到指定地图("南恰拉山第1通路", 1)
	移动(21, 64)
	移动(21, 56)
	移动(19, 56)
	移动(19, 51)
	移动(21, 49)
	移动(21, 41)
	移动(15, 41)
	移动(15, 37)
	移动(6, 37)
	移动(6, 49)
	移动(8, 49)
	移动(9, 61)
	
	移动一格(2)
	
	等待(2000)
	移动(15, 41)
	移动(15, 39)
	移动(23, 39)
	移动(23, 36)
	移动(25, 34)
	移动(25, 28)
	移动(24, 28)
	移动(21, 25)
	移动(20, 25)
	移动(19, 24)
	移动(18, 24)
	移动(16, 22)
	移动(15, 22)
	移动(15, 17)
	移动(23, 9)
	移动(23, 5)
	移动(11, 5)
	移动(11, 3)
	
	移动一格(0)
	
	等待(2000)
	移动(22, 9)
	移动(24, 7)
	移动(27, 7)
	移动(29, 5)
	移动(36, 5)
	
	移动一格(2)
	
	等待(2000)
	移动(298, 409)
	移动(304, 409)
	移动(313, 400)
	移动( 314, 399)
	等待到指定地图("南恰拉山第2通路", 1)
	移动(9, 63)
	移动(22, 63)
	移动(24, 61)
	移动(33, 61)
	移动(38, 56)
	移动(41, 56)
	移动(41, 50)
	移动(38, 47)
	移动(27, 47)
	移动(25, 49)
	移动(17, 49)
	移动(17, 40)
	移动(22, 40)
	移动(28, 34)
	移动(28, 32)
	移动(31, 29)
	移动(31, 28)
	移动(35, 24)
	移动(35, 16)
	移动(32, 13)
	移动(32, 10)
    
    转向(0, "")
    等待服务器返回()
    对话选择("1", "", "")
	等待到指定地图("时波之祠", 1)
	移动( 9, 4)
	等待到指定地图("时波之祠地下1楼", 1)
	等待(2000)
	set("auto_action", "AutoFlee", 0)
	

::kaishi::
          
      	等待(2000)
	 移动一格(4) 
        等待(1000)
       	
        开始遇敌()   
	goto scriptstart 

::scriptstart::
	if(人物("魔") < 勾玉补魔值)then goto  end end
	if(人物("血") < 勾玉补血值)then goto  end end
	if(宠物("血") < 勾玉宠补血值)then goto  end end
	if(宠物("魔") < 勾玉宠补魔值)then goto  end end
	if(string.find(最新系统消息()," 被不可思议的力量送出了")~=nil)then goto  jixu	end
	if(string.find(最新系统消息()," 你感觉到一股")~=nil)then goto  ting	end
	if(取物品数量("勾玉的碎片") > 勾玉数)then goto  exit end
	goto scriptstart 
::jixu::
	停止遇敌()
        
        等待(1000)
	
        等待(1000)
	移动一格(4)
        等待(4000) 
	移动一格(0)
        等待(4000) 
	等待到指定地图("时波之祠地下1楼", 1)
	等待(2000)
	goto kaishi 
::ting::
	清除系统消息()
	 停止遇敌()
       
       等待(1000)
       
	 等待(1000)
       移动一格(0)
	等待到指定地图("时波之祠", 1)
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
	等待(15000) 
	
	等待(15000) 
	
	等待(15000) 
	
	goto jixu 
::end::
	
	停止遇敌()				-- 结束战斗
	goto begin 
::exit::
	exit
