阿开路法村多挂点打石脚本,适合20级左右人物，起如点在阿凯鲁法村99, 165登录点.注意,如果是弓手请多带平民弓放于银行,不然每次坐船回去买弓是很麻烦的
-- 设定自动战斗设置
设置("timer", 100)						-- 设置定时器，单位毫秒
停止遇敌()

设置("自动战斗", 1)
设置("高速战斗", 5)
设置("高速延时", 6)

勾玉补魔值=用户输入框( "多少魔以下补魔", "100")
勾玉补血值=用户输入框( "多少血以下补血", "100")
勾玉宠补血值=用户输入框( "宠多少血以下补血", "100")
勾玉宠补魔值=用户输入框( "宠多少魔以下补魔", "100")
勾玉数=用户输入框( "打到多少组勾玉退出", "10")


-- 设定自动及保护设置
				-- 自动遇敌
设置("timer", 300)		-- 设置定时器，单位毫秒

		-- 设置成原地随机遇敌
	-- 设置定时器，单位毫秒


清除系统消息()
if(人物("坐标")  == "9,4")then	goto jixu end
if(取当前地图名() ==  "时波之祠地下1楼")then goto kaishi end
goto begin 


::begin::
	set("auto_action", "AutoFlee", 1)		-- 全跑
	
	回城()
	等待(3000)
	等待到指定地图("阿凯鲁法村", 99, 165)
	自动寻路(94, 165)
	自动寻路(94, 170)
	自动寻路(104, 180)
	自动寻路(116, 180)
	自动寻路(119, 183)
	自动寻路(119, 188)
	自动寻路(137, 188)
	自动寻路(142, 193)
	自动寻路(171, 193)
	自动寻路(178, 200)
	
::jiaxie::
	自动寻路(178, 211)
	自动寻路(192, 211)
	自动寻路( 192, 208)
	等待到指定地图("冒险者旅馆 1楼",1)
	自动寻路(4, 21)
	自动寻路(7, 19)
	自动寻路(21, 19)
	自动寻路(21, 17)
	自动寻路(22, 17)
	回复("north")		-- 恢复人宠
	
	自动寻路(14, 17)
	自动寻路(12, 19)
	自动寻路(4, 19)
	自动寻路( 4, 23)
	等待到指定地图("阿凯鲁法村", 1)
	自动寻路(192, 211)
	自动寻路(178, 211)
::budaka::
	自动寻路(178, 222)
	自动寻路( 178, 227)
	等待到指定地图("米内葛尔岛", 1)
	自动寻路(203, 397)
	自动寻路(208, 402)
	自动寻路(208, 412)
	自动寻路(194, 426)
	自动寻路(194, 445)
	自动寻路(187, 452)
	自动寻路(187, 461)
	自动寻路(193, 467)
	自动寻路(193, 473)
	自动寻路(200, 480)
	自动寻路(200, 484)
	自动寻路(208, 484)
	自动寻路(208, 486)
	自动寻路(211, 486)
	自动寻路(211, 487)
	自动寻路(221, 487)
	自动寻路(222, 486)
	自动寻路(233, 486)
	自动寻路(236, 489)
	自动寻路(244, 489)
	自动寻路(246, 487)
	自动寻路(247, 487)
	自动寻路(247, 477)
	自动寻路(249, 477)
	自动寻路(249, 467)
	自动寻路(244, 462)
	自动寻路(244, 453)
	自动寻路(248, 449)
	自动寻路(248, 442)
	自动寻路(246, 440)
	自动寻路(243, 440)
	自动寻路(239, 436)
	自动寻路(239, 429)
	自动寻路(230, 429)
	自动寻路(230, 414)
	自动寻路(235, 409)
	自动寻路(235, 407)
	自动寻路(241, 401)
	自动寻路(250, 401)
	自动寻路(250, 405)
	自动寻路(254, 409)
	自动寻路(254, 413)
	自动寻路(257, 413)
	自动寻路(257, 415)
	自动寻路(260, 418)
	自动寻路(260, 423)
	自动寻路(263, 426)
	自动寻路(263, 434)
	自动寻路(271, 434)
	自动寻路(275, 438)
	自动寻路(275, 445)
	自动寻路(273, 447)
	自动寻路(277, 451)
	自动寻路(277, 456)
	自动寻路(278, 456)
	自动寻路(278, 457)
	自动寻路(281, 457)
	自动寻路( 283, 457)
	等待到指定地图("南恰拉山第1通路", 1)
	自动寻路(21, 64)
	自动寻路(21, 56)
	自动寻路(19, 56)
	自动寻路(19, 51)
	自动寻路(21, 49)
	自动寻路(21, 41)
	自动寻路(15, 41)
	自动寻路(15, 37)
	自动寻路(6, 37)
	自动寻路(6, 49)
	自动寻路(8, 49)
	自动寻路(9, 61)
	
	移动一格(2)
	
	等待(2000)
	自动寻路(15, 41)
	自动寻路(15, 39)
	自动寻路(23, 39)
	自动寻路(23, 36)
	自动寻路(25, 34)
	自动寻路(25, 28)
	自动寻路(24, 28)
	自动寻路(21, 25)
	自动寻路(20, 25)
	自动寻路(19, 24)
	自动寻路(18, 24)
	自动寻路(16, 22)
	自动寻路(15, 22)
	自动寻路(15, 17)
	自动寻路(23, 9)
	自动寻路(23, 5)
	自动寻路(11, 5)
	自动寻路(11, 3)
	
	移动一格(0)
	
	等待(2000)
	自动寻路(22, 9)
	自动寻路(24, 7)
	自动寻路(27, 7)
	自动寻路(29, 5)
	自动寻路(36, 5)
	
	移动一格(2)
	
	等待(2000)
	自动寻路(298, 409)
	自动寻路(304, 409)
	自动寻路(313, 400)
	自动寻路( 314, 399)
	等待到指定地图("南恰拉山第2通路", 1)
	自动寻路(9, 63)
	自动寻路(22, 63)
	自动寻路(24, 61)
	自动寻路(33, 61)
	自动寻路(38, 56)
	自动寻路(41, 56)
	自动寻路(41, 50)
	自动寻路(38, 47)
	自动寻路(27, 47)
	自动寻路(25, 49)
	自动寻路(17, 49)
	自动寻路(17, 40)
	自动寻路(22, 40)
	自动寻路(28, 34)
	自动寻路(28, 32)
	自动寻路(31, 29)
	自动寻路(31, 28)
	自动寻路(35, 24)
	自动寻路(35, 16)
	自动寻路(32, 13)
	自动寻路(32, 10)
    
    转向(0, "")
    等待服务器返回()
    对话选择("1", "", "")
	等待到指定地图("时波之祠", 1)
	自动寻路( 9, 4)
	等待到指定地图("时波之祠地下1楼", 1)
	等待(2000)
	set("auto_action", "AutoFlee", 0)
	

::kaishi::
          
      	等待(2000)
	 移动一格(4) 
        等待(1000)
       	
        开始遇敌()   
	goto scriptstart 

::scriptstart::
	if(人物("魔") < 勾玉补魔值)then goto  end end
	if(人物("血") < 勾玉补血值)then goto  end end
	if(宠物("血") < 勾玉宠补血值)then goto  end end
	if(宠物("魔") < 勾玉宠补魔值)then goto  end end
	if(string.find(最新系统消息()," 被不可思议的力量送出了")~=nil)then goto  jixu	end
	if(string.find(最新系统消息()," 你感觉到一股")~=nil)then goto  ting	end
	if(取物品数量("勾玉的碎片") > 勾玉数)then goto  exit end
	goto scriptstart 
::jixu::
	停止遇敌()
        
        等待(1000)
	
        等待(1000)
	移动一格(4)
        等待(4000) 
	移动一格(0)
        等待(4000) 
	等待到指定地图("时波之祠地下1楼", 1)
	等待(2000)
	goto kaishi 
::ting::
	清除系统消息()
	 停止遇敌()
       
       等待(1000)
       
	 等待(1000)
       移动一格(0)
	等待到指定地图("时波之祠", 1)
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
       等待(15000) 
	
	等待(15000) 
	
	等待(15000) 
	
	等待(15000) 
	
	goto jixu 
::end::
	
	停止遇敌()				-- 结束战斗
	goto begin 
::exit::
	exit
