设置脚本简介("启动点, 艾尔莎岛。请设置脚本停止160秒重启。因为要购买酱油和砂糖 请多备点钱 需要狩猎5级   设置自动叠加盐，酱油，砂糖，葱，寿喜锅 牛肉 盐  自动扔碎片 魔石 以及哥布林 盗贼 迷你蝙蝠卡片等。   星落制作：274100927 ")

::begin::	
    回城()
	等待到指定地图("艾尔莎岛")
	转向(2)
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡")	
	等待(500)
    myren("葱", 20)
	等待(500)
        myren("盐", 20)
	等待(500)
	myren("牛肉", 20)
	
	移动(30,90)
	移动(34,90)
	移动(34,89)
	renew(1002)
	等待到指定地图(renew)
	
	if("物品", "砂糖", ">", "0", make)
	goto(Startbegin)
::make::
	if("物品", "砂糖", "<", "1", Startbegin)
	Work(100, 7) //第一步
	renew(1002)			// 转向北边恢复人宠血魔
	等待到指定地图(renew)
	等待(7000) //待8秒
	Compound("寿喜锅", 0)
	moveres("寿喜锅",3)
	等待(1000)
	moveres("盐",40)
	等待(1000)
	moveres("酱油",40)
	等待(1000)
	moveres("牛肉",40)
	等待(1000)
	moveres("葱",40)
	等待(1000)
	goto(make)

::Startbegin::
        回城
	等待到指定地图("艾尔莎岛", 1)
	
	等待(500)
        myren("葱", 20)
	等待(500)
        myren("盐", 20)
	等待(500)
	myren("牛肉", 20)
	
	if("人", "血", "<", 50, begin)
	if("人", "魔", "<", 10, begin)
	if("物品", "寿喜锅", ">", "1", cun)
	if("物品", "酱油", "=", "3", weiruoya)
	if("物品", "牛肉", "=", "3", yiercun)
	if("物品", "盐", "=", "3", niurou)
	移动(145,105)
	移动(157,93)
	等待(500)
	转向(3)
	
	等待到指定地图("艾夏岛", 1)
	
	等待(500)
	转向(7)
	
	等待到指定地图("艾夏岛", 1)
	
	等待(500)
	转向(8)
	
	等待到指定地图("艾夏岛", 1)
	
	等待(500)
	移动(152,97)
	移动(159,104)
	移动(159,112)
	移动(165,112)
	移动(167,114)
	移动(184,114)
	移动(186,116)
	移动(189,116)
	high(10,190,116)
	
	等待到指定地图("盖雷布伦森林", 1)
	
	if("物品", "葱", "=", "3", startwork1)
	
	移动(211, 211)
	移动(211, 224)
	移动(214, 224)
	移动(214, 229)
	移动(224, 229)
	移动(230, 223)
	移动(231, 222)
	
	
	等待到指定地图("布拉基姆高地", 1)
	
	
	移动(33, 190)
	移动(33, 189)
	移动(34, 189)
	移动(37, 186)
	移动(41, 186)
	移动(54, 197)
	移动(58, 195)
	移动(60, 193)
	移动(61, 194)
	移动(61, 195)
	
	goto startwork

::startwork::
	if("物品", "葱", ">", "3", begin)
	if("人", "魔", "<", 1, begin)
	Work(103, "")
	
	等待(6000)
	goto(startwork)

::startwork1::
	if("物品", "盐", ">", "3", begin)
	if("人", "魔", "<", 1, begin)
	Work(103, "")
	
	等待(6000)
	goto startwork1

::niurou::
	
	等待到指定地图("艾尔莎岛", 1)	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡", 1)
	
	移动(30,82)
	移动(41,71)
	移动(41, 51)
	movego(1002,1)
	
	等待到指定地图("里谢里雅堡\S1楼", 1)
	
	移动(74, 34)
	移动(64, 24)
	移动(49, 24)
	移动(46, 21)
	movego(1008,1)
	
	等待到指定地图("启程之间", 1)

	
	转向(5)
	移动(25, 30)
	移动(21, 34)
	移动(8, 34)
	移动(8, 33)	
	
	转向(1)
	等待服务器返回()
	对话选择(4, 0)
	
	goto ylt
::ylt::
	等待到指定地图("奇利村的传送点", 1)
	
	
	移动(7, 8)
        移动(7,7)
	移动(7, 6)
	

	等待到指定地图("村长的家", 1)
	

	移动(7, 3)
        移动(7,2)
	移动( 7,1)
	

	等待到指定地图("村长的家", 1)
	
        
        移动(10,14)
        
	移动(10,11)
	移动(7, 8)
	移动(3, 8)
	移动(1, 8)
	

	等待到指定地图("奇利村", 1)
	

	移动(47, 66)
	移动(47, 71)
	移动(60, 71)
	移动(60, 79)
	移动(63, 79)
	移动(63, 83)
	移动(73, 83)
	移动(73, 76)
	移动(77, 76)
	移动(79, 76)
	

	等待到指定地图("索奇亚", 1)
	
	

	移动(298,324)
	移动(298,331)
	移动(300,331)
	移动(300,336)
	移动(305,336)
	移动(309,336)
	移动(311,336)
　　	移动(315,336)
　　	移动(318,336)
	移动(321,336)


	
	转向(6)
        ren("卡片?")
        ren("魔石")
        ren("地的水晶碎片")
        ren("水的水晶碎片")
        ren("火的水晶碎片")
        ren("风的水晶碎片")

::work::
	Work(103, "")
	if("物品", "牛肉", ">", "3", begin)				
	if("人", "魔", "<", 1, begin)		      
	等待(5000)    
        goto(work)



::yiercun::
	等待到指定地图("艾尔莎岛")	
	
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("里谢里雅堡")	
	移动(41, 82)
	移动(41, 51)
	movego(1002,1)
	
	等待到指定地图("里谢里雅堡 1楼")	

	移动(74, 37)
	移动(74, 24)
	移动(45, 24)
	high(10,45, 20)
	

	等待到指定地图("启程之间")
	
	移动(25, 33)
	移动(44, 33)	

	转向(1)
	等待服务器返回()
	对话选择(4, 0)
	
	等待到指定地图("伊尔村的传送点")
	

	移动(20, 11)
	移动(20, 18)
	移动(20, 19)
	移动(13, 19)
	移动(12, 19)
	high(10,12, 17)
	

	等待到指定地图("村长的家")
	

	移动(16, 17)
	移动(16, 13)
	移动(15, 13)
	移动(9, 13)
	移动(8, 13)
	high(10,6, 13)
	
	等待到指定地图("伊尔村")
	
        移动(36, 72)
	
        移动(31, 72)
	
        移动(31, 65)
	
        移动(32, 65)
	
	等待到指定地图("旧金山酒吧")
	
        移动(18, 19)
	
        移动(18, 11)
	
	
::maijiangyou::	
	
	转向(3)                 
	等待服务器返回()	
	对话选择(0, 0)
	等待服务器返回()	
	购买(2,120)
	goto(begin)
::weiruoya::
	等待到指定地图("艾尔莎岛")
	
	
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("里谢里雅堡")
	
	移动(41, 82)
	移动(41, 51)
	movego(1002,1)	
	等待到指定地图("里谢里雅堡\S1楼")
	

	移动(74, 37)
	移动(74, 24)
	移动(45, 24)
	high(10,45, 20)
	

	等待到指定地图("启程之间")
	
	移动(25, 27)
	移动(21, 27)
	移动(17, 23)
	移动(8, 23)
	

	转向(1)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("维诺亚村的传送点")	
	high(10, 5, 1)

	等待到指定地图("村长家的小房间")
	
        移动(8, 5)
	
        移动(9, 5)
	
	等待到指定地图("村长的家")
	
        移动(6, 11)
	
        移动(11, 6)	
	
	转向(3)                 
	等待服务器返回()	
	对话选择(0, 1)
	等待服务器返回()	
	购买(0,120)
	goto begin
::cun::
	等待到指定地图(艾尔莎岛)
	移动(146,105)
	移动(157,94)
	
	转向(2,)
	等待到指定地图("艾夏岛")
        

        移动(87,112)
     	移动(95,104)
	移动(114,104)
	等待到指定地图("银行")
	
	移动(27,25)
	移动(49,25)	
	转向(3)
	等待服务器返回()
::Bank::
	对话选择("存条", "寿喜锅", "3")
	等待(1000)
	if("银行", "数量", "=", "80", Sale)
	if("物品", "寿喜锅", ">", "1", Bank)
	if("物品", "寿喜锅", "=", "1", panduan)
	printf("钱")
	goto begin
::panduan::
	if("物品数量", "寿喜锅", >, 2 , Bank)
	goto begin
::panduan1::
	ren("砂糖")
	等待(500)
	if("物品", "砂糖", ">", "3", ren)
::ren::
	ren("砂糖")
	等待(5000)
	移动(140,109)
	ren("砂糖")
	if("物品", "砂糖", "<", "1", begin)
	goto ren
::Sale::
	
	喊话("银行满了，转移完了重新执行",2,3,5)	
	等待(1000)
	goto Sale