刷【怪物硬币】启动点::艾尔莎,公寓,刚学的鉴定技能会卡住，登出重刷
	
	
common=require("common")

清除系统消息()	
--设置("timer", 100)	
	
	
设置("高速延时", 3)	
设置("自动叠",1,"５怪物硬币&100")
设置("自动叠",1,"１怪物硬币&100")
设置("自动叠",1,"地的水晶碎片&999")
设置("自动叠",1,"水的水晶碎片&999")
设置("自动叠",1,"火的水晶碎片&999")
设置("自动叠",1,"风的水晶碎片&999")
设置("自动叠",1,"封印卡（野兽系)&20")
设置("自动叠",1,"封印卡（金属系）&20")
设置("自动叠",1,"封印卡（飞行系）&20")
-- 设置("自动扔",1,"卡片？")
-- 设置("自动扔",1,"魔石")
-- 设置("自动扔",1,"达杰乌鲁姆的卡片")
-- 设置("自动扔",1,"第七星阿尔多拉的卡片")
-- 设置("自动扔",1,"封印卡（野兽系)")
-- 设置("自动扔",1,"欧比尔蝙蝠的卡片")
-- 设置("自动扔",1,"封印卡（金属系）")

isSuccessed=false		--是否成功鉴定过
	

补血值=取脚本界面数据("人补血")
补魔值=取脚本界面数据("人补魔")
宠补血值=取脚本界面数据("宠补血")
宠补魔值=取脚本界面数据("宠补魔")

if(补血值==nil or 补血值==0)then
	补血值=用户输入框("多少血以下补血", "430")
end
if(补魔值==nil or 补魔值==0)then
	补魔值 = 用户输入框("多少魔以下补魔", "200")
end
if(宠补血值==nil or 宠补血值==0)then
	宠补血值 = 用户输入框( "宠多少血以下补血", "300")
end
if(宠补魔值==nil or 宠补魔值==0)then
	宠补魔值=用户输入框( "宠多少魔以下补魔", "150")
end

function 鉴定()	
	local tryCount=0
	while 人物("魔")>= 10 and tryCount<200 do	--取物品数量("硬币？") > 0 and 
		工作("鉴定","",15000,true)					
		等待(500)
		tryCount = tryCount+1
	end	
end
function main()
	local skill=common.findSkillData("鉴定")
	if(skill == nil)then
		日志("提示：没有鉴定技能！",1)
		return
	end
::begin::	
	等待空闲()
	if(取当前地图名() == "公寓")then goto 补魔 end 
	if(取当前地图名() == "辛梅尔")then goto 开始 end 
	if(取当前地图名() == "艾尔莎岛")then goto 出发 end
	if(取当前地图名() == "光之路")then goto 摆摊 end 
	common.checkHealth()
	common.checkCrystal(水晶名称)
	回城()
	等待(2000)
	goto begin 
::出发::		
	移动(165,153)	
	转向(4)
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("利夏岛")	
	移动(90,99,"国民会馆")	
	移动(108,39,"雪拉威森塔１层")
	移动(34,95)	
	转向(2)
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
::开始::		
	等待到指定地图("辛梅尔")	
	移动(181,81,"公寓")	
	移动(93,58)   	
::补魔::	
	移动(91,58)   	 
	回复(0)	
	日志("人物金币："..人物("金币"))	 
	if(取物品数量(硬币？) > 0)then 鉴定() end
	if(取物品叠加数量("５怪物硬币")>= 100 or 取物品叠加数量("１怪物硬币")>= 100)then
		移动(106,63)
		转向(2)
		等待服务器返回()
		银行("全存","５怪物硬币",100)
		银行("全存","１怪物硬币",100)
		-- items =物品信息()
		-- for i,v in pairs(items) do
			-- if((v.name == "５怪物硬币" || v.name == "１怪物硬币") and v.count ==100)then
				
			-- end
		-- end
	end   
	移动(100,70,"辛梅尔")	 	
	移动(207,91,"光之路")			
::摆摊::
	移动(165, 82)		
	转向(4)
	人物动作("动作",1)		--坐下
	--等待交易()
	if(人物("魔") < 补魔值)then goto 回补 end
	if(人物("血") < 补血值)then goto  回补 end
	if(取包裹空格() < 1)then goto 鉴定1 end
	if(取当前地图名() ~= "光之路")then goto begin end 	
	goto 摆摊 

::回补::		
	停止遇敌()	
	common.checkHealth()
	移动(201, 19,"辛梅尔")		
	移动(191,99)
	goto 开始 
::鉴定1::		
	停止遇敌()	
	鉴定()
	if(取包裹空格() < 1)then goto 回补 end
	goto 摆摊 
end

main()