★起点艾尔莎岛登入点，游民就职请自己购买武器，有职业的去拿推荐信不用购买武器。


	喊话("游民就职请事先自己购买好对应武器!",0,0,0)  
	等待(2000)
	设置("自动卖",0)
::start::
	等待空闲()
	if(取当前地图名() ==  "艾尔莎岛")then goto   aiersa end  
	if(取当前地图编号() == 1112)then goto maiZhiTongYao end  	
	回城()
	等待(2000)
::aiersa::
	等待到指定地图("艾尔莎岛")
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡")	     

	移动(34,89)
	回复(1)			-- 转向北边恢复人宠血魔
    移动(65, 53)        
	等待到指定地图("法兰城")	
    移动(221, 83,"医院")
::maiZhiTongYao::	
	移动(16, 36)	
	转向(0, "")                
	等待服务器返回()		
	对话选择(0,0) --第二个参数0 0买 1卖 2不用了
	local dlg = 等待服务器返回()
	local buyData = 解析购买列表(dlg.message)
	local itemList = buyData.items
	local dstItem = nil
	for i,item in ipairs(itemList)do
		if(string.find(item.name,"止痛药") ~= nil) then
			dstItem={index=i-1,count=1}			
		end
	end
	if (dstItem ~= nil)then
		买(dstItem.index,dstItem.count)
		等待(1000)		
	else
		日志("购买失败！")
		return false
	end		
    移动(12, 40)		
    移动(12, 42)	
	等待到指定地图("法兰城")	
    移动(242, 100)
	转向(2, "")			
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")			
	等待到指定地图("法兰城", 141, 148)	
	转向(0, "")			
	等待到指定地图("法兰城", 63, 79)
	移动(73, 60)	
	等待到指定地图("职业公会")	
    移动(8, 6)	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
    移动(9, 24)       
	等待到指定地图("法兰城")	
    移动(22, 88)	
	等待到指定地图("芙蕾雅", 1)
	移动(351, 145,"国营第24坑道 地下1楼")		
	移动(9, 15)	
	转向(0, "")
	等待服务器返回()
	对话选择("1", "", "")
	等待到指定地图("国营第24坑道 地下1楼", 7,15)	
	移动(9, 5,"试炼之洞窟 第1层")	
    移动(33, 31,"试炼之洞窟 第2层")
	移动(7, 9,"试炼之洞窟 第3层")
	移动(42, 34,"试炼之洞窟 第4层")    
	移动(27, 12,"试炼之洞窟 第5层")	     	
    移动(39, 36,"试炼之洞窟 大厅")
    移动(22, 19)	
    喊话("游民请携带对应武器和前面的士兵对话拿推荐信!",0,0,0)
	等待(1000)
    喊话("本身有职业的玩家，和后面的士兵说要转职业的正职称号，拿对应推荐信，比如“驯兽师”",0,0,0)
	等待(10000)
       
