--定居艾尔莎岛


设置("timer", 100)

::begin::	
	if(取当前地图名() == "汉克的房间")then goto  getjuan end
	if(取当前地图名() == "豪华屋")then goto  tohanke end
	if(取当前地图名() == "港湾管理处")then goto  ToYouTing end
	if(取物品数量("游艇招待卷") >= 1)then goto toYiErCun end
	if(取物品数量("汉克写的信") >= 1)then goto ToWQSGongJueHome end
	if(取当前地图名() == "休息室")then goto  XiuXiShi end
	if(取当前地图名() == "食堂")then goto  ShiTang end
	if(取当前地图名() == "平台")then goto  pingTai end
	if(取当前地图名() == "客房通路")then goto  keFangTongDao end
	if(取当前地图名() == "客房")then goto  keFang end
	if(取当前地图名() ==  "艾尔莎岛")then goto   aidao end
	if(人物("坐标")  == "13,9")then	goto  chuShiTang end	--chuShiTang
	if(人物("坐标")  == "233,78")then	goto  e2 end	-- 东2登录点
	if(人物("坐标")  == "162,130")then	goto  s2 end	-- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1 end		-- 西1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	-- 东1登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	-- 南1登录点
	goto begin 		
::aidao::
	等待到指定地图("艾尔莎岛",1)
	移动(140,105)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("里谢里雅堡", 1)
	
	移动(36, 82)
	移动(41, 87)
	移动(41, 98)
	
	等待到指定地图("法兰城", 1)
	
	移动(153, 148)
	移动(158, 157)
	移动(165, 164)
	移动(165, 174)
	移动(171, 174)
	移动(172, 174)
	
::tohanke::
	等待到指定地图("豪华屋", 1)
	
	移动(13, 20)
	移动(7, 20)
	
	移动(7, 18)
	
::getTask::
	移动(7, 18)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")
	等待(4000)
	if(取当前地图名() ==  "汉克的房间")then goto   getjuan end
	goto getTask 		
::getjuan::
	等待到指定地图("汉克的房间", 1)
	
	移动(7, 6)
	
	移动(6, 6)
	
	移动(6, 4)
	
	
	转向(0, "")	
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")
	移动(5, 6)
	
	
	转向(4, "")	
	喊话("拿...", "5", "5", "0")	
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	
	移动(4, 6)
	
	移动(4, 7)
	
	
	转向(5, "")	
	喊话("看...", "5", "5", "0")	
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	
	移动(4, 5)
	
	移动(5, 4)
	
	
	转向(1, "")	
	喊话("硬币...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	转向(1, "")		
	等待服务器返回()
	对话选择("1", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	等待到指定地图("豪华屋", 1)
	
	回城()
	goto begin 
::toYiErCun::	
	等待(1000)
	移动(140,105)
	
	
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	

	等待到指定地图("里谢里雅堡", 1)
	

	
	转向(2, "")
	移动(28, 82)

::goto2::
	移动(41, 69)

	移动(41,51)
	
	移动(41,50)
	

	等待到指定地图("里谢里雅堡 1楼", 1)
	
	移动(74,30)
	移动(68,24)
	移动(49,24)
	移动(45,20)

	等待到指定地图("启程之间", 1)
	

	移动(25, 27)
	移动(33, 27)
	移动(34, 27)
	移动(34, 32)
	移动(34, 33)
	移动(42, 33)
	移动(43, 33)
	
	if(取物品数量( "传送石优待卷") >  0)then goto  aaa end	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	goto ylt 
::aaa::
	
	转向(1, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	

::ylt::
	等待到指定地图("伊尔村的传送点", 1)
	
	移动(20, 11)
	移动(20, 18)
	移动(20, 19)
	移动(13, 19)
	移动(12, 19)
	移动(12, 17)
	

	等待到指定地图("村长的家", 1)
	

	移动(16, 17)
	移动(16, 13)
	移动(15, 13)
	移动(9, 13)
	移动(8, 13)
	移动(6, 13)
	
	等待到指定地图("伊尔村", 1)
	

	移动(46, 83)
	移动(46, 78)
	移动(53, 71)
	移动(58, 71)
	
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("伊尔", 1)
	
	移动(22, 20)
	移动(29, 21)
	
	移动(30, 21)
	
	等待到指定地图("港湾管理处", 1)
	
	移动(17, 22)
	移动(17, 12)
::ToYouTing::
	
	转向(0, "")
	喊话("豪华客船...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	等待(15000)
	if(取当前地图名() == "休息室")then goto  XiuXiShi end
	goto ToYouTing 
::XiuXiShi::
	等待到指定地图("休息室", 1)
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	goto begin 
::ShiTang::
	等待到指定地图("食堂", 1)
	if(人物("坐标")  == "13,9")then	goto  chuShiTang end
	
	移动(9, 10)
	
	移动(12, 10)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	等待到指定地图("食堂", 1)
	
::chuShiTang::
	
	移动(13, 10)
	
	移动(6, 10)
		
	移动(6, 9)
	
	
	转向(6, "")
	等待服务器返回()
	对话选择("4", "", "")
	
::pingTai::
	
	等待到指定地图("平台", 1)
	
	
	移动(12, 19)
	
	移动(11, 19)
		
::keFangTongDao::
	
	等待到指定地图("客房通路", 1)
	
	移动(74, 24)
	
	移动(45, 24)
	
	移动(45, 22)
	
	
	转向(0, "")
	喊话("敲...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	
::keFang::
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 10)
	
	
	转向(0, "")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(10, 10)
	
	移动(10, 12)
	
	移动(11, 12)
	
	
	
	
	转向(2, "")	
	等待服务器返回()
	对话选择("4", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	等待到指定地图("微薄的意识\\z20", 1)
	
	
	转向(2, "")		
	等待服务器返回()
	对话选择("1", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(10, 9)
	
	移动(10, 10)
	
	移动(10, 12)
	
	
	转向(2, "")		
	喊话("拿...", "5", "5", "0")	
	等待服务器返回()
	对话选择("1", "", "")	
		
	if("物品", "汉克写的信", ">==", "1",chuHanKeHome)
		
	goto begin 
::chuHanKeHome::
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	if(取当前地图名() == "客房通路")then goto  ToWQSGongJueHome end
	goto chuHanKeHome 
::ToWQSGongJueHome::
	
	等待到指定地图("客房通路", 1)
	
	
	移动(45, 24)
	
	移动(50, 24)
	
	
	移动(50, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)
	
	
	移动(13, 9)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
::ToPingTai::	
	
	等待到指定地图("客房通路", 1)
	
	移动(50, 24)
	
	移动(75, 24)
	
	
	移动(73, 23)
	
	等待到指定地图("平台", 1)
	
	移动(11, 15)
	
	
	移动(5, 15)
	
	
	转向(6, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
::killScene::
	
	等待到指定地图("杀害现场", 1)
	
	移动(14, 11)
	
	
	转向(5, "")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(14, 8)
	
	移动(12, 8)
	
	
	转向(6, "")		
	喊话("拿...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")		
	
	移动(14, 8)
	
	移动(14, 11)
	
	
	转向(5, "")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	等待到指定地图("客房", 1)
	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房通路", 1)
	
	移动(50, 24)
	
	移动(77, 24)
	
	
	移动(77, 27)
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 26)
	
	
	移动(69, 26)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("福兰克林的房间", 1)
	
	
	移动(16, 11)
	
	移动(16, 10)
	
	移动(17, 10)
	
	移动(17, 8)
	
	
	转向(0, "")		
	喊话("拿...", "5", "5", "0")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	使用物品("白纸条")
	
	移动(16, 11)
	
	移动(17, 10)
	
	移动(16, 10)
	
	移动(16, 11)
	
	移动(4, 11)
	
	
	转向(6, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 22)
	
	
	移动(67, 21)
	
	等待到指定地图("客房通路", 1)
	
	
	移动(77, 24)
	
	移动(50, 24)
	
	
	移动(50, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)
	
	
	移动(13, 9)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(50, 24)
	
	
	移动(45, 24)
	
	
	转向(0, "")	
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	
	转向(1, "")	
	喊话("拿...", "5", "5", "0")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 14)
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房通路", 1)
	
	移动(45, 24)
	
::buZaiChangZhengM::
	
	移动(55, 24)
	
	移动(55, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	
	转向(1, "")	
	喊话("不在场证明...", "5", "5", "0")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 13)
	
	
	移动(10, 10)
	
	
	转向(0, "")	
	喊话("不在场证明...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(55, 24)
	
	移动(60, 24)
	
	移动(60, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房", 1)
	
	移动(10, 12)
	
	移动(10, 9)
	
	移动(11, 9)
	
	
	转向(2, "")	
	喊话("不在场证明...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 10)
	
	移动(10, 16)
	
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	
	移动(60, 24)
	
::EndTalk::
	
	移动(50, 24)
	
	移动(50, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)
	
	
	移动(13, 9)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("32", "", "")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(50, 24)
::SleepSelect::
	
	移动(70, 24)
	
	移动(70, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)	
	
	移动(13, 9)
	
	
	转向(1, "")	
	喊话("饮料的成分...", "5", "5", "0")	
	等待服务器返回()
	对话选择("32", "", "")		
	等待服务器返回()
	对话选择("1", "", "")	
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("32", "", "")		
	等待服务器返回()
	对话选择("32", "", "")		
	等待服务器返回()
	对话选择("1", "", "")		
	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(70, 24)
	移动(77, 24)
	
	
	移动(77, 27)
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 26)
	
	
	移动(69, 26)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("福兰克林的房间", 1)
	
	
	移动(7, 11)
	
	移动(9, 9)
	
	
	转向(1, "")		
	喊话("安眠药...", "5", "5", "0")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(7, 11)
	
	移动(4, 11)
	
	
	转向(6, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 22)
	
	
	移动(67, 21)
	
	等待到指定地图("客房通路", 1)
	
	
	移动(77, 24)
	
	移动(65, 24)
	
	
	移动(65, 22)
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房", 1)
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)
	
	
	移动(13, 9)
		
	
	转向(1, "")			
	喊话("凯莉修女...", "5", "5", "0")			
	等待服务器返回()
	对话选择("32", "", "")	
	等待服务器返回()
	对话选择("1", "", "")	
	喊话("凯莉修女...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(65, 24)
	移动(55, 24)
	移动(55, 22)
	
	
	转向(0, "")	
	喊话("听...", "5", "5", "0")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(55, 24)
	移动(50, 24)
	移动(50, 22)	
	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房", 1)
	
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)	
	
	移动(13, 9)
		
	
	转向(2, "")		
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	--去富兰克林
	
	等待到指定地图("客房通路", 1)	
	
	移动(50, 24)
	移动(77, 24)
	
	
	移动(77, 27)
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 26)
	
	
	移动(69, 26)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("福兰克林的房间", 1)
	
	
	移动(13, 11)	
	移动(13, 16)
	移动(16, 16)
	
	
	转向(2, "")		
	喊话("拿...", "5", "5", "0")			
	等待服务器返回()
	对话选择("1", "", "")	
	
	移动(8, 16)
	移动(8, 11)	
	移动(4, 11)
	
	
	转向(6, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 22)
	
	
	移动(67, 21)
	
	等待到指定地图("客房通路", 1)	--去葛登房间
	
	
	移动(77, 24)	
	移动(76, 25)		
	
	移动(76, 23)
	
	等待到指定地图("平台", 1)
	
	移动(11, 15)
	
	
	移动(5, 15)
	
	
	转向(6, "")			
	等待服务器返回()
	对话选择("4", "", "")		
	
	等待到指定地图("杀害现场", 1)
	
	移动(14, 11)	
	移动(14, 8)
	
	移动(10, 8)
	
	
	转向(7, "")			
	等待服务器返回()
	对话选择("1", "", "")	
	等待服务器返回()
	对话选择("1", "", "")			
	
	移动(14, 8)
	
	移动(14, 11)
	
	移动(15, 11)
	
	
	转向(2, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	移动(11, 15)	
	移动(11, 19)
	
	等待到指定地图("客房通路", 1)	
	
	移动(74, 24)	
	移动(54, 24)
	移动(50, 22)	
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
		
	等待到指定地图("客房", 1)	
	
	移动(11, 13)	
	移动(10, 12)	
	移动(10, 9)		
	移动(13, 9)
		
	
	转向(2, "")		
	等待服务器返回()
	对话选择("1", "", "")		
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	等待到指定地图("客房通路", 1)
	
	移动(50, 24)
	
	移动(70, 24)
	移动(70, 22)
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
		
	等待到指定地图("客房", 1)	
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)	
	
	移动(13, 9)
	
	
	转向(2, "")	
	喊话("凯莉修女...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")		
	
	
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(70, 24)
	移动(60, 24)
	移动(60, 22)
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
		
	等待到指定地图("客房", 1)	
	
	移动(11, 13)	
	移动(10, 12)
	移动(10, 9)
	移动(11, 9)
	
	转向(2, "")	
	喊话("凯莉修女...", "5", "5", "0")	
	等待服务器返回()
	对话选择("32", "", "")			
	等待服务器返回()
	对话选择("1", "", "")		
	
	移动(10, 10)
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
	
	移动(60, 24)
	移动(55, 24)
	移动(55, 22)
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
		
	等待到指定地图("客房", 1)	
	
	移动(11, 13)	
	
	转向(0, "")			
	喊话("诺那诺那...", "5", "5", "0")	
	等待服务器返回()
	对话选择("1", "", "")	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
	
	等待到指定地图("客房通路", 1)	
		
	移动(55, 24)
	移动(50, 24)
	移动(50, 22)
	
	转向(0, "")			
	等待服务器返回()
	对话选择("4", "", "")	
		
	等待到指定地图("客房", 1)	
	
	移动(11, 13)
	
	移动(10, 12)
	
	移动(10, 9)	
	
	移动(13, 9)
	
	
	转向(2, "")		
	等待服务器返回()
	对话选择("1", "", "")		
	移动(10, 9)
	
	
	移动(10, 12)
	
	
	移动(10, 16)
	
	
	转向(4, "")			
	等待服务器返回()
	对话选择("4", "", "")	
	
::jiuHanKe::
	等待到指定地图("客房通路", 1)	
	
	移动(50, 24)
	移动(77, 24)
	
	
	移动(77, 27)
	
	等待到指定地图("船的最下层", 1)
	
	移动(67, 26)	
	移动(54, 26)
	移动(54, 31)
	
	
	转向(4, "")		
	喊话("敲...", "5", "5", "0")		
	等待服务器返回()
	对话选择("1", "", "")	
	
::jiuZhi::
	等待到指定地图("客房", 1)	
	
	喊话("自行选择对话内容，凯莉修女-因为诺那诺那会说话，她利用了这点-其实，是要报小时候的仇", "5", "5", "0")		
	