★定居艾尔莎岛，。
common=require("common")

common.supplyCastle()
common.sellCastle()		--默认卖
common.checkHealth(医生名称)

::start::
	设置("遇敌全跑",1)
	回城()	
	等待到指定地图("艾尔莎岛")        
	转向(1)
	等待服务器返回()
	对话选择(4,0)
	等待(2000)		
	等待空闲()
	if (取当前地图名()=="艾尔莎岛" )then	
		goto start
	end	
	等待(1000)		
	自动寻路(34,89)
	回复(1)			-- 转向北边恢复人宠血魔
    自动寻路(41, 80)
    --    if(取物品数量( "咒术师推荐信") >  0)then goto  jidi end      
::jidi::
	自动寻路(41, 50)
	等待到指定地图("里谢里雅堡 1楼", 1)	
	自动寻路(45, 20)
	等待到指定地图("启程之间", 1)
	自动寻路(15, 4)	
	转向(2, "")
	等待服务器返回()
	对话选择("4", 0)
	等待到指定地图("杰诺瓦镇的传送点")
	自动寻路(14, 6,"村长的家")
	自动寻路(1, 9,"杰诺瓦镇")
	自动寻路(24, 40,"莎莲娜")
	自动寻路(196, 443,"莎莲娜海底洞窟 地下1楼")	
	自动寻路(14, 41,"莎莲娜海底洞窟 地下2楼")
	自动寻路(32, 21)
	转向(5, "")
	等待服务器返回()	
	喊话("咒术",0,0,0)	
	等待服务器返回()
	对话选择("1", "", "")
	等待到指定地图("莎莲娜海底洞窟 地下2楼",31,22)	
	自动寻路(38, 37,"咒术师的秘密住处")
	自动寻路(10, 0,15008)
	自动寻路(10, 0)
	对话选是(2)
	等待到指定地图("15012")	
	自动寻路(10, 10)	
	设置("遇敌全跑",0)