--定居艾尔莎岛
common=require("common")

common.supplyCastle()
common.sellCastle()		--默认卖
common.checkHealth(医生名称)

	if(取物品数量("驯兽师推荐信") < 1 )then
		扔("僧侣适性检查合格证")
		扔("咒术师推荐信")
		执行脚本("脚本//就职//★24坑道拿推荐信.lua")
		自动寻路(23,12)
		转向(2)
		喊话("驯兽师",2,3,5)	
		等待服务器返回()
		对话选择(1,0)
	end	
::begin::
	if(取当前地图名() == "职业公会")then
		goto gonghui
	end 
	回城()
	等待(1000)
	
	等待到指定地图("艾尔莎岛")
	对话选是(1)	
	等待到指定地图("里谢里雅堡")
	自动寻路(41,14)
	等待到指定地图("法兰城")
	自动寻路(73,60)
::gonghui::
	等待到指定地图("职业公会")	
	自动寻路(13,10)	

	if(取物品数量("转职保证书") < 1)then
		日志("没有转职保证书，转职失败，返回！")
		return
	end
	转向(0)
	等待服务器返回()
	对话选择(0,1)
	等待服务器返回()
	对话选择(32,-1)
	等待服务器返回()
	对话选择(0,0)
	等待(2000)


