设置脚本简介("起点支持新城登陆点和城堡打卡处,请自己设置战斗")

function 去营地()
::dengru::
	local 当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto star1
	elseif (当前地图名=="里谢里雅堡" )then	
		goto star2
	elseif (当前地图名=="法兰城" )then	
		goto begin
	end	
::star1::
	移动(140,105)
	等待(500)
	面向("东北")
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")	
	移动(41,82)
    goto star2
::star2::		
	移动(41,98)	
    goto begin
::begin::		
	等待到指定地图("法兰城")	
	移动(153,239)
	移动(153,241)	
	等待到指定地图("芙蕾雅")	
	移动(424,264)	
	移动(468,264)	
	移动(468,266)	
	移动(498,266)	
	移动(503,274)	
	移动(506,280)	
	移动(511,282)	
	移动(513,282)	
	等待(1000)	
	等待到指定地图("曙光骑士团营地")	
	移动(30,59)
	移动(30,51)
	移动(55,51)
	移动(55,48)
	移动(55,47)	
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",1,10)
	移动(6,10)
	移动(6,4)
	移动(7,4)	
	等待到指定地图("辛希亚探索指挥部",91,6)
	移动(91,9)
	移动(94,9)
	移动(95,9)
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",19,28)	
	移动(19,30)
	移动(14,30)
	移动(14,24)
	移动(7,24)
	移动(6,22)
	移动(8,22)	
	移动(6,22)
	移动(7,22)  	
	面向("北")		-- 转向北		
	等待(2000)
	等待到指定地图("圣骑士营地")
	移动(116,69,"总部1楼")
	移动(41,72)  
	转向(0)
	等待服务器返回()
	对话选择(-1,0)
	等待服务器返回()
	对话选择(0,0)
	等待服务器返回()
	对话选择(1,0)
end
去营地()