★起点艾尔莎岛登入点，根据提示执行脚本。


	设置("高速延时",0)  
	设置("高速战斗",1)  
	设置("自动战斗",1)  
	设置("遇敌速度",20)  

	补血值=用户输入框("多少血以下去补给","400")
	补魔值=用户输入框("多少魔以下去补给","400")
	-- 宠补血值=用户输入框("宠多少血以下补血","100")
	-- 宠补魔值=用户输入框("宠多少魔以下去补给","400")
	
::begin::
	等待空闲()
	if(取当前地图名() ==  "艾尔莎岛")then goto  aiersa end
	if(取当前地图名() ==  "里谢里雅堡")then goto liBao end
	if(取当前地图名() ==  "杰诺瓦镇")then goto quYiYuan end
	if(取当前地图名() ==  "杰诺瓦镇的传送点")then goto jnwcf end	
	if(取当前地图名() ==  "医院")then goto yiYuan end
	if(取当前地图名() ==  "莎莲娜")then goto shaLianLa end
	等待(2000)
	goto begin 
::aiersa::	
	等待到指定地图("艾尔莎岛")       
	移动(140,105)
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待(2000)
	goto begin
::liBao::
	移动(34,89)
	回复(1)			-- 转向北边恢复人宠血魔
	移动(41, 50,"里谢里雅堡 1楼")
	移动(45, 20,"启程之间")
	移动(15, 4)	
	转向(2, "")
	等待服务器返回()
	对话选择("4", 0)
	goto jnwcf 

::jnwcf::
	等待到指定地图("杰诺瓦镇的传送点")	
	移动(14, 8)
	移动(14, 6,"村长的家")	
	移动(1, 9,"杰诺瓦镇")	
::quYiYuan::
	移动(44, 33,"医院")	
::yiYuan::
	移动(10,5)
	回复(2)
	移动(1, 9,"杰诺瓦镇")
	移动(44, 39)
	移动(24, 39,"莎莲娜")	
::shaLianLa::	
	移动(215,455)	
	开始遇敌()
::yudi::
	if(人物("血") < 补血值)then goto ting end
	if(人物("魔") < 补魔值)then goto ting end
	-- if(宠物("血") < 宠补血值)then goto ting end
	-- if(宠物("魔") < 宠补魔值)then goto ting end
	等待(2000)
	goto yudi 
::ting::
	停止遇敌()
	等待空闲()
	移动(217,456,"杰诺瓦镇")
	goto quYiYuan
	