★起点圣骑士营地医院或营地西门外，坐标不变60秒重启。

common=require("common")


补魔值=用户输入框( "多少魔以下去补给", "400")
补血值=用户输入框( "多少血以下去补给", "400")
宠补魔值=用户输入框( "宠多少魔以下去补给", "200")
宠补血值=用户输入框( "宠多少血以下去补给", "200")
卖店物品列表="魔石|卡片？|锹型虫的卡片|水晶怪的卡片|哥布林的卡片|红帽哥布林的卡片|迷你蝙蝠的卡片|绿色口臭鬼的卡片|锥形水晶"	

清除系统消息()

::begin::  
	if(取当前地图名() == "医院")then goto StartBegin end
	if(取当前地图名() ==  "圣骑士营地")then goto lu1a end    
	common.去营地()
	goto begin 
::StartBegin::
	喊话("脚本启动等待",06,0,0)
	等待(1000)
	喊话("美特斯邦威  飞一般滴感觉",06,0,0)
	自动寻路(11,20)
	自动寻路( 0, 20)
	goto lu1 
::lu1::
	等待到指定地图("圣骑士营地",95,72)
::lu1a::		
	自动寻路(37,87)
	自动寻路(36, 87)      
	goto lu4 

::lu4::
	等待到指定地图("肯吉罗岛")	
	自动寻路(543, 332)
	开始遇敌()         
        
::scriptstart::
	if(人物("血") < 补血值)then goto  ting end
	if(人物("魔") < 补魔值)then goto  ting end
	if(宠物("血") < 宠补血值)then goto  ting end
	if(宠物("魔") < 宠补魔值)then goto  ting end
	等待(2000)
	goto scriptstart  
	
::ting::
	停止遇敌()
	自动寻路(550, 332)    
	自动寻路(551, 332)       
	等待到指定地图("圣骑士营地")
	自动寻路(94,73)
	自动寻路(95, 72)       
	goto lu6 

::lu6::
	等待到指定地图("医院", 0, 20)
	自动寻路(19,15)
	自动寻路(18,15)
	goto xue 

::xue::
	回复(0)			-- 转向北边恢复人宠血魔	
	goto StartBegin 
