~睾~竹中重治专用偷竞技场牛鬼斧头脚本-----------------------------------设置当人魔少于x逃跑--x为自己魔上限减1就行了--通宵挂机必备脚本--感觉脚本速度慢了可以打开脚本把设置("timer", 320)这2句话中320改小点--


设置("timer", 320)

设置("自动战斗", 1)
设置("高速战斗", 4)
设置("高速延时", 6)

自己血=用户输入框("输入自己滴血上限有多少","100")
自己魔=用户输入框("输入自己滴魔上限有多少","100")
::huicheng::
        等待(2000)
	回城()
        
if(取当前地图名() ==  "艾尔莎岛")then goto  aidao end

::aidao::
        
        转向(1, "")
        等待服务器返回()
        对话选择("4", "", "")
        等待到指定地图("里谢里雅堡", 27, 82)
        if(人物("魔") < 自己魔)then goto buxue end
        if(人物("血") == 自己血)then goto jixu end
        if(人物("血") < 自己血)then goto buxue end
        
::jixu::
        移动(41, 82)
        移动(41, 97)
        移动( 41, 98)
        等待到指定地图("法兰城", 1)
        移动(153, 153)
        移动(136, 153)
        移动(134, 160)
        移动(126, 160)
        移动(126, 161)
        移动(124, 161)
        --
        转向(6, "")
        --等待服务器返回()
        --对话选择("", "", "")
        等待到指定地图("竞技场的入口", 1)
        移动(15, 15)
        移动(26, 15)
        移动( 27, 15)
        
        
        等待到指定地图("治愈的广场", 1)
        移动(11, 32)
        移动(11, 20)
        移动(26, 20)
        移动(26, 14)
        
        转向(0, "")
        等待服务器返回()
        对话选择("32", "", "")
        对话选择("4", "", "")
        对话选择("1", "", "")
        
        
        等待到指定地图("竞技场", 15, 9)
        移动(15, 14)
        移动(22, 14)
        移动(22, 13)
        等待(2000)
        移动(22, 14)
        移动(15, 14)
        移动(15, 9)
        移动(15, 8)
        等待(2000)
        移动(15, 15)
        移动(22, 15)
        移动(22, 9)
        移动(22, 8)
        等待(2000)
        移动(22, 15)
        移动(15, 15)
        移动(15, 9)
        移动(15, 8) 
        等待(2000)   
        移动(15, 16)    
        移动(21, 16)
        移动(22, 16)
        等待(2000)
        移动(16, 17)
        移动(16, 12)
        
        转向(0, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待到指定地图("休息室", 1)
        移动(14, 10)
        移动(22, 10)
        移动(22, 4)
        移动(15, 4)
        移动(15, 5)
        
        转向(4, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("1", "", "")
        对话选择("1", "", "")
        等待(1000)
        移动(16, 5)
        
        转向(2, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待到指定地图("竞技预赛会场", 1)
        移动(30, 21)
        
        转向(2, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待(2000)
        goto pandan 
::buxue::
        移动(31, 82)
        移动(31, 90)
        移动(34, 90)
        移动(34, 88)
        回复(3)
        
        移动(34, 90)
        移动(31, 90)
        移动(31, 82)
        移动(41, 82)
        移动(41, 97)
        移动( 41, 98)
        等待到指定地图("法兰城", 1)
        移动(153, 153)
        移动(136, 153)
        移动(134, 160)
        移动(126, 160)
        移动(126, 161)
        移动(124, 161)
        --
        转向(6, "")
        --等待服务器返回()
        --对话选择("", "", "")
        等待到指定地图("竞技场的入口", 1)
        移动(15, 15)
        移动(26, 15)
        移动( 27, 15)
        
        
        等待到指定地图("治愈的广场", 1)
        移动(11, 32)
        移动(11, 20)
        移动(26, 20)
        移动(26, 14)
        
        转向(0, "")
        等待服务器返回()
        对话选择("32", "", "")
        对话选择("4", "", "")
        对话选择("1", "", "")
        
        
        等待到指定地图("竞技场", 15, 9)
        移动(15, 14)
        移动(22, 14)
        移动(22, 13)
        
        移动(22, 14)
        移动(15, 14)
        移动(15, 9)
        移动(15, 8)
      
        移动(15, 15)
        移动(22, 15)
        移动(22, 9)
        移动(22, 8)
       
        移动(22, 15)
        移动(15, 15)
        移动(15, 9)
        移动(15, 8) 
       
        移动(15, 16)    
        移动(21, 16)
        移动(22, 16)
       
        移动(16, 17)
        移动(16, 12)
        
        转向(0, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待到指定地图("休息室", 1)
        移动(14, 10)
        移动(22, 10)
        移动(22, 4)
        移动(15, 4)
        移动(15, 5)
        
        转向(4, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("32", "", "")
        对话选择("1", "", "")
        对话选择("1", "", "")        
        移动(16, 5)
        
        转向(2, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待到指定地图("竞技预赛会场", 1)
        移动(30, 21)
        
        转向(2, "")
        等待服务器返回()
        对话选择("4", "", "")
        对话选择("1", "", "")
        等待(2000)
        goto pandan 
::hp::
        if(人物("魔") < 自己魔)then goto huicheng end 
        if(人物("血") < 自己血)then goto huicheng end
        等待(2000)
        goto huicheng    
::pandan::
         if(是否战斗中()  ==  false)then goto  hp end
         goto pandan 
         
        
        