刷忍者道具版....请注意,要将伊尔,圣村,维村传送开好,且将任务领好(就是对话到"要不要赌上你爷爷的名誉"即可",具体看网站),然后就可以执行此脚本...   ---------------by princecola
补血值=用户输入框( "多少血以下要在维村补血", "400")
补魔值=用户输入框( "多少血以下要在维村补魔", "250")
::StartBegin::
回城()
	if(人物("坐标")  == "233,78")then	goto  dy1 end
	if(人物("坐标")  == "162,130")then	goto  dy2 end
	if(人物("坐标")  == "72,123")then	goto  dy3 end
	if(人物("坐标")  == "242,100")then	goto  yh1 end
	if(人物("坐标")  == "141,148")then	goto  yh2 end
	if(人物("坐标")  == "63,79")then	goto  yh3 end
	goto StartBegin 

::dy1::
	
	等待到指定地图("法兰城", 1)
	
        移动(242, 78)
        移动(242, 87)
        移动(242, 100)
        
        goto yh1 
  

::dy2::
	
	等待到指定地图("法兰城", 1)
	
	转向(2, "")
	

::dy3::
	
	等待到指定地图("法兰城", 1)
	
	转向(2, "")
        goto dy1 

::yh1::
	
	等待到指定地图("法兰城", 1)
	
        转向(2, "")
        
        转向(0, "")
        
        转向(0, "")
        
        goto begin 

::yh2::
	
	等待到指定地图("法兰城", 1)
	
	转向(0, "")
	

::yh3::
	
	等待到指定地图("法兰城", 1)
	
	goto begin 

::begin::
        
        等待到指定地图("法兰城", 63, 79)
        
        if(取物品数量("亚尔科尔的纸条") == 1)then goto  begin1 end
        if(取物品数量("陶欧食品店精制面包") == 1)then goto  begin2 end
        if(取物品数量("亚尔科尔的点心") == 1)then goto  begin2 end
        
        移动(63,89)
        移动(90,89)
        移动(90,135)
        移动(102,135)
        移动(102,132)
        movego(1001,1)
        
        等待到指定地图("安其摩酒吧",1)
        
        移动(16,16)
        移动(20,16)
        移动(20,9)
        
        
        转向(2, "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        
        转向(2, "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        移动(20,19)
        移动(16,19)
        移动(16,22)
        movego(1005,1)
        
        等待到指定地图("法兰城",1)
        
        移动(102,136)
        移动(139,136)
        移动(139,148)
        移动(141,148)
        
        转向(0,"")
        
        转向(0,"")
                
        等待到指定地图("法兰城",242,100)
        
        移动(241,100)
        移动(225,116)
        移动(214,116)
        移动(214,136)
        移动(218,136)
        movego(1003,1)
        
	等待到指定地图("科特利亚酒吧",1)
	
        移动(17,16)
        移动(17,17)
        
        
        chat("亚尔科尔...", "5", "5", "0")
        等待服务器返回()
        
        移动(17,16)
        移动(11,16)
        movego(1007,1)
        
        等待到指定地图("法兰城",1)
        
        移动(210,136)
        移动(210,40)
        移动(195,40)
        移动(195,33)
        movego(1003.1)
        
        等待到指定地图("别室",1)
        
        移动(7,9)
        移动(7,5)
        移动(8,5)
        
        
        chat("毒...", "5", "5", "0")
        等待服务器返回()
        
        移动(3,10)
        movego(1008,1)
        
        等待到指定地图("法兰城",1)
        
        移动(196,36)
        移动(181,51)
        移动(181,88)
        移动(166,88)
        movego(1007,1)
        
        等待到指定地图("里谢里雅堡",1)
        
        移动(41,53)
        移动(41,51)
        movego(1001,1)
        
        
        移动(74,20)
        movego(1001,1)
        
        
        移动(49,75)
        移动(1,75)
        movego(1007,1)
        
        
        移动(26,16)
        移动(18,16)
        移动(18,28)
        
        
        chat("毒...","5","5","0")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        移动(18,16)
        移动(26,16)
        移动(28,18)
        movego(1003,1)
        
        等待到指定地图("里谢里雅堡 2楼",1)
        
        movego(1003,1)
        移动(49,74)
        移动(49,79)
        movego(1005,1)
        
        等待到指定地图("里谢里雅堡 1楼",1)
        
        移动(69,24)
        移动(45,24)
        移动(45,21)
        movego(1001,1)
        
        等待到指定地图("启程之间",1)
        
        移动(25,27)
        移动(34,36)
        移动(34,44)
        移动(43,44)
        
        
        转向(1, "")
        等待服务器返回()
        对话选择("4", "", "")
        
        等待到指定地图("圣拉鲁卡村的传送点", 1)
        
        移动(7,4)
        movego(1001,1)
        
        等待到指定地图("村长的家", 1)
        
        移动(3,10)
        movego(1008,1)
        
        等待到指定地图("圣拉鲁卡村",1)
        
        移动(49,57)
        移动(34,57)
        移动(34,50)
        移动(36,50)
        movego(1003,1)
   
   等待到指定地图("医院",1)
   
   移动(9,9)
   移动(9,13)
   移动(10,13)
   
   
   转向(2, "")
   等待服务器返回()
   对话选择("1", "", "")
   
   
   转向(2, "")
   等待服务器返回()
   对话选择("1", "", "")
   
移动(9, 13)
移动(9, 9)
移动(2, 9)
movego(1007,1)

等待到指定地图("圣拉鲁卡村", 1)

移动(34, 50)
移动(34, 57)
移动(49, 57)
移动(49, 80)
movego(1005,1)

等待到指定地图("村长的家", 1)

移动(8, 9)
movego(1005,1)

等待到指定地图("圣拉鲁卡村的传送点", 1)

移动(7, 4)
移动(14, 4)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("启程之间", 1)

移动(42, 44)
移动(34, 44)
移动(34, 33)
移动(43, 33)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("伊尔村的传送点", 1)

移动(20, 19)
移动(12, 19)
移动(12, 18)
movego(1001,1)

等待到指定地图("村长的家", 1)

移动(15, 17)
移动(15, 13)
移动(7, 13)
movego(1007,1)

等待到指定地图("伊尔村", 1)

移动(39, 83)
移动(39, 71)
移动(31, 71)
移动(31, 65)
movego(1003,1)

等待到指定地图("旧金山酒吧", 1)

移动(16, 19)
移动(16, 3)
移动(21, 3)


chat("心美...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

goto StartBegin 

::begin1::

移动(63, 106)
移动(72, 106)
移动(72, 105)
movego(1001,1)

等待到指定地图("陶欧食品店", 1)

移动(15, 11)
移动(12, 11)


转向(0, "")
等待服务器返回()
对话选择("1", "", "")


转向(0, "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

移动(15, 11)
移动(15, 23)
movego(1005,1)

等待到指定地图("法兰城", 1)

移动(72, 106)
移动(63, 106)
移动(63, 79)

转向(0, "")
等待到指定地图("法兰城",242,100)

移动(242, 88)
移动(280, 88)
movego(1003,1)

等待到指定地图("芙蕾雅", 1)

移动(480, 196)
移动(488, 204)
移动(493, 204)
移动(504, 215)
移动(500, 219)
移动(518, 237)
移动(518,240)
移动(521,243)
移动(529,243)
移动(529,250)
移动(530,250)


chat("亚尔科尔...", "5", "5", "0")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

goto StartBegin 

::begin2::

移动(63, 88)
移动(140, 88)
movego(1003,1)

等待到指定地图("里谢里雅堡", 1)

移动(41, 53)
移动(41,51)

移动(41,50)


等待到指定地图("里谢里雅堡 1楼", 1)

移动(74, 24)
移动(45, 24)
移动(45, 21)
movego(1001,1)

等待到指定地图("启程之间", 1)

移动(25, 27)

if(取物品数量("亚尔科尔的点心") == 1)then goto  begin3 end

移动(31, 33)
移动(43, 33)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("伊尔村的传送点", 1)

移动(20, 19)
移动(12, 19)
移动(12, 18)
movego(1001,1)

等待到指定地图("村长的家", 1)

移动(15, 17)
移动(15, 13)
移动(7, 13)
movego(1007,1)

等待到指定地图("伊尔村", 1)

移动(39, 83)
移动(39, 71)
移动(31, 71)
移动(31, 65)
movego(1003,1)

等待到指定地图("旧金山酒吧", 1)

移动(16, 19)
移动(16, 3)
移动(21, 3)


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("1", "", "")
等待服务器返回()
对话选择("1", "", "")
goto StartBegin 

::begin3::

移动(19, 27)
移动(19, 23)
移动(9, 23)


转向(7, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("维诺亚村的传送点", 1)

移动(5, 2)
movego(1001,1)

等待到指定地图("村长家的小房间", 1)

移动(8, 5)
移动(1, 5)
movego(1007,1)

等待到指定地图("村长的家", 1)

移动(9, 10)
移动(9, 15)
movego(1005,1)

等待到指定地图("维诺亚村", 1)

移动(41, 37)
移动(41, 46)
移动(46, 46)
移动(46, 64)
移动(49, 64)

chat("心美...", "5", "5", "0")
等待服务器返回()
对话选择("1", "", "")
移动(46, 64)
移动(46, 46)
移动(37, 46)
移动(37, 51)
movego(1005,1)

等待到指定地图("民家", 1)

移动(12, 9)
移动(12, 5)
移动(13, 5)


chat("心美...", "5", "5", "0")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("地下", 1)

移动(4, 10)
移动(8, 10)


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")

移动(4,10)
movego(1001,1)

等待到指定地图("民家",1)

移动(12, 5)
移动(12, 9)
移动(4, 9)
movego(1007,1)

等待到指定地图("维诺亚村", 1)

移动(37, 46)
移动(59, 46)
if(人物("血") < 补血值)then goto  buxue end
if(人物("魔") < 补魔值)then goto  buxue end
goto jixu 

::jixu::
移动(66, 46)
movego(1003,1)

等待到指定地图("芙蕾雅", 1)

移动(340, 471)
移动(340, 444)
移动(347, 437)
移动(347, 427)
移动(348, 427)
移动(348, 402)
移动(345, 399)
移动(345, 395)
移动(347, 393)
移动(347, 387)
移动(349, 385)
移动(349, 384)
移动(350, 384)
移动(350, 383)
移动(352, 383)
移动(352, 382)


chat("乌克兰...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("芙蕾雅", 1)

移动(347, 378)
移动(346, 378)
移动(346, 373)
移动(355, 373)
移动(355, 368)
移动( 354 ,367)

等待到指定地图("小路", 1)

移动(61, 115)
移动(64, 112)
移动(64, 96)
移动(57, 96)
移动(57, 95)
移动(56, 95)
移动(56, 94)
移动(54, 94)
移动(54, 93)
移动(52, 93)
移动(52, 91)
移动(51, 91)
移动(51, 90)
移动(50, 90)
移动(50, 81)
移动(49, 81)
移动(49, 80)
移动(48, 80)
移动(48, 72)
移动(47, 71)
移动(47, 69)
移动(46, 68)
移动(43, 68)
移动(43, 67)
移动(42, 67)
移动(42, 66)
移动(41, 66)
移动(41, 65)
移动(40, 65)
移动(40, 64)
移动(39, 64)
移动(39, 63)
移动(38, 63)
移动(38, 62)
移动(36, 62)
移动(35, 61)
移动(33, 61)
移动(33, 60)
移动(30, 60)
移动(30, 53)
移动(22, 53)
移动(22, 51)
移动(21, 51)
移动(21, 49)
移动(21, 45)
移动(22, 45)
移动(22, 42)
移动(23, 42)
移动(23, 31)
移动(23, 23)
移动(24, 23)
移动(24, 19)
移动(25, 19)
移动(25, 15)
移动(27, 15)
移动(27, 14)
移动(28, 14)
移动(28, 13)
移动(29, 13)
移动(29, 12)
移动(30, 12)
移动(30, 11)
移动(31, 11)
移动(31, 10)
移动(43, 10)
移动(43, 11)
移动(45, 11)
移动(45, 23)
movego(1003,1)

等待到指定地图("忍者的隐居地", 1)

移动(14, 37)
移动(31, 37)
移动(31, 28)
移动(26, 28)
移动(26, 23)
移动(22, 23)
移动(22, 13)
移动(19, 13)
移动(19, 10)
movego(1001,1)

等待到指定地图("忍者之家", 1)

移动(17, 39)
移动(21, 39)
移动(21, 34)
移动(26, 34)
移动(26, 14)
移动(16, 14)
移动(16, 21)
移动(13, 21)
移动(13, 20)


转向(0, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("忍者之家2楼", 1)

移动(13, 29)
移动(24, 29)
移动(24, 12)
移动(38, 12)
移动(38, 19)
movego(1007,1)

等待到指定地图("忍者之家", 1)

移动(35, 21)
移动(45, 31)
移动(45, 39)
移动(63, 39)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("井", 1)

移动(16, 12)
移动(16, 9)
移动(15, 9)
移动(13, 7)
移动(11, 7)
移动(8, 4)
movego(1007,1)

等待到指定地图("通路", 1)

移动(45, 44)
移动(37, 44)
移动(34, 41)
移动(29, 41)
移动(27, 39)
移动(27, 30)
移动(22, 30)
移动(22, 27)
movego(1001,1)

等待到指定地图("通路", 1)

移动(22, 16)
移动(21, 16)
移动(21, 15)
移动(19, 15)
移动(19, 14)
移动(17, 14)
移动(17, 13)
移动(16, 12)
移动(13, 12)
移动(13, 11)
移动(12, 11)
移动(12, 10)
移动(7, 10)
移动(5, 12)
移动(5, 14)
movego(1005,1)

等待到指定地图("乌克兰", 1)

移动(89, 84)
移动(89, 75)
移动(82, 75)
移动(80, 73)
移动(70, 73)
移动(61, 82)
移动(56, 82)
移动(52, 86)
移动(45, 86)
移动(44, 85)
移动(41, 85)
移动(41, 81)
移动(43, 79)
移动(43, 74)
移动(45, 72)
移动(45, 62)
移动(49, 58)
移动(54, 58)
移动(57, 61)
移动(62, 61)
移动(62, 62)
移动(75, 62)
移动(75, 59)
移动(79, 55)
移动(79, 49)
移动(78, 49)
移动(78, 47)
movego(1007,1)

等待到指定地图("民家", 1)

移动(9, 10)
移动(9, 7)


chat("毒...", "5", "5", "0")
等待服务器返回()

移动(5, 11)
移动(2, 11)
movego(1007,1)

等待到指定地图("乌克兰", 1)

移动(76, 47)
移动(76, 43)
移动(73, 43)
移动(73, 37)
移动(67, 37)
移动(67, 28)
移动(68, 28)
movego(1003,1)

等待到指定地图("村长的家", 1)

移动(5, 22)
移动(9, 18)
移动(9, 15)
移动(10, 15)
移动(10, 14)
移动(15, 9)
movego(1003,1)

等待到指定地图("族长的家地下室", 1)

移动(7, 11)
移动(10, 11)

chat("毒...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")
printf(钱)
goto StartBegin 

::buxue::
移动(59, 53)
移动(60, 53)
movego(1003,1)

等待到指定地图("医院",1)

移动(15, 9)
回复(0)


移动(3, 9)
movego(1007,1)

等待到指定地图("维诺亚村", 1)

移动(59, 53)
移动(59, 46)
goto jixu 