刷忍者道具版....请注意,要将伊尔,圣村,维村传送开好,且将任务领好(就是对话到"要不要赌上你爷爷的名誉"即可",具体看网站),然后就可以执行此脚本...   ---------------by princecola
补血值=用户输入框( "多少血以下要在维村补血", "400")
补魔值=用户输入框( "多少血以下要在维村补魔", "250")
::StartBegin::
回城()
	if(人物("坐标")  == "233,78")then	goto  dy1 end
	if(人物("坐标")  == "162,130")then	goto  dy2 end
	if(人物("坐标")  == "72,123")then	goto  dy3 end
	if(人物("坐标")  == "242,100")then	goto  yh1 end
	if(人物("坐标")  == "141,148")then	goto  yh2 end
	if(人物("坐标")  == "63,79")then	goto  yh3 end
	goto StartBegin 

::dy1::
	
	等待到指定地图("法兰城", 1)
	
        自动寻路(242, 78)
        自动寻路(242, 87)
        自动寻路(242, 100)
        
        goto yh1 
  

::dy2::
	
	等待到指定地图("法兰城", 1)
	
	转向(2, "")
	

::dy3::
	
	等待到指定地图("法兰城", 1)
	
	转向(2, "")
        goto dy1 

::yh1::
	
	等待到指定地图("法兰城", 1)
	
        转向(2, "")
        
        转向(0, "")
        
        转向(0, "")
        
        goto begin 

::yh2::
	
	等待到指定地图("法兰城", 1)
	
	转向(0, "")
	

::yh3::
	
	等待到指定地图("法兰城", 1)
	
	goto begin 

::begin::
        
        等待到指定地图("法兰城", 63, 79)
        
        if(取物品数量("亚尔科尔的纸条") == 1)then goto  begin1 end
        if(取物品数量("陶欧食品店精制面包") == 1)then goto  begin2 end
        if(取物品数量("亚尔科尔的点心") == 1)then goto  begin2 end
        
        自动寻路(63,89)
        自动寻路(90,89)
        自动寻路(90,135)
        自动寻路(102,135)
        自动寻路(102,132)
        movego(1001,1)
        
        等待到指定地图("安其摩酒吧",1)
        
        自动寻路(16,16)
        自动寻路(20,16)
        自动寻路(20,9)
        
        
        转向(2, "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        
        转向(2, "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        自动寻路(20,19)
        自动寻路(16,19)
        自动寻路(16,22)
        movego(1005,1)
        
        等待到指定地图("法兰城",1)
        
        自动寻路(102,136)
        自动寻路(139,136)
        自动寻路(139,148)
        自动寻路(141,148)
        
        转向(0,"")
        
        转向(0,"")
                
        等待到指定地图("法兰城",242,100)
        
        自动寻路(241,100)
        自动寻路(225,116)
        自动寻路(214,116)
        自动寻路(214,136)
        自动寻路(218,136)
        movego(1003,1)
        
	等待到指定地图("科特利亚酒吧",1)
	
        自动寻路(17,16)
        自动寻路(17,17)
        
        
        chat("亚尔科尔...", "5", "5", "0")
        等待服务器返回()
        
        自动寻路(17,16)
        自动寻路(11,16)
        movego(1007,1)
        
        等待到指定地图("法兰城",1)
        
        自动寻路(210,136)
        自动寻路(210,40)
        自动寻路(195,40)
        自动寻路(195,33)
        movego(1003.1)
        
        等待到指定地图("别室",1)
        
        自动寻路(7,9)
        自动寻路(7,5)
        自动寻路(8,5)
        
        
        chat("毒...", "5", "5", "0")
        等待服务器返回()
        
        自动寻路(3,10)
        movego(1008,1)
        
        等待到指定地图("法兰城",1)
        
        自动寻路(196,36)
        自动寻路(181,51)
        自动寻路(181,88)
        自动寻路(166,88)
        movego(1007,1)
        
        等待到指定地图("里谢里雅堡",1)
        
        自动寻路(41,53)
        自动寻路(41,51)
        movego(1001,1)
        
        
        自动寻路(74,20)
        movego(1001,1)
        
        
        自动寻路(49,75)
        自动寻路(1,75)
        movego(1007,1)
        
        
        自动寻路(26,16)
        自动寻路(18,16)
        自动寻路(18,28)
        
        
        chat("毒...","5","5","0")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        
        自动寻路(18,16)
        自动寻路(26,16)
        自动寻路(28,18)
        movego(1003,1)
        
        等待到指定地图("里谢里雅堡 2楼",1)
        
        movego(1003,1)
        自动寻路(49,74)
        自动寻路(49,79)
        movego(1005,1)
        
        等待到指定地图("里谢里雅堡 1楼",1)
        
        自动寻路(69,24)
        自动寻路(45,24)
        自动寻路(45,21)
        movego(1001,1)
        
        等待到指定地图("启程之间",1)
        
        自动寻路(25,27)
        自动寻路(34,36)
        自动寻路(34,44)
        自动寻路(43,44)
        
        
        转向(1, "")
        等待服务器返回()
        对话选择("4", "", "")
        
        等待到指定地图("圣拉鲁卡村的传送点", 1)
        
        自动寻路(7,4)
        movego(1001,1)
        
        等待到指定地图("村长的家", 1)
        
        自动寻路(3,10)
        movego(1008,1)
        
        等待到指定地图("圣拉鲁卡村",1)
        
        自动寻路(49,57)
        自动寻路(34,57)
        自动寻路(34,50)
        自动寻路(36,50)
        movego(1003,1)
   
   等待到指定地图("医院",1)
   
   自动寻路(9,9)
   自动寻路(9,13)
   自动寻路(10,13)
   
   
   转向(2, "")
   等待服务器返回()
   对话选择("1", "", "")
   
   
   转向(2, "")
   等待服务器返回()
   对话选择("1", "", "")
   
自动寻路(9, 13)
自动寻路(9, 9)
自动寻路(2, 9)
movego(1007,1)

等待到指定地图("圣拉鲁卡村", 1)

自动寻路(34, 50)
自动寻路(34, 57)
自动寻路(49, 57)
自动寻路(49, 80)
movego(1005,1)

等待到指定地图("村长的家", 1)

自动寻路(8, 9)
movego(1005,1)

等待到指定地图("圣拉鲁卡村的传送点", 1)

自动寻路(7, 4)
自动寻路(14, 4)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("启程之间", 1)

自动寻路(42, 44)
自动寻路(34, 44)
自动寻路(34, 33)
自动寻路(43, 33)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("伊尔村的传送点", 1)

自动寻路(20, 19)
自动寻路(12, 19)
自动寻路(12, 18)
movego(1001,1)

等待到指定地图("村长的家", 1)

自动寻路(15, 17)
自动寻路(15, 13)
自动寻路(7, 13)
movego(1007,1)

等待到指定地图("伊尔村", 1)

自动寻路(39, 83)
自动寻路(39, 71)
自动寻路(31, 71)
自动寻路(31, 65)
movego(1003,1)

等待到指定地图("旧金山酒吧", 1)

自动寻路(16, 19)
自动寻路(16, 3)
自动寻路(21, 3)


chat("心美...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

goto StartBegin 

::begin1::

自动寻路(63, 106)
自动寻路(72, 106)
自动寻路(72, 105)
movego(1001,1)

等待到指定地图("陶欧食品店", 1)

自动寻路(15, 11)
自动寻路(12, 11)


转向(0, "")
等待服务器返回()
对话选择("1", "", "")


转向(0, "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

自动寻路(15, 11)
自动寻路(15, 23)
movego(1005,1)

等待到指定地图("法兰城", 1)

自动寻路(72, 106)
自动寻路(63, 106)
自动寻路(63, 79)

转向(0, "")
等待到指定地图("法兰城",242,100)

自动寻路(242, 88)
自动寻路(280, 88)
movego(1003,1)

等待到指定地图("芙蕾雅", 1)

自动寻路(480, 196)
自动寻路(488, 204)
自动寻路(493, 204)
自动寻路(504, 215)
自动寻路(500, 219)
自动寻路(518, 237)
自动寻路(518,240)
自动寻路(521,243)
自动寻路(529,243)
自动寻路(529,250)
自动寻路(530,250)


chat("亚尔科尔...", "5", "5", "0")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")

goto StartBegin 

::begin2::

自动寻路(63, 88)
自动寻路(140, 88)
movego(1003,1)

等待到指定地图("里谢里雅堡", 1)

自动寻路(41, 53)
自动寻路(41,51)

自动寻路(41,50)


等待到指定地图("里谢里雅堡 1楼", 1)

自动寻路(74, 24)
自动寻路(45, 24)
自动寻路(45, 21)
movego(1001,1)

等待到指定地图("启程之间", 1)

自动寻路(25, 27)

if(取物品数量("亚尔科尔的点心") == 1)then goto  begin3 end

自动寻路(31, 33)
自动寻路(43, 33)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("伊尔村的传送点", 1)

自动寻路(20, 19)
自动寻路(12, 19)
自动寻路(12, 18)
movego(1001,1)

等待到指定地图("村长的家", 1)

自动寻路(15, 17)
自动寻路(15, 13)
自动寻路(7, 13)
movego(1007,1)

等待到指定地图("伊尔村", 1)

自动寻路(39, 83)
自动寻路(39, 71)
自动寻路(31, 71)
自动寻路(31, 65)
movego(1003,1)

等待到指定地图("旧金山酒吧", 1)

自动寻路(16, 19)
自动寻路(16, 3)
自动寻路(21, 3)


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("1", "", "")
等待服务器返回()
对话选择("1", "", "")
goto StartBegin 

::begin3::

自动寻路(19, 27)
自动寻路(19, 23)
自动寻路(9, 23)


转向(7, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("维诺亚村的传送点", 1)

自动寻路(5, 2)
movego(1001,1)

等待到指定地图("村长家的小房间", 1)

自动寻路(8, 5)
自动寻路(1, 5)
movego(1007,1)

等待到指定地图("村长的家", 1)

自动寻路(9, 10)
自动寻路(9, 15)
movego(1005,1)

等待到指定地图("维诺亚村", 1)

自动寻路(41, 37)
自动寻路(41, 46)
自动寻路(46, 46)
自动寻路(46, 64)
自动寻路(49, 64)

chat("心美...", "5", "5", "0")
等待服务器返回()
对话选择("1", "", "")
自动寻路(46, 64)
自动寻路(46, 46)
自动寻路(37, 46)
自动寻路(37, 51)
movego(1005,1)

等待到指定地图("民家", 1)

自动寻路(12, 9)
自动寻路(12, 5)
自动寻路(13, 5)


chat("心美...", "5", "5", "0")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("地下", 1)

自动寻路(4, 10)
自动寻路(8, 10)


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")


转向(2, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")

自动寻路(4,10)
movego(1001,1)

等待到指定地图("民家",1)

自动寻路(12, 5)
自动寻路(12, 9)
自动寻路(4, 9)
movego(1007,1)

等待到指定地图("维诺亚村", 1)

自动寻路(37, 46)
自动寻路(59, 46)
if(人物("血") < 补血值)then goto  buxue end
if(人物("魔") < 补魔值)then goto  buxue end
goto jixu 

::jixu::
自动寻路(66, 46)
movego(1003,1)

等待到指定地图("芙蕾雅", 1)

自动寻路(340, 471)
自动寻路(340, 444)
自动寻路(347, 437)
自动寻路(347, 427)
自动寻路(348, 427)
自动寻路(348, 402)
自动寻路(345, 399)
自动寻路(345, 395)
自动寻路(347, 393)
自动寻路(347, 387)
自动寻路(349, 385)
自动寻路(349, 384)
自动寻路(350, 384)
自动寻路(350, 383)
自动寻路(352, 383)
自动寻路(352, 382)


chat("乌克兰...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("芙蕾雅", 1)

自动寻路(347, 378)
自动寻路(346, 378)
自动寻路(346, 373)
自动寻路(355, 373)
自动寻路(355, 368)
自动寻路( 354 ,367)

等待到指定地图("小路", 1)

自动寻路(61, 115)
自动寻路(64, 112)
自动寻路(64, 96)
自动寻路(57, 96)
自动寻路(57, 95)
自动寻路(56, 95)
自动寻路(56, 94)
自动寻路(54, 94)
自动寻路(54, 93)
自动寻路(52, 93)
自动寻路(52, 91)
自动寻路(51, 91)
自动寻路(51, 90)
自动寻路(50, 90)
自动寻路(50, 81)
自动寻路(49, 81)
自动寻路(49, 80)
自动寻路(48, 80)
自动寻路(48, 72)
自动寻路(47, 71)
自动寻路(47, 69)
自动寻路(46, 68)
自动寻路(43, 68)
自动寻路(43, 67)
自动寻路(42, 67)
自动寻路(42, 66)
自动寻路(41, 66)
自动寻路(41, 65)
自动寻路(40, 65)
自动寻路(40, 64)
自动寻路(39, 64)
自动寻路(39, 63)
自动寻路(38, 63)
自动寻路(38, 62)
自动寻路(36, 62)
自动寻路(35, 61)
自动寻路(33, 61)
自动寻路(33, 60)
自动寻路(30, 60)
自动寻路(30, 53)
自动寻路(22, 53)
自动寻路(22, 51)
自动寻路(21, 51)
自动寻路(21, 49)
自动寻路(21, 45)
自动寻路(22, 45)
自动寻路(22, 42)
自动寻路(23, 42)
自动寻路(23, 31)
自动寻路(23, 23)
自动寻路(24, 23)
自动寻路(24, 19)
自动寻路(25, 19)
自动寻路(25, 15)
自动寻路(27, 15)
自动寻路(27, 14)
自动寻路(28, 14)
自动寻路(28, 13)
自动寻路(29, 13)
自动寻路(29, 12)
自动寻路(30, 12)
自动寻路(30, 11)
自动寻路(31, 11)
自动寻路(31, 10)
自动寻路(43, 10)
自动寻路(43, 11)
自动寻路(45, 11)
自动寻路(45, 23)
movego(1003,1)

等待到指定地图("忍者的隐居地", 1)

自动寻路(14, 37)
自动寻路(31, 37)
自动寻路(31, 28)
自动寻路(26, 28)
自动寻路(26, 23)
自动寻路(22, 23)
自动寻路(22, 13)
自动寻路(19, 13)
自动寻路(19, 10)
movego(1001,1)

等待到指定地图("忍者之家", 1)

自动寻路(17, 39)
自动寻路(21, 39)
自动寻路(21, 34)
自动寻路(26, 34)
自动寻路(26, 14)
自动寻路(16, 14)
自动寻路(16, 21)
自动寻路(13, 21)
自动寻路(13, 20)


转向(0, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("忍者之家2楼", 1)

自动寻路(13, 29)
自动寻路(24, 29)
自动寻路(24, 12)
自动寻路(38, 12)
自动寻路(38, 19)
movego(1007,1)

等待到指定地图("忍者之家", 1)

自动寻路(35, 21)
自动寻路(45, 31)
自动寻路(45, 39)
自动寻路(63, 39)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("井", 1)

自动寻路(16, 12)
自动寻路(16, 9)
自动寻路(15, 9)
自动寻路(13, 7)
自动寻路(11, 7)
自动寻路(8, 4)
movego(1007,1)

等待到指定地图("通路", 1)

自动寻路(45, 44)
自动寻路(37, 44)
自动寻路(34, 41)
自动寻路(29, 41)
自动寻路(27, 39)
自动寻路(27, 30)
自动寻路(22, 30)
自动寻路(22, 27)
movego(1001,1)

等待到指定地图("通路", 1)

自动寻路(22, 16)
自动寻路(21, 16)
自动寻路(21, 15)
自动寻路(19, 15)
自动寻路(19, 14)
自动寻路(17, 14)
自动寻路(17, 13)
自动寻路(16, 12)
自动寻路(13, 12)
自动寻路(13, 11)
自动寻路(12, 11)
自动寻路(12, 10)
自动寻路(7, 10)
自动寻路(5, 12)
自动寻路(5, 14)
movego(1005,1)

等待到指定地图("乌克兰", 1)

自动寻路(89, 84)
自动寻路(89, 75)
自动寻路(82, 75)
自动寻路(80, 73)
自动寻路(70, 73)
自动寻路(61, 82)
自动寻路(56, 82)
自动寻路(52, 86)
自动寻路(45, 86)
自动寻路(44, 85)
自动寻路(41, 85)
自动寻路(41, 81)
自动寻路(43, 79)
自动寻路(43, 74)
自动寻路(45, 72)
自动寻路(45, 62)
自动寻路(49, 58)
自动寻路(54, 58)
自动寻路(57, 61)
自动寻路(62, 61)
自动寻路(62, 62)
自动寻路(75, 62)
自动寻路(75, 59)
自动寻路(79, 55)
自动寻路(79, 49)
自动寻路(78, 49)
自动寻路(78, 47)
movego(1007,1)

等待到指定地图("民家", 1)

自动寻路(9, 10)
自动寻路(9, 7)


chat("毒...", "5", "5", "0")
等待服务器返回()

自动寻路(5, 11)
自动寻路(2, 11)
movego(1007,1)

等待到指定地图("乌克兰", 1)

自动寻路(76, 47)
自动寻路(76, 43)
自动寻路(73, 43)
自动寻路(73, 37)
自动寻路(67, 37)
自动寻路(67, 28)
自动寻路(68, 28)
movego(1003,1)

等待到指定地图("村长的家", 1)

自动寻路(5, 22)
自动寻路(9, 18)
自动寻路(9, 15)
自动寻路(10, 15)
自动寻路(10, 14)
自动寻路(15, 9)
movego(1003,1)

等待到指定地图("族长的家地下室", 1)

自动寻路(7, 11)
自动寻路(10, 11)

chat("毒...", "5", "5", "0")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")
printf(钱)
goto StartBegin 

::buxue::
自动寻路(59, 53)
自动寻路(60, 53)
movego(1003,1)

等待到指定地图("医院",1)

自动寻路(15, 9)
回复(0)


自动寻路(3, 9)
movego(1007,1)

等待到指定地图("维诺亚村", 1)

自动寻路(59, 53)
自动寻路(59, 46)
goto jixu 