刷【怪物硬币】启动点::艾尔莎,公寓,刚学的鉴定技能会卡住，登出重刷
	
	
common=require("common")

清除系统消息()	
--设置("timer", 100)		
设置("高速延时", 3)	
设置("自动叠",1,"５怪物硬币&100")
设置("自动叠",1,"１０怪物硬币&100")
设置("自动叠",1,"１０００怪物硬币&10")
设置("自动叠",1,"１万怪物硬币&10")
设置("自动叠",1,"１怪物硬币&50")
设置("自动叠",1,"地的水晶碎片&999")
设置("自动叠",1,"水的水晶碎片&999")
设置("自动叠",1,"火的水晶碎片&999")
设置("自动叠",1,"风的水晶碎片&999")
设置("自动扔",1,"卡片？")
设置("自动扔",1,"620032")		--1怪物硬币
设置("自动扔",1,"魔石")
设置("自动扔",1,"达杰乌鲁姆的卡片")
设置("自动扔",1,"第七星阿尔多拉的卡片")
设置("自动扔",1,"封印卡（野兽系)")
设置("自动扔",1,"欧比尔蝙蝠的卡片")
设置("自动扔",1,"封印卡（金属系）")
设置("自动扔",1,"封印卡（飞行系）")
设置("自动扔",1,"封印卡（龙系）")
身上最少金币=5000			--少于去取
身上最多金币=1000000			--大于去存
身上预置金币=200000			--取和拿后 身上保留金币

isSuccessed=false		--是否成功鉴定过
	
指定5硬币数量去兑换=500		--500个5硬币 去兑换大面值

补血值=取脚本界面数据("人补血")
补魔值=取脚本界面数据("人补魔")
宠补血值=取脚本界面数据("宠补血")
宠补魔值=取脚本界面数据("宠补魔")

if(补血值==nil or 补血值==0)then
	补血值=用户输入框("多少血以下补血", "430")
end
if(补魔值==nil or 补魔值==0)then
	补魔值 = 用户输入框("多少魔以下补魔", "200")
end
if(宠补血值==nil or 宠补血值==0)then
	宠补血值 = 用户输入框( "宠多少血以下补血", "300")
end
if(宠补魔值==nil or 宠补魔值==0)then
	宠补魔值=用户输入框( "宠多少魔以下补魔", "150")
end

function 跑王冠()
设置("遇敌全跑", 1)
::kaishi::	
	等待空闲()
	当前地图名=取当前地图名()	
	if(当前地图名=="雪拉威森塔９６层")then	
		goto T96
	elseif(当前地图名=="雪拉威森塔９７层")then		
		goto T97
	elseif(当前地图名=="雪拉威森塔９８层")then		
		goto T98
	elseif(当前地图名=="雪拉威森塔９９层")then		
		goto T99
	elseif(当前地图名=="雪拉威森塔最上层")then		
		goto T100
	elseif(当前地图名=="雪拉威森塔前庭")then		
		goto T101
	end
	common.healPlayer(doctorName)
	common.recallSoul()
	common.supplyCastle()
	if(人物("血") < 1000)then goto  lookbu end
	if(人物("魔") < 300)then goto  lookbu end
	--if(宠物("血") < 宠补血值)then goto  lookbu end
	--if(宠物("魔") < 宠补魔值)then goto  lookbu end
	if(取物品数量("塞特的护身符") > 0)then goto  saite end
	if(取物品数量("梅雅的护身符") > 0)then goto  meiya end
	if(取物品数量("提斯的护身符") > 0)then goto  tisi end
	if(取物品数量("伍斯的护身符") > 0)then goto  wusi end
	if(取物品数量("尼斯的护身符") > 0)then goto  nisi end
	if(当前地图名=="艾尔莎岛")then		
		goto 雪拉威森塔
	end
	回城()
	goto kaishi
::雪拉威森塔::	
	移动(165, 153)	
	转向(4)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("利夏岛")		
	移动(90,99,"国民会馆")
	移动(108, 54)	
	回复(0)		
	移动(108, 39)	
	等待到指定地图("雪拉威森塔１层")		
	移动(75, 50)	
	等待到指定地图("雪拉威森塔５０层")		
	移动(16, 44)	
	等待到指定地图("雪拉威森塔９５层")	
	移动(26, 104)
	移动(27, 104)		
	转向(2)
	等待服务器返回()	
	对话选择("32", "", "")	
	对话选择("4", "", "")	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９６层")		
	goto lookbu
	
::saite::	
	使用物品("塞特的护身符")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("雪拉威森塔９５层")		
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９６层")			
::T96::
	移动(86, 120)
	移动(87, 119)			
	转向(1, "")
	等待服务器返回()	
	对话选择("32", "", "")	
	等待服务器返回()	
	对话选择("32", "", "")	
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９７层")		
	goto lookbu
::meiya::	
	使用物品("梅雅的护身符")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("雪拉威森塔９６层")	
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９７层")	
::T97::
	移动(117, 126)	
	转向(0, "")
	等待服务器返回()	
	对话选择("32", "", "")	
	对话选择("32", "", "")	
	对话选择("32", "", "")	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９８层")		
	goto lookbu
::tisi::	
	使用物品("提斯的护身符")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("雪拉威森塔９７层")	
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９８层")		
::T98::	
	移动(120, 121)		
	转向(0, "")
	等待服务器返回()	
	对话选择("32", "", "")	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９９层")	
	goto lookbu	
::wusi::	
	使用物品("伍斯的护身符")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("雪拉威森塔９８层")		
	转向(0)
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔９９层")		
::T99::
	移动(101, 55)		
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔最上层")		
	goto lookbu
::nisi::	
	使用物品("尼斯的护身符")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("雪拉威森塔９９层")		
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("雪拉威森塔最上层")		
::T100::	
	移动(103, 134)	
	等待到指定地图("雪拉威森塔前庭")		
::T101::	
	移动(103, 19)		
::jiance::
	goto wangguan
	if(取物品数量("王冠") < 1)then goto  wangguan end	
	if(取物品数量("公主头冠") < 1)then goto  gongzhuguan end
::xiaomaomao::	
	转向(1, "")
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()	
	对话选择("1", "", "")	
	goto dengdai 
::wangguan::
	等待(300)	
	喊话("男",2,3,4)
	等待服务器返回()
	对话选择(1,0)
	goto dengdai 
::gongzhuguan::
	等待(300)	
	转向(1)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()	
	对话选择(1,0)
	goto dengdai 
::dengdai::
	等待到指定地图("国民会馆")	
	等待(200)
	if(取物品数量("王冠") > 0)then goto  qucun end	
	if(取物品数量("小猫帽") > 0)then goto  qucun end	
	goto kaishi 
::lookbu::
	needSupply = false
	if(人物("血") < 人物("最大血") or 人物("魔") < 人物("最大魔")) then
		needSupply=true
	end
	if(宠物("血") < 宠物("最大血") or 宠物("魔") < 宠物("最大魔")) then
		needSupply=true
	end
	if(needSupply == false)then
		goto kaishi
	end
	回城()
	等待到指定地图("艾尔莎岛")	
	转向(1)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")		
	移动(34, 89)	
	回复(1)	
	common.healPlayer(doctorName)
	common.recallSoul()
	等待(2000)
	goto kaishi 
::qucun::
   	回城()
   	等待到指定地图("艾尔莎岛")   
设置("遇敌全跑", 0)
end
function main()
::begin::	
	等待空闲()
	停止遇敌()
	if(取当前地图名() == "公寓")then goto 补魔 end 
	if(取当前地图名() == "辛梅尔")then goto 开始 end 
	if(取当前地图名() == "艾尔莎岛")then goto 出发 end
	if(取当前地图名() == "光之路")then goto 盗币4 end 
 
	if(人物("坐标")  == "164,88")then	goto 盗币1 end
	if(人物("坐标")  == "164,83")then	goto 盗币2 end
	if(人物("坐标")  == "168,96")then	goto 盗币3 end
	if(人物("坐标")  == "170,100")then	goto 盗币4 end
	common.checkHealth()
	common.checkCrystal(水晶名称)
	回城()
	等待(2000)
	goto begin 
::出发::
	if(取物品叠加数量("５怪物硬币") >= 指定5硬币数量去兑换)then 		
		t25兑换()
		goto begin
	end
	if(取物品叠加数量("１０００怪物硬币") >0 or 取物品叠加数量("１万怪物硬币") >0)then		
		common.gotoBankTalkNpc()
		银行("全存","１０００怪物硬币",10)
		银行("全存","１万怪物硬币",10)
		回城()		
	end	
	if(取物品数量("王冠") < 1)then		
		common.gotoBankTalkNpc()
		银行("取物","王冠",1)
		等待(2000)
		if(取物品数量("王冠") < 1)then
			日志("脚本需要王冠，如果没有的话，请走到辛美尔在启动",1)	
			--执行脚本("./脚本/其他/★跑王冠.lua")
			跑王冠()
			等待(2000)
			goto begin
		else
			回城()
			goto begin
		end
	end
	移动(165,153)	
	转向(4)
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("利夏岛")	
	移动(90,99,"国民会馆")	
	移动(108,39,"雪拉威森塔１层")
	移动(34,95)	
	转向(2)
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	等待到指定地图("辛梅尔")
::开始::			
	if(取当前地图名() ~= "辛梅尔")then
		goto begin
	end
	移动(181,81,"公寓")	
	移动(93,58)   	
::补魔::	
	移动(91,58)   	 
	回复(0)	
	日志("人物金币："..人物("金币"))	 
	common.checkGold(身上最少金币,身上最多金币,身上预置金币)
	if(取物品数量(硬币？) > 0)then goto 鉴定 end
	if(取物品叠加数量("５怪物硬币")>= 100 or 取物品叠加数量("１怪物硬币")>= 50)then
		移动(106,63)
		转向(2)
		等待服务器返回()
		if(取银行物品叠加数量("５怪物硬币") >= 指定5硬币数量去兑换)then 
			t25兑换()
			goto begin
		end
		银行("全存","５怪物硬币",100)
		银行("全存","１怪物硬币",50)
		转向(2)
		等待服务器返回()
		日志("银行硬币数量:5硬币"..取银行物品叠加数量("５怪物硬币").." 1000硬币:"..取银行物品叠加数量("１０００怪物硬币"),1)
		if(取包裹空格() < 5 and 取物品叠加数量("５怪物硬币") >= 指定5硬币数量去兑换)then 
			t25兑换()
			goto begin
		end
		-- items =物品信息()
		-- for i,v in pairs(items) do
			-- if((v.name == "５怪物硬币" || v.name == "１怪物硬币") and v.count ==100)then
				
			-- end
		-- end
	end   
	移动(100,70,"辛梅尔")	 	
	移动(207,91,"光之路")			
::盗币1::	
	移动(164, 83)
	开始遇敌()		
--==========开始挂怪物硬币========================================================================	
::硬币1::	
	if(人物("魔") < 补魔值)then goto 回补 end
	if(人物("血") < 补血值)then goto  回补 end
	if(宠物("血") < 宠补血值)then goto 回补 end
	if(宠物("魔") < 宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then
		if(取物品数量("硬币？") < 1)then
			goto 回补
		else
			goto 鉴定1 
		end
	end
	if(取当前地图名() ~= "光之路")then goto begin end 
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位2	end
	goto 硬币1 
::移位2::	
	停止遇敌()
	清除系统消息()	
	移动(164, 83)	        
	goto 盗币2          
::盗币2::	
	移动(164, 88)
	开始遇敌() 
::硬币2::	
	if(人物("魔") < 补魔值)then goto 回补 end
	if(人物("血") < 补血值)then goto  回补 end
	if(宠物("血") < 宠补血值)then goto 回补 end
	if(宠物("魔") < 宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then 	
		if(取物品数量("硬币？") < 1)then
			goto 回补
		else
			goto 鉴定2 
		end
	end
	if(取当前地图名() ~= "光之路")then goto begin end 
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位3	end
	goto 硬币2 
::移位3::	
	停止遇敌()
	清除系统消息()		     
	goto 盗币3          
::盗币3::	
	移动(164, 88)
	移动(168, 95)
	开始遇敌()    
::硬币3::		
	if(人物("魔") < 补魔值)then goto 回补 end
	if(人物("血") < 补血值)then goto  回补 end
	if(宠物("血") < 宠补血值)then goto 回补 end
	if(宠物("魔") < 宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then 
		if(取物品数量("硬币？") < 1)then
			goto 回补
		else
			goto 鉴定3
		end
	end
	if(取当前地图名() ~= "光之路")then goto begin end 
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位4	end
	goto 硬币3 
::移位4::	
	停止遇敌()
	清除系统消息()
	移动(168, 95)
	移动(170,100) 
	goto 盗币4          
::盗币4::	
	移动(170,100)
	开始遇敌()	
::硬币4::		
	if(人物("魔") < 补魔值)then goto 回补 end
	if(人物("血") < 补血值)then goto  回补 end
	if(宠物("血") < 宠补血值)then goto 回补 end
	if(宠物("魔") < 宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then 
		if(取物品数量("硬币？") < 1)then
			goto 回补
		else
			goto 鉴定4 
		end
	end
	if(取当前地图名() ~= "光之路")then goto begin end 
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位1	end
	goto 硬币4 
::移位1::	
	停止遇敌()
	清除系统消息()
	移动(170,100)
	移动(167, 84)
	移动(166, 83)	      
	goto 盗币1          
::回补::		
	停止遇敌()	
	common.checkHealth()
	移动(201, 19,"辛梅尔")		
	移动(191,99)
	goto 开始 
::鉴定1::		
	停止遇敌()	
	鉴定()
	goto 盗币1 
::鉴定2::		
	停止遇敌()	
	鉴定()
	goto 盗币2 
::鉴定3::		
	停止遇敌()	
	鉴定()
	goto 盗币3 
::鉴定4::		
	停止遇敌()	
	鉴定()
	goto 盗币4 
::鉴定::	
	鉴定()
	goto 补魔 
end

function 鉴定()	
	取物品数量("硬币？") > 0 and 人物("魔")>= 10 do	
	工作("鉴定","硬币？",15000,false)	
	local tryCount=0
	while 取物品数量("硬币？") > 0 and 人物("魔")>= 10 and tryCount<40  do	
		工作("鉴定","硬币？",1000)	
		tryCount = tryCount+1
	end
end
function t25兑换()
	回城()
	common.gotoBankTalkNpc()
	丢("硬币？")
	等待(5000)
	转向(2)	
	银行("全取","５怪物硬币",取包裹空格()-1)
	银行("全取","１０怪物硬币",取包裹空格()-1)
	银行("全取","１０００怪物硬币",取包裹空格()-1)
	if(取包裹空格() < 1)then
		转向(2)	
		银行("存物","５怪物硬币")
	end
	回城()
::begin::
	等待空闲()
	当前地图名=取当前地图名()
	mapNum=取当前地图编号()
	if(当前地图名=="艾尔莎岛")then
		goto aiersha	
	elseif (当前地图名=="利夏岛" )then	
		goto map59522
	elseif (当前地图名=="国民会馆" )then	
		goto map59552
	elseif (当前地图名=="雪拉威森塔１层" )then	
		goto map59801
	elseif (当前地图名=="雪拉威森塔２５层" )then	
		goto map59825	
	else
		回城()
	end
	等待(1000)
	日志("脚本启动需在艾尔莎岛",1)
	goto begin 
::aiersha::	
	移动(165, 153)
	转向(4)
	等待服务器返回()
	对话选择(32,0)
	等待服务器返回()
	对话选择(4, 0)		
::map59522::					--利夏岛
	if(取当前地图名() ~= "利夏岛")then
		goto begin
	end
	移动(90,99,"国民会馆")
::map59552::					--国民会馆
	移动(108,39,"雪拉威森塔１层")
	goto begin
::map59801::					--雪拉威森塔１层
	移动(76,52,"雪拉威森塔２５层")		
	goto begin
::map59825::
	移动(92,31)
	--换硬币 要1个空格 最少
	对话选是(0)
	对话选是(0)
	对话选是(0)
	对话选是(0)
	对话选是(0)
	对话选是(0)
	对话选是(0)
	common.gotoBankTalkNpc()
	银行("全存","１０怪物硬币",100)
	银行("全存","１０００怪物硬币",10)
	转向(2)
	等待服务器返回()
	日志("银行硬币数量:5硬币"..取银行物品叠加数量("５怪物硬币").." 1000硬币:"..取银行物品叠加数量("１０００怪物硬币"),1)
end
main()