启动地点，艾尔莎岛、里堡，学习宠物4级技能的脚本

common=require("common")

设置("自动战斗", 1)
设置("高速战斗", 1)
设置("高速延时", 4)

inputVal = 用户下拉框("组队还是单人",{"单人","带队"})
--移动速度=用户输入框("移动速度", 20)
是否带队=false
队伍人数=5
if(inputVal=="单人")then
	是否带队=false	
	设置("遇敌全跑", 1)			-- 开启遇敌全跑 
else
	是否带队=true
	--队伍人数=用户输入框("队伍人数", 5)
	队伍人数 = 用户下拉框("队伍人数",{"2","3","4","5"})
end

while true do
	if(取包裹空格() < 2)then
		日志("包裹没有2格空格",1)
	else
		break
	end
	等待(2000)
end

	停止遇敌()	
	清除系统消息()	
::begin::	
	等待空闲()
	当前地图名=取当前地图名()
	mapNum=取当前地图编号()
	if(当前地图名=="艾尔莎岛")then
		goto aiersha	
	elseif (当前地图名=="里谢里雅堡" )then	
		goto libao
	elseif (当前地图名=="启程之间" )then	
		goto warpRoom	
	elseif (当前地图名=="奇利村的传送点" )then	
		goto qlc
	elseif (当前地图名=="哈贝鲁村" )then	--3100
		goto qlc
	end
	等待(1000)
	日志("脚本启动需在艾尔莎岛或里堡",1)
	goto begin 
::aiersha::
	自动寻路(140,105)		
	喊话("索奇亚古文本调查任务启动",01,05,01)	
	转向(1)
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("里谢里雅堡")
::libao::
	喊话("索奇亚古文本调查任务启动",01,05,01)
	if(是否带队)then
		自动寻路(25,86)
		common.makeTeam(队伍人数)
	end
	自动寻路(32, 91)
	自动寻路(34, 89)
	回复(1)		
	自动寻路(29, 91)		
::拿字典::
	自动寻路(31, 82)
	自动寻路(41, 72)
	自动寻路(41, 53)
	自动寻路(48, 53)
	自动寻路(48, 51)
::拿字典2::	
	转向(0, "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	if(取物品数量("古代文明字典") == 1)then goto  奇利村石碑 end
	if(取物品数量("古代文明字典") == 0)then goto  拿字典2 end
	goto 拿字典2 

::奇利村石碑::	
	自动寻路(41,50)	        
	等待到指定地图("里谢里雅堡 1楼")		
	自动寻路(45,20)
::warpRoom::
	if(取当前地图名() ~= "启程之间")then
		goto begin
	end		
	自动寻路(8,33)
	离开队伍()		
	转向(0)
	等待服务器返回()
	对话选择("4", "", "")
	等待(2000)
	goto begin
::qlc::
	if(取当前地图名() ~= "奇利村的传送点")then
		goto begin
	end	
	if(是否带队)then	
		自动寻路(12, 9)	
		common.makeTeam(队伍人数)
	end
	自动寻路(7, 6)	
	等待到指定地图("村长的家")	
    自动寻路(7, 1)	
	等待到指定地图("村长的家")
	自动寻路(1, 8)	
	等待到指定地图("奇利村")	
    自动寻路(79, 76)	
	等待到指定地图("索奇亚")	
	自动寻路(293, 228)	
::风之石碑::
	自动寻路(296, 225)	
	转向(2, "")
	等待服务器返回()	
	对话选择("1", "", "")
	等待服务器返回()
	对话选择("1", "", "")		
	if(取物品数量("风的石板") == 1)then goto  洪恩风洞 end
	if(取物品数量("风的石板") == 0)then goto  风之石碑 end
	goto 风之石碑 

::洪恩风洞::
	自动寻路(355, 335)
	自动寻路(356, 334)	
	等待到指定地图("角笛大风穴")
	自动寻路(134, 26)
	自动寻路(133, 26)	
	等待到指定地图("索奇亚", 1)	
	自动寻路(510, 235)
	等待(500)	
::火之石碑::
	自动寻路(512, 233)	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	
	对话选择("1", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	if(取物品数量("火的石板") == 1)then goto  穿越沙漠 end
	if(取物品数量("火的石板") == 0)then goto 火之石碑 end
	goto 火之石碑 

::穿越沙漠::
	自动寻路(585, 425)
	自动寻路(581, 425)
	等待(500)
	
::水之石碑::
	自动寻路(581, 423)	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	
	对话选择("1", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	等待(500)
	
	if(取物品数量("水的石板") == 1)then goto  穿越沙漠2 end
	if(取物品数量("水的石板") == 0)then goto 水之石碑 end
	goto 水之石碑 

::穿越沙漠2::
	自动寻路(626, 307)
	自动寻路(626, 300)
	等待(500)
	
::地之石碑::
	if(是否带队)then common.makeTeam(队伍人数) end	
	goto 地之石碑2 
::地之石碑2::
	自动寻路(629, 300)		
	转向(2, "")	
	等待服务器返回()	
	喊话("大地",01,05,05)	
	等待服务器返回()	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待(2000)
	if(取当前地图名() ==  "哈贝鲁村")then goto   任务完成 end
	if(取当前地图名() ==  "索奇亚")then goto   地之石碑2 end
	goto 地之石碑2 

::任务完成::
	喊话("任务完成，请欣赏下哈贝鲁村。",01,05,05)
	自动寻路(20,85)
	等待(10000)
	goto 任务完成 
