宠物人形系和植物系坐骑技能学习,进去不要乱走动，会传送到一层

::begin::	
	等待空闲()		
	local 当前地图名 = 取当前地图名()	
	if (当前地图名=="艾尔莎岛" )then		
		goto aiDao		
	elseif (当前地图名=="国民会馆" )then	
		goto 国民会馆	
	end
	回城()
	等待(1000)
	goto begin
::aiDao::
	设置("移动速度",走路加速值)	
	自动寻路(165,153)
	等待(1000)	
	对话选是(4)	
::liXiaDao::
	等待到指定地图("利夏岛")	
	自动寻路(90,99,"国民会馆")
::国民会馆::				
	自动寻路(109,51)
	回复(108,52)
	自动寻路(109,50)
	自动寻路(108,39,"雪拉威森塔１层")
	自动寻路(164, 103,"雪拉威森塔２层")
	自动寻路(86, 125,"雪拉威森塔３层")
	自动寻路(116, 111,"雪拉威森塔４层")
	自动寻路(100, 71,"雪拉威森塔５层")
	自动寻路(223, 331)
	自动寻路(224, 331)
	自动寻路(244,130)