::▲刷【怪物硬币】启动点::艾尔莎,公寓
	
	
	
--设置("timer", 100)	
	
	
设置("高速延时", 3)	
设置("自动叠",1,"５怪物硬币&100")
设置("自动叠",1,"１怪物硬币&100")
设置("自动叠",1,"地的水晶碎片&999")
设置("自动叠",1,"水的水晶碎片&999")
设置("自动叠",1,"火的水晶碎片&999")
设置("自动叠",1,"风的水晶碎片&999")
设置("自动扔",1,"卡片？")
设置("自动扔",1,"魔石")
设置("自动扔",1,"达杰乌鲁姆的卡片")
设置("自动扔",1,"第七星阿尔多拉的卡片")

isSuccessed=false		--是否成功鉴定过
	
回城补魔值=用户输入框( "多少魔以下回城补给", "100")	
回城补血值=用户输入框( "多少血以下回城补给", "300")	
回城宠补魔值=用户输入框( "宠多少魔以下回城补给", "150")	
回城宠补血值=用户输入框( "宠多少血以下回城补给", "300")	
function 鉴定()	
	if(isSuccessed)then	
		while 取物品数量("硬币？") > 0 and 人物("魔")>= 10 do	
			工作("鉴定","硬币？",6500,true)					
			等待(500)
		end
	else
		while 取物品数量("硬币？") > 0 and 人物("魔")>= 10 do	
			工作("鉴定","硬币？",6500,false)					
			res=等待工作返回()
			if(res ~= nil and res.success)then
				isSuccessed=true
				break
			end
		end
	end
end
function main()
::选择::	
	if(取当前地图名() == "公寓")then goto 补魔 end 
	if(取当前地图名() == "辛梅尔")then goto 开始 end 
	if(取当前地图名() == "艾尔莎岛")then goto 出发 end
	if(取当前地图名() == "光之路")then goto 盗币4 end 
 
	if(人物("坐标")  == "164,88")then	goto 盗币1 end
	if(人物("坐标")  == "164,83")then	goto 盗币2 end
	if(人物("坐标")  == "168,96")then	goto 盗币3 end
	if(人物("坐标")  == "170,100")then	goto 盗币4 end
	goto 选择 
::出发::	
	等待到指定地图("艾尔莎岛", 140,105)
	移动(162,127)
	移动(162,150)
	移动(165,153)
	
	
	转向(4, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("利夏岛", 1)
	
	移动(90,98)
	
	移动(90,99)
	
	等待到指定地图("国民会馆", 1)
	移动(100,50)
	
	移动(108,42)
	
	移动(108,39)
	
	等待到指定地图("雪拉威森塔１层", 1)
	移动(34,95)
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
::开始::	
	
	等待到指定地图("辛梅尔")	
	移动(185,86)
	移动(181,82)	
	移动(181,81) 
	等待到指定地图("公寓")	
	移动(100,65)   
	移动(93,58)   
::补魔::	
	移动(91,58)   	 
	回复(0)	
	日志("人物金币："..人物("金币"))	 
	if(取物品数量(硬币？) > 0)then goto 鉴定 end
	移动(93,58)   
	移动(100,65)   
	移动(100,69)	   
	移动(100,70)
	等待到指定地图("辛梅尔", 1)	   
	移动(181,82)
	移动(181,82)
	移动(191,93)   
	移动(191,99)   
	移动(202,99)   
	移动(202,93)   
	移动(205,93)   
	移动(206,92)	
	移动(207,91) 
	等待(2000)
	等待到指定地图("光之路")	
	移动(197, 34)
	移动(194, 37)
	移动(194, 44)
	移动(201, 50)
	移动(201, 50)
	移动(201, 71)
	移动(197, 78)
	移动(190, 85)
	移动(190, 85)
	移动(168, 85)
	移动(164, 83)
::盗币1::	
	开始遇敌()
	
	--设置("timer", 50)
	
--==========开始挂怪物硬币========================================================================	
::硬币1::	
	if(人物("魔") < 回城补魔值)then goto 回补 end
	if(人物("血") < 回城补血值)then goto  回补 end
	if(宠物("血") < 回城宠补血值)then goto 回补 end
	if(宠物("魔") < 回城宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then goto 鉴定1 end
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位2	end
	goto 硬币1 
::移位2::	
	停止遇敌()
	清除系统消息()
	等待(500)	
	移动(164, 83)
	移动(164, 88)
	开始遇敌()         
	goto 盗币2          
::盗币2::	
	开始遇敌()	
::硬币2::	
	if(人物("魔") < 回城补魔值)then goto 回补 end
	if(人物("血") < 回城补血值)then goto  回补 end
	if(宠物("血") < 回城宠补血值)then goto 回补 end
	if(宠物("魔") < 回城宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then goto 鉴定2 end
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位3	end
	goto 硬币2 
::移位3::	
	停止遇敌()
	清除系统消息()
	等待(500)	
	移动(164, 88)
	移动(168, 95)
	开始遇敌()         
	goto 盗币3          
::盗币3::	
	开始遇敌()	
::硬币3::		
	if(人物("魔") < 回城补魔值)then goto 回补 end
	if(人物("血") < 回城补血值)then goto  回补 end
	if(宠物("血") < 回城宠补血值)then goto 回补 end
	if(宠物("魔") < 回城宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then goto 鉴定3 end
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位4	end
	goto 硬币3 
::移位4::	
	停止遇敌()
	清除系统消息()
	移动(168, 95)
	移动(170,100)
	开始遇敌()         
	goto 盗币4          
::盗币4::	
	开始遇敌()	
::硬币4::		
	if(人物("魔") < 回城补魔值)then goto 回补 end
	if(人物("血") < 回城补血值)then goto  回补 end
	if(宠物("血") < 回城宠补血值)then goto 回补 end
	if(宠物("魔") < 回城宠补魔值)then goto 回补 end
	if(取包裹空格() < 1)then goto 鉴定4 end
	if(string.find(最新系统消息(),"无法放置")~=nil)then goto 移位1	end
	goto 硬币4 
::移位1::	
	停止遇敌()
	清除系统消息()
	移动(170,100)
	移动(167, 84)
	移动(166, 83)
	开始遇敌()         
	goto 盗币1          
::回补::		
	停止遇敌()	
	移动(169, 85)
	移动(190, 85)
	移动(197, 78)
	移动(197, 78)
	移动(197, 75)
	移动(201, 50)
	移动(201, 50)
	移动(200, 50)
	移动(194, 37)
	移动(197, 23)
	移动(201, 19)
	等待到指定地图("辛梅尔")	
	移动(206,92)
	移动(205,93)
	移动(202,93)
	移动(202,99)	
	移动(191,99)
	goto 开始 
::鉴定1::		
	停止遇敌()	
	鉴定()
	goto 盗币1 
::鉴定2::		
	停止遇敌()	
	鉴定()
	goto 盗币2 
::鉴定3::		
	停止遇敌()	
	鉴定()
	goto 盗币3 
::鉴定4::		
	停止遇敌()	
	鉴定()
	goto 盗币4 
::鉴定::	
	鉴定()
	goto 补魔 
end

main()