刷二戒梯子脚本,耶鲁克前面211 108 ， 231 128耶鲁克会魔反 哈乌会攻反，请设置好技能 脚本没有自动检测梯子功能，请自行查看
   星落制作-----QQ：274100927




设置("timer", 200)


    补魔值=用户输入框( "多少魔以下去补给", "300")
     补血值=用户输入框( "多少血以下去补给", "500")
     宠补魔值=用户输入框( "宠多少魔以下去补给", "300")
     宠补血值=用户输入框( "宠多少血以下去补给", "700")

::begin::
	if(人物("坐标")  == "211,108")then	goto hawu end
	if(人物("坐标")  == "231,128")then	goto yeluke end
	goto begin 
::yeluke::
	自动寻路(229,126)
	自动寻路(228,126)
	
	
	转向(7, "")                
	等待服务器返回()
	
	对话选择("8", "", "")           --4代表选是
	等待服务器返回()
	
	对话选择("1", "", "")	    --1代表确定
	等待(500)
	goto begin 
::hawu::
	等待(500)
       	喊话("脚本再次启动^^揍哈乌...",03,03,05)
	自动寻路(211,109)
	自动寻路(213,111)
	
	转向(3, "")                
	等待服务器返回()
	
	对话选择("8", "", "")           --4代表选是
	等待服务器返回()
	
	对话选择("1", "", "")	    --1代表确定
	等待(500)
::jiance::
	if(人物("血") < 补血值)then goto  bu end
	if(人物("魔") < 补魔值)then goto  bu end
	if(宠物("血") < 宠补血值)then goto  bu end
	if(宠物("魔") < 宠补魔值)then goto  bu end
        goto begin 
::bu::
	自动寻路(233,131)

	自动寻路(235,131)
	自动寻路(236,131)
	自动寻路(237,132)
	自动寻路(238,132)
	自动寻路(238,133)
	自动寻路(239,133)
	自动寻路(240,134)
	自动寻路(242,136)
	自动寻路(244,138)
	自动寻路(248,138)
	自动寻路(250,136)
	自动寻路(252,135)
	自动寻路(254,134)
	自动寻路(254,129)
	自动寻路(256,129)
	自动寻路(257,128)
	自动寻路(263,128)
	自动寻路(265,129)
	自动寻路(276,129)
	自动寻路(277,129)
	
	
	等待到指定地图("丘斯特村", 1)
	
	自动寻路(66,139)
	自动寻路(67,139)
	自动寻路(69,138)
	自动寻路(70,138)
	自动寻路(72,137)
	自动寻路(74,137)
	自动寻路(76,136)
	自动寻路(78,135)
	自动寻路(79,135)
	自动寻路(79,129)
	自动寻路(81,127)
	自动寻路(83,125)
	自动寻路(84,124)
	自动寻路(83,122)
	自动寻路(83,114)
	自动寻路(84,112)
	自动寻路(84,110)
	自动寻路(84,108)
	自动寻路(83,107)
	自动寻路(80,104)
	自动寻路(80,102)
	等待到指定地图("大厅", 1)
	
	

	自动寻路(24,34)
	自动寻路(26,32)
	自动寻路(29,32)
	自动寻路(29,33)
	自动寻路(29,32)
	自动寻路(29,33)
	自动寻路(29,32)
	自动寻路(29,33)
	自动寻路(29,32)
	
	回复(2)
	
	 等待(10000)                   --等待X秒等候队友反应
	自动寻路(26,32)
	自动寻路(24,34)
	自动寻路(23,34)
	
	等待到指定地图("丘斯特村", 1)
	
	自动寻路(80,104)
	自动寻路(83,107)
	自动寻路(84,108)
	自动寻路(84,110)
	自动寻路(84,112)
	自动寻路(83,114)
	自动寻路(83,122)
	
	自动寻路(84,124)

	自动寻路(83,125)
	自动寻路(81,127)
	自动寻路(79,129)
	自动寻路(79,135)
	自动寻路(78,135)
	自动寻路(78,136)
	自动寻路(76,136)
	自动寻路(74,136)
	自动寻路(74,137)
	自动寻路(72,137)
	自动寻路(70,138)
	自动寻路(69,138)
	自动寻路(67,139)
	自动寻路(66,139)	
	自动寻路(64,139)
	等待到指定地图("布拉基姆高地", 1)

	
	自动寻路(277,129)
	自动寻路(276,129)
	自动寻路(265,129)
	自动寻路(263,128)
	自动寻路(257,128)
	自动寻路(256,129)
	自动寻路(254,129)
	自动寻路(254,134)
	自动寻路(252,135)
	自动寻路(250,135)
	自动寻路(250,136)
	自动寻路(248,138)
	自动寻路(244,138)
	自动寻路(242,136)
	自动寻路(240,134)
	自动寻路(239,133)
	自动寻路(238,133)
	自动寻路(238,132)
	自动寻路(237,132)
	自动寻路(236,131)
	自动寻路(235,131)
	自动寻路(233,131)
	自动寻路(232,130)
	自动寻路(232,129)
	自动寻路(231,128)
	goto begin 






