好像要传送羽毛啊!都抽奖抽了40来万了都没有中5555~~~GM一点都不可怜我！        ---☆奇天烈§
设置("timer",88)
物品数量=用户输入框("身上有多少个非彩票物品?","7");
彩票数量=用户输入框("大于多少个物品去换奖？","18");

::StartBegin::
	if(人物("坐标")  == "233,78")then	goto  e2 end
	if(人物("坐标")  == "162,130")then	goto  s2 end
	if(人物("坐标")  == "72,123")then	goto  w2 end
	if(人物("坐标")  == "242,100")then	goto  e1 end
	if(人物("坐标")  == "141,148")then	goto  s1 end
	if(人物("坐标")  == "63,79")then	goto  w1 end
	goto StartBegin 

::e2::
	
	等待到指定地图("法兰城", 233, 78)
	
        移动(219, 92)
        移动(214, 92)
        goto begin1    

::s2::
	
	等待到指定地图("法兰城", 162, 130)
	
	转向(2, "")
	

::w2::
	
	等待到指定地图("法兰城", 72, 123)
	
	转向(2, "")
        goto e2 

::e1::
	
	等待到指定地图("法兰城", 242, 100)
	
        goto begin2 

::s1::
	
	等待到指定地图("法兰城", 141, 148)
	
	转向(0, "")
	

::w1::
	
	等待到指定地图("法兰城", 63, 79)
	
	goto begin 
	
::begin::
	
	转向(0, "")
	
::begin2::
	等待到指定地图("法兰城", 242, 100)
	
	移动(241,100)
	移动(224,117)
	移动(217,117)
	移动(214,120)
::begin1::
	移动(214,136)
	移动(218,136)
	移动一格(2,1)
	
	等待到指定地图("科特利亚酒吧",1)
	
	移动(22, 16)
	移动(26, 20)
	移动一格(2,1)
	
	等待到指定地图("酒吧里面", 1)
	移动(8, 15)
	移动(8, 17)
	移动(9, 17)
	
	
	转向(2, "")
	等待服务器返回()	
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	等待到指定地图("闪卡卖场", 1)
	
	移动(11, 24)
	移动(11, 23)
	
        等待到指定地图("闪卡卖场", 11, 23)
::But07::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z19", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But06::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z18", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But05::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z17", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But04::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z16", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But03::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z15", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But02::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z14", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But01::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z13", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But0::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z12", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z11", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But1::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z10", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But2::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z9", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
        goto 8888 
::But3::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z8", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But4::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z7", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But5::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z6", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But6::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z5", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But7::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z4", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But8::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z3", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But9::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z2", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 
::But10::
        
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "1\z1", "")
	等待服务器返回()
	对话选择("0", "3", "")
	
	
goto 8888 


::8888::
	使用物品("宝石鼠闪卡")
	if(取物品数量("宝石鼠闪卡") > 0)then goto  8888 end 
	if(取物品数量("物品") > 彩票数量)then goto  Money end 
        if(取物品数量("物品") > 17)then goto  But10 end 
        if(取物品数量("物品") > 16)then goto  But9 end 
        if(取物品数量("物品") > 15)then goto  But8 end 
        if(取物品数量("物品") > 14)then goto  But7 end 
        if(取物品数量("物品") > 13)then goto  But6 end 
        if(取物品数量("物品") > 12)then goto  But5 end 
        if(取物品数量("物品") > 11)then goto  But4 end 
        if(取物品数量("物品") > 10)then goto  But3 end 
	if(取物品数量("物品") > 9)then goto  But2 end 
        if(取物品数量("物品") > 8)then goto  But1 end
	if(取物品数量("物品") > 7)then goto  But end 
        if(取物品数量("物品") > 6)then goto  But0 end 
        if(取物品数量("物品") > 5)then goto  But01 end
        if(取物品数量("物品") > 4)then goto  But02 end
        if(取物品数量("物品") > 3)then goto  But03 end
        if(取物品数量("物品") > 2)then goto  But04 end
        if(取物品数量("物品") > 1)then goto  But05 end
        if(取物品数量("物品") > 0)then goto  But06 end
        if(取物品数量("物品") == 0)then goto  But07 end
       goto 8888 

::Money::
	移动(20, 23)
	移动(20, 15)
	
::$$$$$::
	
	转向(2, "")
	
	等待服务器返回()
	对话选择("4", "", "")
	
	等待服务器返回()
	对话选择("1", "", "")
	
	if(取物品数量("宝石鼠钻石奖") > 0)then goto  $$$$$ end
	if(取物品数量("宝石鼠月亮奖") > 0)then goto  $$$$$ end
	if(取物品数量("宝石鼠金奖") > 0)then goto  $$$$$ end
	if(取物品数量("宝石鼠银奖") > 0)then goto  $$$$$ end
	if(取物品数量("宝石鼠铜奖") > 0)then goto  $$$$$ end
	if(取物品数量("宝石鼠残念奖") > 0)then goto  $$$$$ end
	
	goto StartBegin_88 

::StartBegin_88::
	移动(20, 24)
	移动(11, 23)
	
	printf(钱)
	
	goto 8888 

::End::
	exit
	
	