小Show拿风之卵  ::起点:: 艾尔莎岛任意位置,定居艾尔莎岛.有问题联系264308416


设置("timer", 100)						

-- 设定自动战斗设置
设置("自动战斗", 1)				
设置("高速战斗", 3)			
设置("高速延时", 6)

::njr::
       回城()
       
       
       
       
       
       等待到指定地图("艾尔莎岛", 1)
       --从登入点开始
       ::begin::
       if(人物("坐标")  == "140,105")then	goto  r1 end
       goto begin 

::r1::
       --艾岛登入点
       移动(141, 105)
       移动(141, 106)
       移动(144, 106)
       移动(144, 96)
       移动(201, 96)
       

       等待到指定地图("神殿　伽蓝", 1)
       

       移动(88, 95)
       移动(88, 82)
       移动(92, 82)
       移动(92, 81)
       移动(93, 81)
       移动(93, 80)
       移动(95, 80)
       

       等待到指定地图("神殿　前廊", 1)


       移动(42, 38)
       移动(42, 41)
       移动(44, 41)
       移动(32, 34)
       移动(32, 30)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       等待(1000)

       移动(32, 32)
       移动(29, 32)
       移动(29, 30)
       移动(18, 30)
       移动(18, 33)
       移动(17, 33)
       等待到指定地图("精灵之下宫", 1)

       移动(92, 76)
       移动(81, 87)
       等待(2000)
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　玄关8", 1)
       
       
       移动(81, 77)
       移动(81, 66)
       移动(83, 66)
       移动(83, 62)
       移动(85, 62)
       移动(85, 51)
       移动(90, 51)
       移动(90, 45)
       等待到指定地图("恩·凯之领域　前厅8", 1)
       

       移动(41, 57)
       移动(55, 57)
       移动(55, 58)
       移动(61, 58)
       移动(61, 55)
       移动(64, 55)
       移动(64, 53)
       
       
       转向(2, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
        
       
       移动(91, 112)
       移动(53, 74)
       移动(44, 83)
       移动(44, 80)
       移动(42, 80)
       
       移动(42, 83)
       移动(41, 83)
       移动(41, 85)
       移动(40, 85)
       移动(40, 94)
       移动(41, 94)
       移动(41, 96)
       移动(44, 96)    
       移动(45, 95)
       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(82, 59)
       移动(115, 92)
       移动(115, 128)
       移动(117, 128)
       
       
       转向(1, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       
       移动(128, 117)
       移动(129, 117)
       移动(129, 116)
       移动(130, 116)
       移动(130, 115)
       移动(131, 115)
       移动(131, 114)
       移动(132, 114)
       移动(132, 113)
       移动(133, 113)
       移动(133, 112)
       移动(134, 112)
       移动(134, 111)
       移动(135, 111)
       移动(135, 110)
       移动(136, 110)
       移动(136, 109)
       移动(137, 109)
       移动(137, 108)
       移动(138, 108)
       移动(138, 107)
       移动(139, 107)
       移动(139, 106)
       移动(140, 106)
       移动(140, 105)
       移动(141, 105)
       移动(141, 104)
       移动(142, 104)
       移动(142, 103)
       移动(143, 103)
       移动(143, 102)
       移动(144, 102)
       移动(144, 101)
       移动(145, 101)
       移动(145, 100)
       移动(146, 100)
       移动(146, 99)
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(147, 99)
       移动(147, 98)
       移动(148, 98)
       移动(148, 97)
       移动(149, 97)
       移动(149, 96)
       移动(150, 96)
       移动(150, 95)
       移动(151, 95)
       移动(151, 93)
       移动(152, 93)
       移动(166, 79)
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       移动(63, 57)
       移动(69, 57)
       移动(69, 52)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       
       
       转向(0, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("神殿　里侧大厅", 1)
       
       goto r2 

::r2::
       等待(1000)
       移动(21, 33)
       移动(21, 30)
       移动(29, 30)
       移动(29, 32)
       移动(32, 32)
       移动(32, 30)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       等待(1000)

       移动(32, 32)
       移动(29, 32)
       移动(29, 30)
       移动(18, 30)
       移动(18, 33)
       移动(17, 33)
       等待到指定地图("精灵之下宫", 1)

       移动(92, 76)
       移动(81, 87)
       等待(2000)
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　玄关8", 1)
       
       
       移动(81, 77)
       移动(81, 66)
       移动(83, 66)
       移动(83, 62)
       移动(85, 62)
       移动(85, 51)
       移动(90, 51)
       移动(90, 45)
       等待到指定地图("恩·凯之领域　前厅8", 1)
       

       移动(41, 57)
       移动(55, 57)
       移动(55, 58)
       移动(61, 58)
       移动(61, 55)
       移动(64, 55)
       移动(64, 53)
       
       
       转向(2, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
        
       
       移动(91, 112)
       移动(53, 74)
       移动(44, 83)
       移动(44, 80)
       移动(42, 80)
       
       移动(42, 83)
       移动(41, 83)
       移动(41, 85)
       移动(40, 85)
       移动(40, 94)
       移动(41, 94)
       移动(41, 96)
       移动(44, 96)    
       移动(45, 95)
       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(82, 59)
       移动(115, 92)
       移动(115, 128)
       移动(117, 128)
       
       
       转向(1, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       
       移动(128, 117)
       移动(129, 117)
       移动(129, 116)
       移动(130, 116)
       移动(130, 115)
       移动(131, 115)
       移动(131, 114)
       移动(132, 114)
       移动(132, 113)
       移动(133, 113)
       移动(133, 112)
       移动(134, 112)
       移动(134, 111)
       移动(135, 111)
       移动(135, 110)
       移动(136, 110)
       移动(136, 109)
       移动(137, 109)
       移动(137, 108)
       移动(138, 108)
       移动(138, 107)
       移动(139, 107)
       移动(139, 106)
       移动(140, 106)
       移动(140, 105)
       移动(141, 105)
       移动(141, 104)
       移动(142, 104)
       移动(142, 103)
       移动(143, 103)
       移动(143, 102)
       移动(144, 102)
       移动(144, 101)
       移动(145, 101)
       移动(145, 100)
       移动(146, 100)
       移动(146, 99)
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(147, 99)
       移动(147, 98)
       移动(148, 98)
       移动(148, 97)
       移动(149, 97)
       移动(149, 96)
       移动(150, 96)
       移动(150, 95)
       移动(151, 95)
       移动(151, 93)
       移动(152, 93)
       移动(166, 79)
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       移动(63, 57)
       移动(69, 57)
       移动(69, 52)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       
       
       转向(0, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("神殿　里侧大厅", 1)
       
       goto r3 

::r3::
       等待(1000)
       移动(21, 33)
       移动(21, 30)
       移动(29, 30)
       移动(29, 32)
       移动(32, 32)
       移动(32, 30)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       等待(1000)

       移动(32, 32)
       移动(29, 32)
       移动(29, 30)
       移动(18, 30)
       移动(18, 33)
       移动(17, 33)
       等待到指定地图("精灵之下宫", 1)

       移动(92, 76)
       移动(81, 87)
       等待(2000)
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　玄关8", 1)
       
       
       移动(81, 77)
       移动(81, 66)
       移动(83, 66)
       移动(83, 62)
       移动(85, 62)
       移动(85, 51)
       移动(90, 51)
       移动(90, 45)
       等待到指定地图("恩·凯之领域　前厅8", 1)
       

       移动(41, 57)
       移动(55, 57)
       移动(55, 58)
       移动(61, 58)
       移动(61, 55)
       移动(64, 55)
       移动(64, 53)
       
       
       转向(2, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       对话选择("4", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
        
       
       移动(91, 112)
       移动(53, 74)
       移动(44, 83)
       移动(44, 80)
       移动(42, 80)
       
       移动(42, 83)
       移动(41, 83)
       移动(41, 85)
       移动(40, 85)
       移动(40, 94)
       移动(41, 94)
       移动(41, 96)
       移动(44, 96)    
       移动(45, 95)
       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(82, 59)
       移动(115, 92)
       移动(115, 128)
       移动(117, 128)
       
       
       转向(1, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       
       移动(128, 117)
       移动(129, 117)
       移动(129, 116)
       移动(130, 116)
       移动(130, 115)
       移动(131, 115)
       移动(131, 114)
       移动(132, 114)
       移动(132, 113)
       移动(133, 113)
       移动(133, 112)
       移动(134, 112)
       移动(134, 111)
       移动(135, 111)
       移动(135, 110)
       移动(136, 110)
       移动(136, 109)
       移动(137, 109)
       移动(137, 108)
       移动(138, 108)
       移动(138, 107)
       移动(139, 107)
       移动(139, 106)
       移动(140, 106)
       移动(140, 105)
       移动(141, 105)
       移动(141, 104)
       移动(142, 104)
       移动(142, 103)
       移动(143, 103)
       移动(143, 102)
       移动(144, 102)
       移动(144, 101)
       移动(145, 101)
       移动(145, 100)
       移动(146, 100)
       移动(146, 99)
       

       等待到指定地图("恩·凯之领域　力之回廊8", 1)
       

       移动(147, 99)
       移动(147, 98)
       移动(148, 98)
       移动(148, 97)
       移动(149, 97)
       移动(149, 96)
       移动(150, 96)
       移动(150, 95)
       移动(151, 95)
       移动(151, 93)
       移动(152, 93)
       移动(166, 79)
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       移动(63, 57)
       移动(69, 57)
       移动(69, 52)
       
       
       转向(0, "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("32", "", "")
       等待服务器返回()
       
       对话选择("4", "", "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       

       等待到指定地图("恩·凯之领域　上宫8", 1)
       

       
       
       转向(0, "")
       等待服务器返回()
       对话选择("1", "", "")
       

       等待到指定地图("神殿　里侧大厅", 1)
       
       goto njr                                     --再次开始循环
       






       
       
       
       