::★探索任务脚本，脚本联系：风星落-QQ::274100927
清除系统消息()

::menu1::
	设置("timer", 100)
	
	
--	补魔值=用户输入框( "多少魔以下去补给", "300")
 --  	补血值=用户输入框( "多少血以下去补给", "500")
  --   	宠补魔值=用户输入框( "宠多少魔以下去补给", "300")
   --  	宠补血值=用户输入框( "宠多少血以下去补给", "700")

	
	等待(500)w
      	
	goto begin 
::begin::
        if(取当前地图名() ==  "艾尔莎岛")then goto   aiersa end  		
	回城()
	goto begin 
::aiersa::
	等待到指定地图("艾尔莎岛", 1)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡", 1)
	等待(500)
	
	移动(30,90)
	移动(34,90)
	移动(34,89)
	回复(1)
	
	
	goto start 	
::start::
	移动(33, 90)
	移动(30, 90)
	移动(30, 83)
	移动(41, 72)
	移动(41, 53)
	
	if(取物品数量("证明信") > 0)then goto chuansong end
	goto beier 	
::beier::	
	
	移动(55, 53)
	移动(55, 25)
	移动(53, 23)
	
	等待(1000)
	
	转向(0, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	if(取物品数量("证明信") > 0)then goto qushalianna end
::qushalianna::
	if(人物("坐标")  ~== "53,23")then	goto  begin end
	移动(55, 25)
	移动(55, 53)
	移动(41, 53)		
	goto chuansong 
::chuansong::
        移动(41, 50)
	
	等待到指定地图("里谢里雅堡 1楼", 1)
	
	等待(1000)
	
        移动(74, 24)
	
        移动(45, 24)
	
        移动(45, 20)
	
	等待到指定地图("启程之间", 1)
	       
	等待(1000)
	
        移动(25,27)
        移动(34,27)
        移动(34,11)
        移动(36,11)
        移动(36,4)
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	goto abanishi 
::abanishi::

	等待到指定地图("阿巴尼斯村的传送点", 1)
	等待(1000)
	
	移动(5, 8)
	移动( 5, 4)

	等待到指定地图("村长的家", 1)
	等待(1000)
	
        移动(6, 9)
	移动(6, 13)
	

	等待到指定地图("村长的家", 1)
	等待(1000)
	

	移动(6, 13)
	

	等待到指定地图("阿巴尼斯村", 1)
	等待(1000)
	

	移动(36, 68)
	移动( 38, 71)

	等待到指定地图("莎莲娜", 1)
	
	等待(1000)
	
        移动(187, 165)
	
	移动(187, 171)	
	
	移动(189, 173)
	
	移动(216, 173)
	
	移动(219, 170)
	
	移动(245, 170)
	
	移动(248, 173)
	
	移动(248, 180)
	
	移动(256, 180)
	
	移动( 258, 180)
        
        等待到指定地图("莎莲娜西方洞窟\z12", 1)
         
	
	等待(1000)
	
        移动(37, 8)
	
	移动(37, 15)
	
	移动(40, 15)
	
        移动(40, 23)
	
	移动(37, 26)
	
	移动(34, 26)
	
	移动(28, 32)
	
	移动(28, 35)
	
	移动(24, 39)
	
	移动(24, 43)
	
	移动(26, 43)
	
	移动(27, 44)		
	
	移动(30, 44)
	
      	等待到指定地图("莎莲娜西方洞窟\z12", 1)
	
	
	等待(1000)
	
        移动(57, 27)
	
	移动(64, 34)
	
        移动(64, 44)
	
	移动(55, 53)
	
	移动(50, 53)
	
	移动(46, 49)
	
	移动(37, 49)
	
	移动(30, 42)
	
	移动(20, 42)
	
	移动(10, 52)
	
	移动(10, 62)
	
	移动(14, 66)
	
	移动(14, 68)
	
	等待(1000)
        等待到指定地图("莎莲娜西方洞窟\z12", 1)
         	
	
	等待(1000)
	
	
	移动(43, 7)
	
	移动(35, 7)
	
	移动(32, 10)
	
	移动(32, 12)
	
	移动(27, 17)
	
	移动(15, 17)
	
	移动(13, 11)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
        等待到指定地图("隐秘山道上层", 1)
	等待(1000)
        
	移动(10, 16)
	
	移动(17, 9)
	
	喊话("已达目的地，请手动穿越迷宫",0,0,0)
	等待(1000)
        等待到指定地图("隐秘山道上层B1", 1)
        
        移动(23,11)
        移动(23,34)
        移动(43,34)
        移动(43,38)
        移动(43,39)
        
        等待到指定地图("隐秘山道上层B2", 1)
        
        移动(13,8)
        移动(40,8)
        移动(41,8)
        
        等待到指定地图("隐秘山道上层B3", 1)
        
        移动(29,26)
        移动(34,26)
        移动(35,26)
        
        等待到指定地图("隐秘山道上层B4", 1)
        
        移动(38,46)
        移动(21,46)
        移动(21,47)
        
        等待到指定地图("隐秘山道上层B5", 1)
        
        移动(40,38)
        移动(40,39)
        
        等待到指定地图("隐秘山道上层B6", 1)
        
        移动(21,11)
        移动(20,11)
        
        等待到指定地图("隐秘山道上层B7", 1)
        
        移动(13,9)
        移动(13,18)
        移动(11,18)
        移动(11,32)
        移动(28,32)
        移动(29,32)
        
        等待到指定地图("隐秘山道中层", 1)
	等待(1000)
        
	移动(8, 11)
        
	移动(8, 4)
	
        等待到指定地图("隐秘山道中层B1", 1)
        
        移动(39,34)
        移动(40,34)
        
        等待到指定地图("隐秘山道中层B2", 1)
        
        移动(33,9)
        移动(34,9)
        移动(35,9)
        
        等待到指定地图("隐秘山道中层B3", 1)
        
        移动(30,32)
        移动(13,32)
        移动(12,32)
        
        等待到指定地图("隐秘山道中层B4", 1)
        
        移动(15,22)
        移动(32,22)
        移动(32,23)
        
        等待到指定地图("隐秘山道中层B5", 1)
        
        移动(17,20)
        移动(17,18)
        移动(17,17)
        
        等待到指定地图("隐秘山道中层B6", 1)
        
        移动(34,27)
        移动(14,27)
        移动(14,25)
        移动(14,24)
        
        等待到指定地图("隐秘山道中层B7", 1)
        
        移动(22,9)
        移动(23,9)
        
        等待到指定地图("隐秘山道下层", 1)
	等待(1000)
        
	移动(17, 10)
        
	移动(16, 10)
	
	移动(15, 10)
        等待到指定地图("隐秘山道下层B1", 1)
        
        移动(42,27)
        移动(16,27)
        移动(16,28)
        
        等待到指定地图("隐秘山道下层B2", 1)
        
        移动(14,18)
        移动(14,40)
        移动(13,40)
        
        等待到指定地图("隐秘山道下层B3", 1)
        
        移动(16,6)
        移动(16,30)
        移动(31,30)
        移动(31,12)
        移动(31,11)
        
        等待到指定地图("隐秘山道下层B4", 1)
        
        移动(33,37)
        移动(33,34)
        移动(33,33)
        
        等待到指定地图("隐秘山道下层B5", 1)
        
        移动(17,17)
        移动(37,17)
        移动(38,17)
        
        等待到指定地图("隐秘山道下层B6", 1)
        
        移动(12,45)
        移动(12,41)
        移动(12,40)
        
        等待到指定地图("隐秘山道下层B7", 1)
        
        移动(27,16)
        移动(17,16)
        移动(17,12)
        移动(12,12)
        移动(12,11)
        移动(12,10)
        
        等待到指定地图("山道尽头", 1)
	等待(1000)
        
	移动(13, 15)
        
	移动(13, 6)
	
        
        转向(8, )
        等待服务器返回()
        对话选择(4, , )
        等待到指定地图("莎莲娜", 1)
        
	goto begin 