★定居艾岛；支持法兰，可设置自动更换装备；自己设置丢不要的卡，新城支持存宝石鼠铜奖，银行满以后丢弃★坐标180秒未变重启	★脚本联系：风星落-QQ:274100927



设置("自动捡",1)
设置("跟随捡物",1)
设置("自动捡",1,"金币")
设置("自动捡",1,"小护士家庭号")
设置("自动捡",1,"魔力之泉")
设置("自动捡",1,"火焰鼠闪卡「D4奖」")
设置("自动捡",1,"火焰鼠闪卡「C4奖」")
设置("自动捡",1,"火焰鼠闪卡「D2奖」")
设置("自动叠",1,"小护士家庭号&10")
设置("自动叠",1,"魔力之泉&10")

local 捡物列表={"小护士家庭号","火焰鼠闪卡「C1奖」"
	,"火焰鼠闪卡「C2奖」","火焰鼠闪卡「C3奖」","火焰鼠闪卡「C4奖」","火焰鼠闪卡「D1奖」","火焰鼠闪卡「D2奖」",
	"火焰鼠闪卡「D3奖」","火焰鼠闪卡「D4奖」","宝石鼠银奖","宝石鼠金奖","魔力之泉","火焰鼠闪卡「B1奖」",
	"火焰鼠闪卡「B2奖」","火焰鼠闪卡「B3奖」","火焰鼠闪卡「B4奖」","火焰鼠闪卡「A4奖」","火焰鼠闪卡「A3奖」",
	"火焰鼠闪卡「A2奖」","火焰鼠闪卡「A1奖」","宝石鼠月亮奖","宝石鼠钻石奖","海洋之心","火焰之魂","天空之枪",
	"帕鲁凯斯之斧","村正","鼠王","金币"}
function 多余箱子扔和开()
	local tmpCount=包裹箱子数量()
	if(tmpCount < 1)then
		return
	elseif(tmpCount == 1)then
		循环开箱子()
		if(包裹箱子数量()==1)then
			循环开箱子()		
		end
		return
	end
::begin::
	--再捡起来开
	for i,v in ipairs(boxList) do
		mapUnit=查周围信息(v,0)
		while mapUnit ~= nil do
			移动到目标附近(mapUnit.x,mapUnit.y)
			转向坐标(mapUnit.x,mapUnit.y)
			等待(2000)
			循环开箱子()
			mapUnit=查周围信息(v,0)
		end	
	end	
end
