--aimar刷花签脚本 需要定居在去风洞那个传送点
设置("timer", 100)						
停止遇敌()

设置("自动战斗", 1)				
设置("高速战斗", 4)			
设置("高速延时", 6)			







设置("timer", 250)


回城()

等待到指定地图("艾尔莎岛", 1)

::begin::

移动(134, 111)
移动(126, 103)
移动(112, 103)
等待到指定地图("温迪尔平原", 1)
移动(233, 108)
移动(222, 97)
移动(212, 97)
移动(212, 77)
移动(184, 77)
移动(184, 70)
移动(178, 70)
移动(175, 73)
移动(175, 103)
移动(187, 103)
移动(187, 118)
移动(194, 118)
移动(194, 146)
移动(197, 146)
移动(197, 147)
移动(199, 147)
移动(199, 150)
移动(201, 152)
移动(204, 152)
移动(204, 154)
移动(208, 154)
移动(208, 157)
移动(217, 166)
移动(213, 170)
移动(213, 171)
移动(211, 173)
移动(200, 173)
移动(187, 160)
移动(167, 160)
移动(160, 153)

移动(156, 153)
移动(156, 152)
移动(150, 146)
移动(150, 131)
移动(139, 131)
::8888::        

	转向(0, "")
	等待服务器返回()	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("4", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
        等待服务器返回()
        
	对话选择("1", "", "")
        等待服务器返回()
        
	对话选择("1", "", "")
        
移动(139, 149)
移动(141, 149)
移动(141, 164)
移动(145, 164)
移动(145, 173)
移动(152, 173)
移动(152, 178)
移动(155, 178)


	转向(2, "")
	等待服务器返回()	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("1", "", "")
        

移动(152, 178)
移动(152, 173)
移动(145, 173)
移动(145, 164)
移动(141, 164)
移动(141, 148)
移动(116, 148)
移动(115, 149)
 
	转向(0, "")
	等待服务器返回()	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
	
	
	对话选择("1", "", "")
        

移动(133, 149)
移动(133, 148)
移动(142, 148)
移动(142, 152)
移动(142, 154)

	转向(0, "")
	等待服务器返回()
        chat("岁月不饶人", "5", "1", "0")
	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
       
        对话选择("1", "", "")
        
	

移动(142, 154)
移动(142, 152)
移动(142, 148)
移动(133, 148)
移动(133, 149)
移动(115, 149)

 
	转向(0, "")
	等待服务器返回()
        chat("我不相信你", "5", "1", "0")
	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
       
	
	对话选择("1", "", "")
        



移动(133, 149)

移动(133, 148)
移动(139, 148)

移动(139, 149)
移动(141, 149)
移动(141, 164)
移动(145, 164)
移动(145, 173)
移动(152, 173)
移动(152, 178)
移动(155, 178)

	转向(2, "")
	等待服务器返回()
        chat("不要欺负我", "5", "1", "0")
	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("1", "", "")
        

移动(155, 178)
移动(152, 178)
移动(152, 173)
移动(145, 173)
移动(145, 164)
移动(141, 164)

移动(141, 149)
移动(139, 149)
移动(139, 131)

 
	转向(0, "")
	等待服务器返回()
        chat("你很冷淡", "5", "1", "0")
	
	
        对话选择("32", "", "")
        等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("1", "", "")
        goto 8888 