全程自动跑猫，要求定居新城，带高血防护卫宠护卫自己，全程设置逃跑
设置("timer", 100)				

::kaishi::
回城()
等待到指定地图("艾尔莎岛", 1)
等待(200)

if(取物品数量("塞特的护身符") > 0)then goto  saite end
if(取物品数量("梅雅的护身符") > 0)then goto  meiya end
if(取物品数量("提斯的护身符") > 0)then goto  tisi end
if(取物品数量("伍斯的护身符") > 0)then goto  wusi end
if(取物品数量("尼斯的护身符") > 0)then goto  nisi end
移动(140, 126)
移动(165, 151)
移动(165, 153)


转向(4, "")
等待服务器返回()

对话选择("32", "", "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("利夏岛", 1)

等待(200)

移动(93, 64)
移动(90, 67)
移动(90, 98)

移动( 90, 99)


等待到指定地图("国民会馆", 1)

等待(200)

移动(100, 50)
移动(104, 54)
移动(108, 54)

回复(1)


等待(600)

移动(104, 54)
移动(104, 46)
移动(108, 42)
移动(108, 39)


等待到指定地图("雪拉威森塔１层", 1)

等待(300)

移动(37, 99)
等待(200)

移动(42, 99)
移动(46, 95)
移动(54, 87)
移动(62, 79)
移动(67, 74)
移动(72, 74)
移动(72, 69)
移动(72, 63)
移动(74, 61)
移动(74, 52)
移动(75, 51)

移动(75, 50)

等待到指定地图("雪拉威森塔５０层", 1)

等待(200)

移动(74, 56)
移动(74, 47)
移动(16, 47)
移动(16, 46)
等待(200)

移动(16, 44)

等待到指定地图("雪拉威森塔９５层", 1)

等待(600)

移动(101, 51)
移动(109, 51)
移动(109, 63)
移动(95, 63)
移动(94, 64)
移动(81, 64)
移动(81, 76)
移动(49, 76)
移动(49, 88)
移动(57, 88)
移动(57, 100)
移动(49, 100)
移动(49, 92)
移动(45, 92)
移动(45, 88)
移动(41, 88)
移动(41, 94)
移动(33, 102)
移动(33, 112)
移动(45, 112)
移动(45, 125)
移动(33, 125)
移动(33, 120)
移动(26, 120)
移动(26, 116)
移动(28, 116)
移动(28, 112)
移动(26, 112)
移动(26, 104)
移动(27, 104)

等待(200)


转向(2, "")
等待服务器返回()

对话选择("32", "", "")

对话选择("4", "", "")

对话选择("32", "", "")
等待服务器返回()
对话选择("1", "", "")


等待到指定地图("雪拉威森塔９６层", 1)

等待(200)

回城()

等待到指定地图("艾尔莎岛", 1)



转向(1, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("里谢里雅堡", 1)

等待(200)


移动(30, 82)
移动(30, 90)
移动(33, 90)
移动(34, 89)


回复(1)


::saite::

使用物品("塞特的护身符")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("雪拉威森塔９５层", 1)

等待(200)


转向(2, "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("雪拉威森塔９６层", 1)

等待(200)

移动(30, 105)
移动(28, 105)
移动(25, 108)
移动(19, 108)
移动(19, 112)
移动(27, 112)
移动(27, 120)
移动(30, 120)
移动(30, 113)
移动(38, 113)
移动(38, 101)
移动(46, 101)
移动(46, 113)
移动(54, 113)
移动(54, 89)
移动(50, 89)
移动(50, 76)
移动(53, 76)
移动(53, 68)
移动(51, 68)
移动(51, 64)
移动(53, 64)
移动(57, 60)
移动(63, 60)
移动(63, 65)
移动(86, 65)
移动(86, 84)
移动(92, 84)
移动(92, 77)
移动(114, 77)
移动(114, 97)
移动(99, 97)
移动(99, 100)
移动(103, 100)
移动(103, 105)
移动(99, 105)
移动(99, 108)
移动(102, 108)
移动(102, 127)
移动(87, 142)
移动(87, 145)
移动(66, 145)
移动(66, 129)
移动(78, 129)
移动(78, 118)
移动(82, 118)
移动(82, 120)
移动(86, 120)
移动(87, 119)

等待(200)


转向(1, "")
等待服务器返回()

对话选择("32", "", "")

对话选择("32", "", "")

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")


等待到指定地图("雪拉威森塔９７层", 1)

等待(200)

回城()

等待到指定地图("艾尔莎岛", 1)

等待(200)



转向(1, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("里谢里雅堡", 1)

等待(200)


移动(30, 82)
移动(30, 90)
移动(33, 90)
移动(34, 89)


回复(1)


::meiya::

使用物品("梅雅的护身符")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("雪拉威森塔９６层", 1)

等待(200)


转向(2, "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("雪拉威森塔９７层", 1)

等待(200)

移动(90, 119)
移动(106, 119)
移动(106, 103)
移动(118, 103)
移动(118, 97)
移动(124, 91)
移动(130, 91)
移动(130, 102)
移动(134, 106)
移动(134, 111)
移动(126, 111)
移动(126, 127)
移动(134, 127)
移动(134, 143)
移动(127, 143)
移动(127, 150)
移动(115, 150)
移动(115, 147)
移动(121, 147)
移动(121, 143)
移动(115, 143)
移动(115, 139)
移动(126, 139)
移动(126, 135)
移动(86, 135)
移动(86, 131)
移动(112, 131)
移动(117, 126)

等待(200)


转向(8, "")
等待服务器返回()

对话选择("32", "", "")

对话选择("32", "", "")

对话选择("32", "", "")

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")


等待到指定地图("雪拉威森塔９８层", 1)

等待(200)

回城()

等待到指定地图("艾尔莎岛", 1)

等待(200)



转向(1, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("里谢里雅堡", 1)

等待(200)


移动(30, 82)
移动(30, 90)
移动(33, 90)
移动(34, 89)


回复(1)


::tisi::

使用物品("提斯的护身符")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("雪拉威森塔９７层", 1)

等待(200)


转向(2, "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("雪拉威森塔９８层", 1)

等待(200)

移动(120, 88)
移动(116, 88)
移动(116, 105)
移动(83, 105)
移动(83, 104)
移动(76, 104)
移动(75, 105)
移动(72, 105)
移动(68, 101)
移动(68, 93)
移动(72, 89)
移动(96, 89)
移动(100, 85)
移动(100, 73)
移动(129, 73)
移动(132, 70)
移动(132, 59)
移动(130, 57)
移动(120, 57)
移动(116, 53)
移动(116, 44)
移动(113, 41)
移动(104, 41)
移动(96, 33)
移动(90, 33)
移动(85, 38)
移动(85, 49)
移动(84, 50)
移动(84, 57)
移动(72, 57)
移动(69, 60)
移动(69, 70)
移动(66, 73)
移动(52, 73)
移动(52, 84)
移动(47, 89)
移动(36, 89)
移动(32, 93)
移动(32, 100)
移动(37, 105)
移动(49, 105)
移动(52, 108)
移动(52, 117)
移动(56, 121)
移动(56, 125)
移动(68, 125)
移动(72, 121)
移动(72, 117)
移动(85, 117)
移动(89, 121)
移动(99, 121)
移动(99, 126)
移动(100, 127)
移动(100, 132)
移动(95, 137)
移动(73, 137)
移动(69, 141)
移动(69, 149)
移动(87, 149)
移动(87, 153)
移动(97, 153)
移动(100, 156)
移动(100, 165)
移动(112, 165)
移动(112, 153)
移动(116, 149)
移动(116, 141)
移动(120, 137)
移动(134, 137)
移动(138, 133)
移动(144, 133)
移动(144, 124)
移动(148, 120)
移动(148, 88)
移动(145, 88)
移动(144, 89)
移动(132, 89)
移动(132, 119)
移动(126, 125)
移动(120, 125)
移动(120, 121)

等待(200)


转向(8, "")
等待服务器返回()

对话选择("32", "", "")

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")


等待到指定地图("雪拉威森塔９９层", 1)

等待(200)

回城()

等待到指定地图("艾尔莎岛", 1)

等待(200)



转向(1, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("里谢里雅堡", 1)

等待(200)


移动(30, 82)
移动(30, 90)
移动(33, 90)
移动(34, 89)


回复(1)


::wusi::

使用物品("伍斯的护身符")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("雪拉威森塔９８层", 1)

等待(200)


转向(8, "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("雪拉威森塔９９层", 1)

等待(200)

移动(113, 118)
移动(113, 113)
移动(119, 113)
移动(119, 109)
移动(108, 109)
移动(108, 121)
移动(104, 121)
移动(104, 109)
移动(100, 109)
移动(100, 105)
移动(108, 105)
移动(108, 89)
移动(104, 89)
移动(104, 101)
移动(100, 101)
移动(100, 85)
移动(88, 85)
移动(88, 89)
移动(96, 89)
移动(96, 93)
移动(84, 93)
移动(84, 109)
移动(96, 109)
移动(96, 113)
移动(100, 113)
移动(100, 121)
移动(96, 121)
移动(96, 117)
移动(92, 117)
移动(92, 125)
移动(88, 125)
移动(88, 117)
移动(81, 117)
移动(81, 121)
移动(70, 121)
移动(69, 120)
移动(67, 120)
移动(66, 121)
移动(57, 121)
移动(52, 116)
移动(52, 105)
移动(38, 105)
移动(36, 103)
移动(36, 94)
移动(40, 90)
移动(41, 90)
移动(41, 89)
移动(51, 89)
移动(51, 84)
移动(52, 84)
移动(52, 79)
移动(57, 74)
移动(57, 73)
移动(62, 73)
移动(66, 69)
移动(68, 69)
移动(68, 62)
移动(73, 57)
移动(99, 57)
移动(101, 55)

等待(200)


转向(1, "")
等待服务器返回()
对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")


等待到指定地图("雪拉威森塔最上层", 1)

等待(200)

回城()

等待到指定地图("艾尔莎岛", 1)

等待(200)



转向(1, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("里谢里雅堡", 1)

等待(200)


移动(30, 82)
移动(30, 90)
移动(33, 90)
移动(34, 89)


回复(1)


::nisi::

使用物品("尼斯的护身符")
等待服务器返回()
对话选择("4", "", "")

等待到指定地图("雪拉威森塔９９层", 1)

等待(200)


转向(2, "")
等待服务器返回()
对话选择("1", "", "")

等待到指定地图("雪拉威森塔最上层", 1)

等待(200)

移动(104, 53)
移动(100, 53)
移动(100, 33)
移动(96, 33)
移动(96, 45)
移动(92, 45)
移动(92, 37)
移动(84, 37)
移动(84, 69)
移动(80, 69)
移动(80, 53)
移动(76, 53)
移动(76, 65)
移动(72, 65)
移动(72, 53)
移动(68, 53)
移动(68, 70)
移动(69, 70)
移动(69, 81)
移动(68, 82)
移动(68, 85)
移动(72, 89)
移动(83, 89)
移动(83, 88)
移动(85, 88)
移动(85, 89)
移动(96, 89)
移动(100, 85)
移动(100, 77)
移动(104, 73)
移动(112, 73)
移动(116, 69)
移动(116, 62)
移动(121, 57)
移动(132, 57)
移动(132, 87)
移动(130, 89)
移动(120, 89)
移动(116, 93)
移动(116, 103)
移动(114, 105)
移动(103, 105)
移动(103, 104)
移动(101, 104)
移动(101, 105)
移动(87, 105)
移动(87, 104)
移动(85, 104)
移动(85, 105)
移动(52, 105)
移动(52, 92)
移动(49, 89)
移动(36, 89)
移动(36, 107)
移动(40, 107)
移动(40, 117)
移动(52, 117)
移动(56, 121)
移动(56, 124)
移动(70, 124)
移动(73, 121)
移动(132, 121)
移动(132, 109)
移动(136, 105)
移动(144, 105)
移动(148, 101)
移动(148, 93)
移动(152, 89)
移动(164, 89)
移动(164, 105)
移动(160, 109)
移动(160, 117)
移动(145, 117)
移动(145, 132)
移动(134, 132)
移动(129, 137)
移动(120, 137)
移动(116, 141)
移动(116, 154)
移动(112, 158)
移动(112, 164)
移动(100, 164)
移动(100, 139)
移动(103, 136)
移动(103, 134)

等待到指定地图("雪拉威森塔前庭", 1)

等待(200)

移动(101, 21)
移动(103, 19)

等待(300)
::wanguan::
等待(300)

喊话("男",0v2,03,04)
等待服务器返回()
对话选择("1", "", "")
goto dengdai 

::dengdai::
等待到指定地图("国民会馆", 1)

等待(200)
if(取物品数量("王冠") > 0)then goto  qucun end

goto kaishi 


::qucun::
   回城()
   等待到指定地图("艾尔莎岛", 1)
   等待(500)
   
   移动(146, 105)
   移动(157, 94)
   转向(1, "")
   
   等待到指定地图("艾夏岛", 1)
   等待(200)
   
   移动(88, 112)
   移动(94, 118)
   移动(101, 118)
   移动(114, 105)
   移动(114, 104)
   
   等待到指定地图("银行", 1)
   等待(200)
   
   移动(27, 25)
   移动(49, 25)
   
::cun::
   等待(200)
   
   转向(2, "")
   等待服务器返回()
   对话选择("存条", "王冠", "")
   
   等待(500)
   
   goto kaishi 