脚本支持发蓝和艾尔莎岛启动，支持传送羽毛，请设置好自动战斗,谢谢支持魔力辅助程序


补魔值 = 50--用户输入框("多少魔以下补魔", "50")
补血值=430--用户输入框("多少血以下补血", "430")
宠补血值=50--用户输入框( "宠多少血以下补血", "50")
宠补魔值=100--用户输入框( "宠多少魔以下补血", "100")
迷宫最后入口坐标={}
护士所在坐标={}
迷宫是否已刷新=1
开箱子数量=0
function 开箱子(宝箱信息)
	移动到目标附近(宝箱信息.x,宝箱信息.y)
	转向坐标(宝箱信息.x,宝箱信息.y)
	--使用物品("黑钥匙")
	--使用物品("白钥匙")
	使用物品("铜钥匙")
	等待(1000)
	等待空闲()
	开箱子数量=开箱子数量+1
	喊话("已开箱子数："..开箱子数量,2,3,5)
end
function main()
::begin::
	当前地图名 = 取当前地图名()
	x,y=取当前坐标()	
	地图编号=取当前地图编号()	
	if (当前地图名=="艾尔莎岛" )then	
		goto  aiersa  
	elseif (当前地图名=="里谢里雅堡" )then	
		goto  libao  	
	elseif (string.find(当前地图名,"奇怪的洞窟" ) ~= nil)then			
		goto  开始找箱子  					
	elseif(当前地图名=="芙蕾雅") then
		goto  fuleiya
	elseif(当前地图名=="亚留特村") then
		goto  去狗洞
	-- elseif(当前地图名=="客房" and x==8 and y==3)then
		-- goto 买钥匙
	elseif (x==72 and y==123 )then	-- 西2登录点
		goto  w2
	elseif (x==233 and y==78 )then	-- 东2登录点
		goto  e2
	elseif (x==162 and y==130 )then	-- 南2登录点
		goto  s2
	elseif (x==63 and y==79 )then	-- 西1登录点
		goto  w1
	elseif (x==242 and y==100 )then	-- 东1登录点
		goto  e1
	elseif (x==141 and y==148 )then	-- 南1登录点
		goto  s1
	end	
	--回城()
	等待(1000)
	goto  begin



::aiersa::
	等待到指定地图("艾尔莎岛")			
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)	
::libao::
	等待到指定地图("里谢里雅堡")
	移动(27,90)
	移动(34,90)
	移动(34,89)
	回复(1)	
	
	移动(33,90)
	移动(31,90)
	移动(31,83)
	移动(41,73)
	移动(41,51)
	移动(41,50)
	
	goto  yabao1

::yabao1::
	等待到指定地图("里谢里雅堡 1楼")	
	移动(74,30)
	移动(68,24)
	移动(49,24)
	移动(45,20)
	等待到指定地图("启程之间")
	移动(43, 23)		
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)
	goto  yacun

::s2::	-- 南2登录点
	等待到指定地图("法兰城",162, 130)
	
	移动(153,130)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::w1::	-- 西1登录点
	转向(0)		-- 转向北
	
	等待到指定地图("法兰城", 242, 100)
	
	转向(2)		-- 转向东
	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)
	
	转向(0)		-- 转向北
	
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::e1::	-- 东1登录点
	转向(2)		-- 转向东
	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)
	
	转向(0)		-- 转向北
	
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::e2::	-- 东2登录点
	转向(0)		-- 转向北
	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)
	
	转向(0)		-- 转向北
	
	等待到指定地图("法兰城", 162, 130)
	
	移动(153,130)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::w2::	-- 西2登录点
	转向(2)			-- 转向东
	
	等待到指定地图("法兰城",233,78)
	
	转向(0)		-- 转向北
	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)
	
	转向(0)		-- 转向北
	
	等待到指定地图("法兰城", 162, 130)
	
	移动(153,130)
	移动(153,101)
	移动(153,100)
	
	goto  yabao

::yabao::
	等待到指定地图("里谢里雅堡")
	
	移动(41,84)
	移动(31,84)
	移动(31,90)
	移动(34,90)
	移动(34,89)
	回复(1)	
	移动(33,90)
	移动(31,90)
	移动(31,83)
	移动(41,73)
	移动(41,51)
	移动( 41,50)	
	goto  yabao1
	
::yacun::
	等待到指定地图("亚留特村的传送点", 5,15)
	移动(8, 3)
	等待到指定地图("村长的家", 22,9)
	移动(6, 13)
	等待到指定地图("亚留特村", 56,48)
::去狗洞::
	移动(58, 31)
	等待到指定地图("芙蕾雅")
	移动(520, 15)
::fuleiya::	
	找迷宫= 搜索范围迷宫(520, 15, 40, 40,"549,43;")
	if(找迷宫) then				
		goto  狗洞
	end	
	等待(2000)
	if(取当前地图名() == "奇怪的洞窟地下1楼") then
		goto  狗洞
	end		
	goto  fuleiya
::狗洞::
--	等待到指定地图("奇怪的洞窟地下1楼")	
	if(取当前地图名() == "奇怪的洞窟地下1楼") then				
		goto  开始找箱子			
	end		
	等待(2000)
	goto  fuleiya





::开始找箱子::	
	if(是否空闲中()==false)then
		等待(2000)
		goto 开始找箱子
	end		
	-- if(string.find(最新系统消息(),"本船已到达了哥拉尔港")~=nil)then
		-- goto xia
	-- end
	-- if(取当前地图名()=="芙蕾雅") then--迷宫刷新
		-- goto begin
	-- end
	下载地图()
	x,y=取当前坐标()	
	nx,ny=取下层坐标()--默认拿离自己最远坐标 
	if(x==nx and y == ny)then	--到最顶层 或地图错误
		goto begin
	end
	找到宝箱=查周围信息("宝箱",0)
	if(找到宝箱 ~= nil) then	--找到目标
		开箱子(找到宝箱)
	end
	searchMazePath = 取搜索路径(nx,ny)
	for k,v in pairs(searchMazePath) do
		print(k,v,v.x,v.y)
        移动(v.x,v.y)
		找到宝箱=查周围信息("宝箱",0)
		while (找到宝箱 ~= nil) do --找到目标
			开箱子(找到宝箱)
			找到宝箱=查周围信息("宝箱",0)
		end		
	end
	移动(nx,ny)
	等待(2000)
	goto 开始找箱子

::去买钥匙::
	移动(102,131)
	等待到指定地图("安其摩酒吧", 16,23)
	移动(19,6)
	等待到指定地图("酒吧里面", 17,7)
	移动(21,1)
	等待到指定地图("客房", 7,11)
	移动(8,3)
	
::买钥匙::	
	转向(0)	
	喊话("头目万岁",2,3,5)
	等待服务器返回()	
	对话选择(4, 0)		
	if(取物品叠加数量("铜钥匙") >= 100)then
		goto begin
	end
	goto 买钥匙
end
main()