★树精队长脚本，起点艾尔莎岛登入点，根据提示执行脚本。


卖店物品列表="魔石|卡片？|锹型虫的卡片|水晶怪的卡片|哥布林的卡片|红帽哥布林的卡片|迷你蝙蝠的卡片|绿色口臭鬼的卡片|锥形水晶"		--可以增加多个 不影响速度

设置("遇敌全跑",1)
::menu1::
	goto menu2 
::menu2::
				
	清除系统消息()
    喊话("树精脚本!",0,0,0)
	等待(1000)      	
	goto begin 
::begin::	
	等待空闲()
	if(取当前地图名() ==  "艾尔莎岛")then goto  aiersa end
	if(取当前地图名() ==  "里谢里雅堡")then goto start end
	if(取当前地图名() ==  "维诺亚村")then goto weiCun end
	if(取当前地图名() ==  "维诺亚村的传送点")then goto quyiyuan end
	if(取当前地图名() ==  "医院")then goto qudashu end
	if(取当前地图名() ==  "叹息之森林")then goto dashujing end
	if(取当前地图名() ==  "叹息森林")then goto naShuMiao end--15508
	if(取当前地图名() ==  "启程之间")then goto warproom end--15508
	if(string.find(取当前地图名(),"布满青苔的洞窟")~= nil)then goto wancheng end
	goto begin 
::aiersa::
	等待到指定地图("艾尔莎岛")	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡")	
	
	goto start        
::start::	
	if(取物品数量("树苗？") > 0)then
		移动(65,53,"法兰城")
		移动(196,78,"凯蒂夫人的店")
		移动(15,12)
		商店鉴定(16,12,"树苗？")	
		if(取物品数量("生命之花") > 0)then
			回城()
			goto begin
		end
	end			
	移动(34, 88)
	回复(2)			-- 转向北边恢复人宠血魔		
	移动(31,77)			
	卖(6,卖店物品列表)	
	移动(41, 50)
	等待到指定地图("里谢里雅堡 1楼")
	移动(45, 20)
::warproom::
	等待到指定地图("启程之间")	
	移动(8, 23)	
	转向(0, "")
	dlg=等待服务器返回()
	if(dlg~=nil and string.find(dlg.message,"此传送点的资格")~=nil)then
		执行脚本("./脚本/直通车/★开传送-维诺亚村.lua")
		goto quyiyuan
	end
	对话选择("4", "", "")	
	goto begin 
::quyiyuan:: 
	等待到指定地图("维诺亚村的传送点")		
	移动(4,4)	
	等待(1500)	
	移动( 5, 1)
	等待到指定地图("村长家的小房间")		
	移动( 0, 5)	
::wryczj::
	等待到指定地图("村长的家")	
	if(取物品数量("生命之花") > 0)then
		移动(15, 8)
		对话选是(16,7)
		if(取物品数量("生命之花") <1)then
			日志("递交生命之花完成，可以提升阶级了！")
			回城()
			return
		else
			goto wryczj
		end
	end
	移动(10, 16)
::weiCun::
	等待到指定地图("维诺亚村")	
	if(取物品数量("火把") > 0) then
		goto qudashu
	end
	移动(60, 53)	
	移动(61, 53)	
	等待到指定地图("医院")	
	移动(6, 5)		
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	喊话("人工检查下是否有火把!",0,0,0)	
	goto begin 
::qudashu::	
	移动( 2, 9,"维诺亚村")			
	移动(67, 46,"芙蕾雅")		
	移动(380, 353,"布满青苔的洞窟1楼")	
::wancheng::
	
	自动穿越迷宫("叹息之森林")
	等待(3000)
	goto begin 
::dashujing::	
	设置("遇敌全跑",0)
	移动(29, 16)	
	喊话("1转晋级移动脚本到此结束，请手动打树精",0,0,0)
	移动(29, 12)
	转向坐标(29,13)
	等待(3000)
	goto begin 
::naShuMiao::
	移动(27, 12)	
	扔("艾里克的大剑")
	对话选是(26,12)
	if(取物品数量("树苗？") > 0) then
		日志("1转树精长老任务完成，返回")
		回城()
		goto begin
	end