要求求二转封印，盟约8及可/脚本支持法蓝和艾尔莎岛，灵堂，黑白记忆启动，支持传送羽毛，请设置好自动战斗,战斗1中设置好遇一级宠时的战斗方法 ::战斗2设置好宠物满下线保护，谢谢支持魔力辅助程序.脚本发现BUG联系Q::::274100927-----------星落,谢谢支持魔力辅助程序.脚本发现BUG联系QQ::274100927-----------星落


设置("timer", 300)						

set("高速遇敌",1)
				-- 自动遇敌
设置("自动战斗",1)
设置("高速战斗", 1)
设置("高速延时",1)
		--原地遇敌      
人补魔=用户输入框( "人多少魔以下补魔", "50")
人补血=用户输入框( "人多少血以下补血", "300")
宠补魔=用户输入框( "宠多少魔以下补魔", "50")
宠补血=用户输入框( "宠多少血以下补血", "200")	
InputVal("自动换风地的水晶耐久值", "多少耐久以下自动换风地的水晶,不换可不填", "30") 			




::begin::
        if(取当前地图名() ==  "民家")then goto  ming end
        回城()
	等待(2000)
	if(人物("坐标")  == "15,6")then	goto  lingtang end
        if(取当前地图名() ==  "艾尔莎岛")then goto  aidao end
        if(人物("坐标")  == "99,165")then	goto  jiyi end
        if(人物("坐标")  == "120,107")then	goto  jiyi end
	if(人物("坐标")  == "72,123")then	goto  w2 end
	if(人物("坐标")  == "233,78")then	goto  e2 end
	if(人物("坐标")  == "162,130")then	goto  s2 end
	if(人物("坐标")  == "63,79")then	goto  w1 end
	if(人物("坐标")  == "242,100")then	goto  e1 end
	if(人物("坐标")  == "141,148")then	goto  s1 end
	
	
	
	等待(2000)
	goto begin 



::jiyi::
	if(取物品数量("黑之记忆") > 0)then goto  hei end
	if(取物品数量("白之记忆") > 0)then goto  bai end
	goto jiyi 

::hei::
	
	使用物品("黑之记忆")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("黑之祭坛\\z7", 1)
	
	移动(23, 18)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("召唤之间\\z5", 1)
	
	
	移动(7,14)
	移动(7,15)
	移动(3,15)
        移动(3,8)
	移动( 3, 7)
	
	等待到指定地图("里谢里雅堡", 1)
	
	goto 00 

::bai::
	
	使用物品("白之记忆")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("白之祭坛\", 1)
	
	移动(22, 26)
	
	
	转向(5, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("召唤之间\\z5", 1)
	
::lingtang::
	移动(7,14)
	移动(7,15)
	移动(3,15)
        移动(3,8)
	移动( 3, 7)
	
	
	等待到指定地图("里谢里雅堡", 1)
	

::00::
	等待到指定地图("里谢里雅堡", 47, 85)
	移动(47, 90)
	移动(51,90)
	移动(51,93)
	移动(41,93)
	移动(41,82)	
	goto jixu 



::w2::	-- 西2登录点
	转向(2, "")		-- 转向东
	
	等待到指定地图("法兰城",233,78)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 162, 130)
	
	移动(153,130)
	goto begin_1 			

::e2::	-- 东2登录点
	转向(0, "")		-- 转向北
	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 162, 130)
	
	移动(153,130)
	goto begin_1 			

::s2::	-- 南2登录点
	等待到指定地图("法兰城", 162, 130)
	
	移动(153,130)
	goto begin_1 			

::w1::	-- 西1登录点
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 242, 100)
	
	转向(2, "")		-- 转向东
	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,130)
	goto begin_1 				

::e1::	-- 东1登录点
	转向(2, "")		-- 转向东
	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,130)
	goto begin_1 				

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)
	
	移动(153,148)
	移动(153,130)
	goto begin_1 				

::begin_1::
	移动(153, 105)
	移动(153, 101)
	
	移动( 153, 100)
	
	等待到指定地图("里谢里雅堡", 1)

	移动(41,82)
	goto goto2 


::aidao::
	
	移动(140,105)
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("里谢里雅堡", 1)
	
	
	
	移动(31,82)
	移动(31,90)
	移动(34,90)
	移动(34,90)
	移动(34,87)
	移动(34,89)
	回复(1)			-- 转向北边恢复人宠血魔
	
	等待(15000)
        移动(34,90)
	移动(31, 90)
        移动(31, 80)
        移动(41, 80)
	
	

	
::jixu::
	移动(41, 82)
	移动(41, 69)
	移动(41, 53)
	if(取物品数量("风地的水晶（5：5）") < 1)then goto  maika end
	
	移动(41, 50)
	
	等待到指定地图("里谢里雅堡 1楼", 1)
	
        移动(74, 24)
	
        移动(45, 24)
	
        移动(45, 20)
	
	等待到指定地图("启程之间", 1)
	
	移动(25, 27)
	if(取物品数量("封印卡（金属系）") > 2)then goto  acun end
	移动(17, 27)
	移动(17, 13)
	移动(14, 10)
	移动(14, 6)
	移动(15, 5)
        
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	goto csghdcz 

::csghdcz::
	等待到指定地图("杰诺瓦镇的传送点", 1)
	
        移动(7, 8)
	移动(13, 8)
	移动( 14, 6)
        
	等待到指定地图("村长的家", 1)
	
        移动(13, 8)
	移动(4, 8)
	移动( 1, 9)

        等待到指定地图("杰诺瓦镇", 1)
        
	移动(43, 43)
	移动( 43, 23)
        等待到指定地图("杂货店", 1)
	
	移动(9, 12)
	移动(11,12)
	
	转向(2, "")                 
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "5\z50", "")  
	
	叠("封印卡（金属系）",20）
	
	叠(""封印卡（金属系）",20）
	
	moveres("封印卡（金属系）""),20）
	
	goto begin 

::acun::
 	
	移动(29, 27)
	移动(34, 22)
	移动(34, 12)
	移动(36, 10)
	移动(36, 5)
	移动(37, 4)
	
	等待到指定地图("启程之间", 37,4)
	
	if(取物品数量( "传送石优待卷") >  0)then goto  aaa end	
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	goto ylt 
::aaa::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	

::ylt::


	等待到指定地图("阿巴尼斯村的传送点", 1)
	
	移动(5,5)
	移动(5, 4)
	
	
	等待到指定地图("村长的家", 1)
	移动(8,9)
	移动(6,11)
	移动(6,12)
	移动(6,13)
	等待到指定地图("阿巴尼斯村", 1)
	
	移动(37,55)
	移动(40,55)
	移动(41,56)
	移动(46,56)
	移动(49,53)
	移动(49,35)
	移动(42,35)
	移动(40,33)
	移动(40,31)
	移动(40,30)
	
	
	等待到指定地图("民家", 1)
	
::ming::
	移动(11,12)
	移动(13,10)
	
::caomei::
	
	
	设置("timer", 100)
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	
	
	移动(12,10)
	移动(9,7)
	移动(9,5)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("1", "", "")
	
	
	等待到指定地图("民家地下", 1)
	
	


	移动(7,6)
	移动(8,7)
	移动(14,7)
	
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("民家地下", 1)
	
	
	
	移动(12,7)
	移动(14,7)
::liren::
	
	
	转向(2, "")
	等待服务器返回()
	对话选择("1", "", "")
	if(取物品数量("刀刃的碎片") < 1)then goto liren end
	移动(6,7)
	移动(5,6)
	移动(5,4)
	移动(5,3)
	
	
	等待到指定地图("民家", 1)
	
	
	
	移动(10,4)
	移动(9,4)
	
	
	等待到指定地图("民家地下", 1)
	
	
	移动(5,6)
	移动(9,10)
	移动(14,10)
	
	
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	
	等待到指定地图("民家地下", 1)
	
	
	移动(8,7)
	移动(7,6)
	移动(7,4)
	移动(7,3)
	
	
	等待到指定地图("民家", 1)
	
	
	
	移动(9,11)
	移动(12,16)
	移动(12,17)
	
	
	等待到指定地图("阿巴尼斯村", 1)
	
	
	
	移动(40,33)
	移动(41,34)
	移动(48,34)
	移动(49,35)
	
	移动(49,54)
	移动(43,60)
	移动(43,64)
        移动(46,64)
        移动(47,64)
        
        等待到指定地图("医院", 1)
        
        移动(7,8)
        移动(9,6)
        移动一格(2)
        等待到指定地图("医院", 10,6)
	回复(2)						
	
        	
::buwan::
        移动(9,6)
        移动(6,9)
        移动(2,9)
        移动(1,9)
	

	等待到指定地图("阿巴尼斯村", 1)
	
        移动(40,64)
        移动(36,68)
        移动(36,70)
        移动(36,71)
	等待到指定地图("莎莲娜", 1)
	移动(181,163)
	移动(173,163)
	移动(169,167)
	
	移动(158,167)
	移动(157,168)
	移动(122,168)
	移动(119,171)
	移动(82,171)
	移动(75,164)
	移动(57,164)
	移动(55,164)
	移动(55,162)
	
	转向(7, "")
	
	
	等待到指定地图("诅咒的迷宫", 1)
	
	
	
	移动(8,15)
	移动(6,17)
	移动(6,21)
	移动(13,28)
	
	移动(13,30)
	移动(23,30)
	移动(27,26)
	移动(27,14)
	移动(32,9)
	
	移动(34,9)
	移动(35,9)
	
	
	等待到指定地图("诅咒的迷宫 地下1楼", 1)
	
	
	移动(20,13)
	移动(21,14)
	移动(25,14)
	移动(25,13)
	
	
	等待到指定地图("诅咒的迷宫 地下2楼", 1)
	
	
	
	移动(24,14)
	
	移动(23,15)
	移动(17,15)
	移动(17,20)
	移动(9,20)
	移动(9,6)
	
	移动(17,6)
	移动(17,5)
	移动(17,4)
	
	
	等待到指定地图("诅咒的迷宫 地下3楼", 1)
	
	
	移动(16,5)
	移动(18,5)
	移动(21,8)
	
	移动(21,20)
	移动(22,20)
	移动(23,20)
	
	
	等待到指定地图("诅咒的迷宫 地下4楼", 1)
	
	
	
	移动(11,20)
	移动(11,16)
	移动(16,11)
	移动(16,10)
	
	
	等待到指定地图("诅咒的迷宫 地下5楼", 1)
	
	
	
	移动(13,10)
	移动(13,5)
	移动(6,5)
	移动(6,4)
	移动(6,3)
	
	
	
	等待到指定地图("诅咒的迷宫 地下6楼", 1)
	
	
	移动(6,7)
	
	移动(8,9)
	移动(8,19)
	移动(13,19)
	移动(13,15)
	移动(14,14)
	
	移动(14,12)
	移动(13,11)
	移动(13,6)
	移动(15,4)
	移动(15,3)
	
	
	等待到指定地图("诅咒的迷宫 地下7楼", 1)
	
	
	
	移动(15,5)
	
	移动(19,5)
	移动(21,7)
	移动(21,18)
	移动(24,18)
	移动(25,18)
	
	
	等待到指定地图("诅咒的迷宫 地下8楼", 1)
	
	
	移动(23,18)
	
	移动(23,9)
	移动(4,9)
	移动(4,15)
	移动(9,20)
	移动(14,20)
	
	移动(14,19)
	移动(14,18)
	
	

	等待到指定地图("诅咒的迷宫 地下9楼", 1)
	


	移动(14,20)
	移动(23,20)
	移动(23,13)
	移动(25,11)

	移动(25,4)
	移动(24,4)
	

	等待到指定地图("第一个难关\", 1)
	


	移动(21,7)
	移动(10,7)
	移动(10,29)
	移动(21,29)
	
	移动(21,17)
	移动(22,16)
	移动(22,15)
	
	
	转向(0, "")
	等待服务器返回()
	对话选择("1", "", "")
	
	
	等待到指定地图("诅咒的迷宫 地下11楼", 1)
	
	
	
	移动(24,22)
	移动(12,22)
	
	移动(6,16)
	移动(6,8)
	移动(9,5)
	移动(15,5)
	移动(15,4)
	
	
	等待到指定地图("诅咒的迷宫 地下12楼", 1)
	
	
	
	移动(15,5)
	
	移动(9,5)
	移动(9,15)
	移动(23,15)
	移动(24,15)
	
	
	等待到指定地图("诅咒的迷宫 地下13楼", 1)
	
	
	
	移动(6,14)
	移动(6,5)
	
	移动(16,5)
	移动(16,4)
	移动(16, 3)
	
	
	等待到指定地图("诅咒的迷宫 地下14楼", 1)
	
	
	
	移动(16,6)
	移动(6,6)
	移动(6,12)
	
	移动(24,12)
	移动(25,12)
	
	
	等待到指定地图("诅咒的迷宫 地下15楼", 1)
	
	
	移动(8,12)
	移动(8,5)
	移动(21,5)
	移动(22,5)
	
	
	等待到指定地图("诅咒的迷宫 地下16楼", 1)
	
	
	移动(14,5)
	
	移动(14,11)
	移动(11,14)
	移动(7,14)
	移动(7,18)
	移动(16,18)
	移动(17,18)
	
	
	等待到指定地图("诅咒的迷宫 地下15楼", 1)
	
	
	
	
	移动(17,19)
	移动(19,21)
	移动(24,21)
	移动(25,21)
	
	
	等待到指定地图("诅咒的迷宫 地下16楼", 1)
	
	
	移动(22,21)
	移动(22,19)
	移动(22,18)
	
	
	等待到指定地图("诅咒的迷宫 地下17楼", 1)
	
	
	移动(22,20)
	移动(7,20)
	移动(7,8)
	移动(20,8)
	移动(23,5)
	移动(23,4)
	
	
	等待到指定地图("诅咒的迷宫 地下18楼", 1)
	
	
	
	
	移动(19,8)
	移动(14,8)
	移动(14,13)
	移动(21,13)
	移动(22,12)
	喊话("恭喜您可以开始抓血刀了",05,03,02)
	开始遇敌()		-- 开始自动遇敌
	goto scriptstart 
::scriptstart::
	if(人物("魔") < 人补魔)then goto  salebegin end		-- 魔小于100
	if(人物("血") < 人补血)then goto  salebegin end
	if(宠物("血") < 宠补血)then goto  salebegin end
	if(宠物("魔") < 宠补魔)then goto  salebegin end
	if(取物品数量("封印卡（金属系）") < 1)then goto  begin end
	if("耐久", "7", "<", "自动换水火的水晶耐久值", checkcrystalnow)
	goto scriptstart 		-- 继续自动遇敌
::salebegin::
	停止遇敌()				-- 结束战斗
	
	等待(3000)
	goto begin 
::checkcrystalnow::
	if(取物品数量("风地的水晶（5：5）") < 1)then goto  begin end
	停止遇敌()						-- 结束战斗
	
	等待(1000)
	扔("7")
	等待(1000)
	装备物品("风地的水晶（5：5）", 7)
	等待(1000)
	goto scriptstart 







::maika::
	移动(17,53)
	等待到指定地图("法兰城", 1)
	等待(500)
	移动(82,88)
	移动(92,88)
	移动(92,78)
	移动(94,78)
	
	等待到指定地图("达美姊妹的店", 1)
	
	移动(10,13)
	移动(13,16)
	移动(17,16)
	移动(17,18)
	
	等待(1000)
	
	
	转向(2, "")             
	等待服务器返回()
	
	对话选择("0", "1", "")
	等待服务器返回()
	
	对话选择("0", "12", "")          
	等待服务器返回()
	
	叠("封印卡（金属系）",20）
	
	叠(""封印卡（金属系）",20）
	
	moveres("封印卡（金属系）""),20）
	
	goto begin 