红巨人，起点艾尔莎岛登入点，请设置好自动战斗,战斗1中设置好遇一级宠时的战斗方法 ::战斗2设置好宠物满下线保护

设置("timer", 100)		
设置("自动战斗",1)
设置("高速战斗", 1)
设置("高速延时",1)
		--原地遇敌      
local 人补魔=用户输入框( "人多少魔以下补魔", "50")
local 人补血=用户输入框( "人多少血以下补血", "300")
local 宠补魔=用户输入框( "宠多少魔以下补魔", "50")
local 宠补血=用户输入框( "宠多少血以下补血", "200")	
local 自动换水火的水晶耐久值 = 用户输入框("多少耐久以下自动换水火的水晶,不换可不填", "30")   
::begin::  
	mapName=取当前地图名()
	if(mapName=="风鸣之塔 10楼")then goto yudi end
	回城()
::begin2::
	if(人物("坐标")  == "140,105")then	goto  star1 end
	if(人物("坐标")  == "72,123")then	goto  w2 end	-- 西2登录点
	if(人物("坐标")  == "233,78")then	goto  e2 end	-- 东2登录点
	if(人物("坐标")  == "162,130")then	goto  s2 end	-- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1 end	-- 西1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	-- 东1登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	-- 南1登录点
	goto begin2 

::w2::	-- 西2登录点
	转向(2, "")		-- 转向东	
	等待到指定地图("法兰城",233,78)	
	转向(0, "")		-- 转向北	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 			

::e2::	-- 东2登录点
	转向(0, "")		-- 转向北	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 			
::s2::	-- 南2登录点
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 			

::w1::	-- 西1登录点
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 242, 100)	
	转向(2, "")		-- 转向东	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::e1::	-- 东1登录点
	转向(2, "")		-- 转向东	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::begin_1::
	自动寻路(153, 105)	
	自动寻路(153, 100)	
	等待到指定地图("里谢里雅堡")
	自动寻路(41, 69)
	goto goto2 


::star1::
	转向(1)
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡", 1)
	转向(2, "")	
	自动寻路(34,89)
	回复(1)			-- 转向北边恢复人宠血魔	
	自动寻路(41, 80)
::goto2::
	自动寻路(41, 69)
	自动寻路(41, 53)
	--if(取物品数量("水火的水晶（5：5）") < 1)then goto  maishuijing end
	自动寻路(41,51)	
	自动寻路(41,50)	
	等待到指定地图("里谢里雅堡 1楼", 1)
	自动寻路(74,30)
	自动寻路(68,24)
	自动寻路(49,24)
	自动寻路(45,20)	
	等待到指定地图("启程之间")	
	自动寻路(25, 27)
	if(取物品数量("封印卡（人形系）") < 2)then goto  maika end	
	自动寻路(25,37)
	自动寻路(18,44)
	自动寻路(8,44)	
	if(取物品数量( "传送石优待卷") >  0)then goto  aaa end		
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")	
	goto to 

::aaa::
	
	转向(0, "")
	等待服务器返回()	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
::to::
	等待到指定地图("加纳村的传送点")	
	自动寻路(5,12,"村长的家")		
	自动寻路(1,9,"加纳村")		
	自动寻路(48,77,"索奇亚")
	自动寻路(462,404)
	等待(3000)
	喊话("以军神之名开启海路",01,01,02)
	喊话("以军神之名开启海路",01,01,02)	
	等待服务器返回()
	对话选择("1", "", "")
	等待到指定地图("契约的海道", 1)	
	自动寻路(17,12,"阿卡斯")
	自动寻路(45,69,"风鸣之塔 1楼")
	自动寻路(50,15,"风鸣之塔 2楼")
	自动寻路(50,62,"风鸣之塔 3楼")
	自动寻路(66,81,"风鸣之塔 4楼")
	自动寻路(72,81,"风鸣之塔 3楼")
	自动寻路(88,29,"风鸣之塔 4楼")
	自动寻路(94,74,"风鸣之塔 5楼")
	自动寻路(89,30,"风鸣之塔 6楼")
	自动寻路(50,90,"风鸣之塔 7楼")
	自动寻路(50,85,"风鸣之塔 8楼")
	自动寻路(93,65,"风鸣之塔 9楼")	
	自动寻路(90,63,"风鸣之塔 10楼")	
::yudi::
	自动寻路(60,64)
	开始遇敌()		-- 开始自动遇敌
	goto scriptstart 
::scriptstart::
	if(人物("魔") < 人补魔)then goto  salebegin end		-- 魔小于100
	if(人物("血") < 人补血)then goto  salebegin end
	if(宠物("血") < 宠补血)then goto  salebegin end
	if(宠物("魔") < 宠补魔)then goto  salebegin end
	if(取物品数量("封印卡（人形系）") < 1)then goto  begin end
	--if(耐久(7) < 自动换水火的水晶耐久值) then goto checkcrystalnow end
	goto scriptstart 		-- 继续自动遇敌
::salebegin::
	停止遇敌()				-- 结束战斗	
	等待(3000)
	goto begin 
::checkcrystalnow::
	if(取物品数量("水火的水晶（5：5）") < 1)then goto  begin end
	停止遇敌()						-- 结束战斗	
	等待(1000)
	扔("7")
	等待(1000)
	装备物品("水火的水晶（5：5）", 7)
	等待(1000)
	goto scriptstart 
::maika::		
	自动寻路(15, 5)        
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")	
	goto csghdcz 

::csghdcz::
	等待到指定地图("杰诺瓦镇的传送点")		
	自动寻路(14, 6,"村长的家")	
	自动寻路(1, 9,"杰诺瓦镇")	
	自动寻路(43, 23,"杂货店")
	自动寻路(9, 12)
	自动寻路(11,12)	
	转向(2, "")                 
	等待服务器返回()	
	对话选择("0", "1", "")
	等待服务器返回()
	买(0,40)  	
	叠("封印卡（人形系）",20)		
	goto begin 