★捉树精脚本，起点艾尔莎岛登入点，请设置好自动战斗,战斗1中设置好遇一级宠时的战斗方法 ::战斗2设置好宠物满下线保护，谢谢支持魔力辅助程序.脚本发现BUG联系Q::274100927-----------星落


设置("timer", 100)						


设置("自动战斗",1)
设置("高速战斗", 1)
设置("高速延时",1)
    
local 人补魔=用户输入框( "人多少魔以下补魔", "50")
local 人补血=用户输入框( "人多少血以下补血", "300")
local 宠补魔=用户输入框( "宠多少魔以下补魔", "50")
local 宠补血=用户输入框( "宠多少血以下补血", "200")	
local 自动换风地的水晶耐久值 = 用户输入框("多少耐久以下自动换风地的水晶,不换可不填", "30")
   
::start::
	清除系统消息()
	停止遇敌()					-- 结束战斗
	
	if(人物("坐标")  == "690,285")then	goto  kaishi end
	回城()
	等待(3000)
	等待到指定地图("艾尔莎岛")        
	转向(1)		-- 转向北
	对话选择(4, 0)
	等待到指定地图("里谢里雅堡")
	移动(34,89)
	回复(1)			-- 转向北边恢复人宠血魔	
	移动(41, 53)
	if(取物品数量("封印卡（植物系）") < 1)then goto  maika end
	移动(65,53,"法兰城")	
	移动(281,88,"芙蕾雅")	
	移动(559,221)
::kaishi::
	开始遇敌()		-- 开始自动遇敌
	goto scriptstart 
::scriptstart::
	if(人物("魔") < 人补魔)then goto  salebegin end		-- 魔小于100
	if(人物("血") < 人补血)then goto  salebegin end
	if(宠物("血") < 宠补血)then goto  salebegin end
	if(宠物("魔") < 宠补魔)then goto  salebegin end
	if(取物品数量("封印卡（植物系）") < 1)then goto  start end	
	goto scriptstart 		-- 继续自动遇敌
::salebegin::
	停止遇敌()			-- 结束战斗	
	等待(3000)
	goto start 
::checkcrystalnow::
	if(取物品数量("风地的水晶（5：5）") < 1)then goto  start end
	停止遇敌()						-- 结束战斗	
	等待(1000)
	扔("7")
	等待(1000)
	装备物品("风地的水晶（5：5）", 7)
	等待(1000)
	goto scriptstart 	

::maika::
	移动(17,53,"法兰城")
	移动(94,78,"达美姊妹的店")		
	移动(17,18)		
	转向(2, "")             
	等待服务器返回()	
	对话选择("0", "1", "")
	等待服务器返回()
	买(8,20)	      
	等待服务器返回()	
	叠("封印卡（植物系）",20)	
	if(取物品数量("风地的水晶（5：5）") < 1)then goto  maishuijing end
	goto start 
::maishuijing::	
	转向(2)             
	等待服务器返回()	
	对话选择("0", "1")
	等待服务器返回()
	买(12,1)       
	等待服务器返回()
	goto start 
