★起点艾尔莎岛登入点，请设置好自动战斗,战斗1中设置好遇一级宠时的战斗方法 ::战斗2设置好宠物满下线保护，谢谢支持魔力辅助程序.脚本发现BUG联系Q::274100927-----------星落
清除系统消息()


设置("timer", 100)						

设置("自动战斗",1)
设置("高速战斗", 1)
设置("高速延时",1)

local 人补魔=用户输入框( "人多少魔以下补魔", "50")
local 人补血=用户输入框( "人多少血以下补血", "300")
local 宠补魔=用户输入框( "宠多少魔以下补魔", "50")
local 宠补血=用户输入框( "宠多少血以下补血", "200")	
local 自动换水火的水晶耐久值 = 用户输入框("多少耐久以下自动换水火的水晶,不换可不填", "30")
   
    
::begin::	
      	
	回城()
	等待(3000)
	等待到指定地图("艾尔莎岛", 1)
        
	转向(1)		-- 转向北
	对话选择(4,0)
	等待到指定地图("里谢里雅堡")
	自动寻路(34,89)
	回复(1)			-- 转向北边恢复人宠血魔	
	if(取物品数量("水火的水晶（5：5）") < 1)then goto  maishuijing end
	if(取物品数量("封印卡（金属系）") < 1)then goto  maika end
	回城()	
	等待到指定地图("艾尔莎岛")	
	自动寻路(157,93)	
	转向(2)	
	等待到指定地图("艾夏岛",84,112)	
	转向(6)
	等待到指定地图("艾夏岛",164,159)					
	转向(7)				
	等待到指定地图("艾夏岛",151,97)		
	自动寻路(190,116,"盖雷布伦森林")
	自动寻路(231, 222,"布拉基姆高地")	
	自动寻路(168, 116)	
	开始遇敌()		-- 开始自动遇敌
	goto scriptstart 
::scriptstart::
	if(人物("魔") < 人补魔)then goto  salebegin end		-- 魔小于100
	if(人物("血") < 人补血)then goto  salebegin end
	if(宠物("血") < 宠补血)then goto  salebegin end
	if(宠物("魔") < 宠补魔)then goto  salebegin end
	if(取物品数量("封印卡（野兽系）") < 1)then goto  begin end
	--if("耐久", "7", "<", "自动换水火的水晶耐久值", checkcrystalnow)
	goto scriptstart 		-- 继续自动遇敌
::salebegin::
	停止遇敌()			-- 结束战斗	
	等待(3000)
	goto buxue 
::checkcrystalnow::
	if(取物品数量("水火的水晶（5：5）") < 1)then goto  begin end
	停止遇敌()				-- 结束战斗	
	等待(1000)
	扔("7")
	等待(1000)
	装备物品("水火的水晶（5：5）", 7)
	等待(1000)
	goto scriptstart 	
::buxue::	
	自动寻路(227, 165)
    goto lu4 
::quzhua::	
	等待到指定地图("布拉基姆高地")	
	自动寻路(168, 116)	
	开始遇敌()		-- 开始自动遇敌
	goto scriptstart 
::StartBegin::
	等待(1000)
	等待到指定地图("洞窟之村　第２层", 146, 163)	
	自动寻路( 52, 145)
	goto lu1 
::lu1::
	等待到指定地图("洞窟之村　第１层",1)
	自动寻路( 97, 76)
    goto quzhua 
::lu4::		   
	自动寻路( 231, 165,"洞窟之村　第１层")	
	自动寻路( 203, 100)
    goto lu6 
::lu6::
	等待到指定地图("洞窟之村　第２层", 52, 145)
	自动寻路(146,163)
    goto xue 

::xue::
	回复(0)			-- 转向北边恢复人宠血魔	
	goto StartBegin 
::maishuijing::
	自动寻路(17,53,"法兰城")	
	自动寻路(94,78,"达美姊妹的店")	
	自动寻路(17,18)	
	转向(2, "")             
	等待服务器返回()	
	对话选择("0", "1", "")
	等待服务器返回()
	买(10,2)	
	等待服务器返回()	
	goto begin 
::maika::
	自动寻路(41, 50,"里谢里雅堡 1楼")
	自动寻路(45, 20,"启程之间")		
	自动寻路(15, 5)        
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")	
	goto csghdcz 

::csghdcz::
	等待到指定地图("杰诺瓦镇的传送点", 1)	
	自动寻路(14, 6,"村长的家")	
	自动寻路( 1, 9,"杰诺瓦镇")  	
	自动寻路( 43, 23,"杂货店")	
	自动寻路(11,12)	
	转向(2, "")                 
	等待服务器返回()	
	对话选择("0", "1", "")
	等待服务器返回()
	买(2,40)		
	叠("封印卡（野兽系）",20)
	goto begin 
