#定居艾尔莎岛

from cgaapi import *
import sys

def main():  
	cg.g_debug_log=True
	#cg.MoveGold(1000, 2)
	cg.gotoFaLanCity("s1")
	return
	cg.getMoneyFromBank(1000)
	return
	#cg.toTeleRoom("维诺亚村")
	#return
	# cg.g_debug_log=True
	# 自动寻路(40, 98,"法兰城")	
	# cg.gotoBankTalkNpc()
	# return
	#出里谢里亚堡("e")
	出法兰城("s")
	等待到指定地图("芙蕾雅")
	自动寻路(409, 294)
	对话选是(4)	
	等待到指定地图("小路")
	自动寻路( 46, 23,"忍者的隐居地")
	自动寻路( 19, 9,"忍者之家")	
	自动寻路(13,20)	
	转向(0)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("忍者之家2楼")		
	自动寻路( 37,19)	
	等待到指定地图("忍者之家")	
	自动寻路(63, 38)	
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("井的底部")	
	自动寻路(7, 4)
	等待到指定地图(21024)	
	自动寻路(22, 26)
	等待到指定地图(21025)	
	自动寻路(11, 11)
	自动寻路(5, 15,"乌克兰")	
	自动寻路(71, 60,"杂货店")
	自动寻路(15, 5,"杂货店 2楼")
	自动寻路(12, 10)
	





if __name__ == '__main__':
    main()
