★要求法兰城定居

					

设置("自动战斗", 1)			-- 开启自动战斗，0不自动战斗，1自动战斗
设置("高速战斗", 4)			-- 高速战斗时的操作等待时间单位秒，3以上为好，不然容易断线
设置("高速延时", 6)			-- 高速战斗速度，0速度最低，6速度最高
-- 自动遇敌
-- 定时间隔


					
是否打卡=用户输入框( "是否打卡，打卡请填100000，不打请填0", "100000");

::StartBegin::
	设置("timer", 100)
	回城()
	等待(2500)
       
	
	
::begin::
	if(人物("坐标")  == "72,123")then	goto  w2 end	-- 西2登录点
	if(人物("坐标")  == "233,78")then	goto  e2 end	-- 东2登录点
	if(人物("坐标")  == "162,130")then	goto  s2 end	-- 南2登录点	
	if(人物("坐标")  == "63,79")then	goto  w1 end	-- 西1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	-- 东1登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	-- 南1登录点	
	goto begin 
::w2::

转向(2, "")


等待到指定地图("法兰城", 233,78)

::e2::

转向(0, "")


等待到指定地图("市场一楼 - 宠物交易区", 1)



转向(0, "")
::s2::


等待到指定地图("法兰城", 162,130)


移动(160, 130)
移动(154, 130)
goto goo1 


::w1::	-- 西1登录点
转向(0, "")		-- 转向北

等待到指定地图("法兰城", 242, 100)


::e1::	-- 东1登录点
转向(2, "")		-- 转向东

等待到指定地图("市场三楼 - 修理专区", 46, 16)

转向(0, "")		-- 转向北


::s1::	-- 南1登录点
等待到指定地图("法兰城", 141, 148)


移动(153,148)
移动(153,130)


::goo1::
移动(154, 129)
移动(154, 103)
移动(154, 100)

等待到指定地图("里谢里雅堡", 1)


移动(41, 88)

移动(41, 83)
if(人物("血") > 是否打卡)then goto  qdka end  
移动(42, 83)
移动(57, 83)


转向(3, "")
等待服务器返回()

对话选择("4", "", "")
等待服务器返回()
对话选择("1", "", "")
移动(56, 83)
移动(41, 83)
--============================打卡完================================
::qdka::

移动(41, 82)
移动(41, 55)
移动(41, 50)


等待到指定地图("里谢里雅堡 1楼", 1)


移动(74, 37)
移动(74, 24)
移动(45, 24)
移动(45, 20)


等待到指定地图("启程之间", 1)





::qjxue::
--================================管它挖什么 挖去吧================================================

移动(25, 27)
移动(34, 27)
移动(34, 11)
移动(36, 11)
移动(36, 4)
移动(37, 4)
等待到指定地图("启程之间", 37, 4)


转向(2, "")
等待服务器返回()
对话选择("4", "", "")


等待到指定地图("阿巴尼斯村的传送点", 1)


移动(5, 8)
移动( 5, 4)

等待到指定地图("村长的家", 1)

移动(8, 9)
移动( 6, 13)
	
等待到指定地图("阿巴尼斯村", 1)

移动(36, 68)

::bumover::


移动(37, 70)

移动( 38, 71)

等待到指定地图("莎莲娜", 1)


移动(187, 165)
移动(187, 171)
移动(189, 173)
移动(216, 173)
移动(219, 170)
移动(225, 167)
移动(225, 147)
移动(231, 147)
	等待(2000)
--============================到地方了 开挖============================================

::StartWork::		-- 开始工作
	if("物品", "物品", "null", "满", StartSale)	-- 铜满回城
	if("人", "魔", "<", 1, Startbumo)					-- 魔无也不回城
--	if("状态", "Character._health", ">", 0, "YiZhi")	-- 受伤了，需要治疗
	Work(104, "")
	等待(5000)
	goto StartWork 
--======================挖好了 登====================================

::StartSale::
	回城()
	等待(2000)
::sale_2::	

        等待到指定地图("法兰城", 1)
	if(人物("坐标")  == "72,123")then	goto  w2_2 end		-- 西2登录点
	if(人物("坐标")  == "233,78")then	goto  e2_2 end		-- 东2登录点
	if(人物("坐标")  == "162,130")then	goto  s2_2 end		-- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1_2 end		-- 西1登录点
	if(人物("坐标")  == "242,100")then	goto  e1_2 end		-- 东1登录点
	if(人物("坐标")  == "141,148")then	goto  s1_2 end		-- 南1登录点
	goto sale_2 
	
	
::w2_2::	-- 西2登录点
	转向(2, "")
	
	等待到指定地图("法兰城", 233, 78)
	
	goto e2_2 

::e2_2::	-- 东2登录点
	
	移动(233,80)
	移动(233,93)
	移动(235,95)
	移动(235,100)
	移动(242,100)				
	goto e1_2 

::s2_2::	-- 南2登录点
	转向(2, "")
	
	等待到指定地图("法兰城", 72, 123)
	
	转向(2, "")
	
	等待到指定地图("法兰城", 233, 78)
	
	goto e2_2 

::w1_2::	-- 西1登录点
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 242, 100)
	

	goto e1_2 

::s1_2::	-- 南1登录点
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 63, 79)
	
	转向(0, "")		-- 转向北
	
	等待到指定地图("法兰城", 242, 100)
	
	goto e1_2 

::e1_2::
	转向(2, "")		-- 东
	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)





::sale_3::

等待到指定地图("市场三楼 - 修理专区", 46, 16)

移动(46, 17)
移动(46,18)


等待到指定地图("市场二楼 - 武器防具区", 1)


移动(45, 14)
移动(87, 14)
回复(2)			-- 转向东边恢复人宠血魔



移动(81, 14)
等待到指定地图("市场二楼 - 武器防具区", 81, 14)  

移动(81, 19)
	等待(2000)
      

	
	转向(2, "")
	等待服务器返回()
        
::sale_4::

	对话选择("存条", "�q", "40")
	等待(500)
	if("银行", "数量", "==", 20, "End")
	if(取物品数量( "�q") >  1)then goto       --满了 登了登了
	if(取物品数量( "�q") >  1)then goto  sale_4 end
	goto StartBegin end


::Startbumo::

--======================回去补魔 


移动(231, 147 
移动(225, 147)
移动(225, 167)
移动(219, 170)
移动(216, 173)
移动(189, 173)
移动(187, 171)
移动(187, 165)
移动(184, 161)


等待到指定地图("阿巴尼斯村", 1)


移动(38, 64)
移动(44, 64)
移动(47, 64)


等待到指定地图("医院", 1)


移动(4, 8)
移动(10, 8)
移动(10, 6)
等待到指定地图("医院", 10, 6)
回复(2)			-- 东


移动(10, 8)
移动(4, 8)
移动(3, 8)
移动(1, 8)


等待到指定地图("阿巴尼斯村", 1)


移动(45, 64)
移动(39, 64)
移动(38, 65)
移动(38, 69)
goto bumover 

::End::
	exit
	等待(15000)
	


::YiZhi::
	if(人物("魔") < 36)then goto  StartSale end				-- 无魔治疗回城

goto StartWork 	
	



