5C技能学习，防具学习没有测试，此次编程为盲编，是在没有FZ的情况下进行的编程。如果有错误，留言。

设置("timer", 200)

设置("自动战斗", 1)
设置("高速战斗", 1)
设置("高速延时", 4)
设置("高速延时", 6)
设置("自动战斗"Flee, 1)
set("自动加血","1")
set("自动卖",1,魔石)
set("自动点NPC",0)
set("行走加速","移动速度")
set("静止重启脚本","0","300")
set("脚本停止重启","0","180")

goto 任务开始 

脚本参数("下拉框","选择路线",武器制作路线,防具制作路线)
脚本参数("下拉框","选择装备",铸剑,造斧,造枪,造弓,造杖,造小刀,造投掷武器,制头盔,制帽子,制铠甲,制衣服,制长袍,制靴,制鞋,制盾)
移动速度=用户输入框("移动速度","20")

::任务开始::
	喊话("黑历史的岩屋，学习5C装备任务启动。",01,05,05)
	
	set("chat")
	等待(500)
	
	回城()
	
::新城启动::
	等待到指定地图("艾尔莎岛", 1)
	
	移动(140, 105)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("里谢里雅堡", 1)
	
	喊话("黑历史的岩屋，学习5C装备任务启动。",01,05,05)
	
::城堡补给::
	移动(31, 91)
	移动(34, 89)
	
	转向(1, "")
	等待(3000)
	移动(31, 91)
	移动(31, 77)
	
	转向(6, "")
	等待(3000)
	
	
::开始跑路::
	喊话("黑历史之石洞，跑步前进。",01,05,05)
	
	set("chat")
	等待(500)
	
	回城()
	
	等待到指定地图("艾尔莎岛", 1)
	
	移动(143, 108)
	移动(157, 94)
	移动(158, 94)
	
	
	转向(0, "")
	等待(2000)
	
	等待到指定地图("艾夏岛", 1)
	
	
	转向(6, "")
	等待(2000)
	
	等待到指定地图("艾夏岛", 1)
	
	
	转向(7, "")
	等待(2000)
	
	等待到指定地图("艾夏岛", 1)
	
	移动(156, 102)
	移动(157, 102)
	移动(164, 109)
	移动(168, 109)
	移动(174, 115)
	移动(189, 115)
	移动(190, 115)
	
	等待到指定地图("盖雷布伦森林", 1)
	
	移动(205, 211)
	移动(213, 219)
	移动(213, 227)
	移动(226, 227)
	移动(230, 223)
	
	等待(500)
	移动(231, 222)
	
	等待到指定地图("布拉基姆高地", 1)
	
	移动(31, 191)
	移动(35, 187)
	移动(43, 187)
	移动(51, 195)
	移动(58, 195)
	移动(59, 194)
	移动(73, 194)
	移动(95, 216)
	移动(106, 216)
	移动(117, 205)
	移动(117, 188)
	移动(121, 188)
	移动(128, 181)
	移动(128, 170)
	移动(137, 161)
	移动(137, 134)
	移动(143, 128)
	移动(144, 127)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("布拉基姆高地", 1)
	
	移动(148, 125)
	移动(149, 126)
	移动(161, 138)
	移动(161, 142)
	移动(160, 142)
	移动(160, 143)
	移动(157, 146)
	移动(157, 147)
	移动(152, 152)
	移动(152, 155)
	移动(157, 160)
	移动(163, 160)
	移动(167, 164)
	移动(167, 180)
	移动(177, 190)
	移动(179, 190)
	移动(193, 204)
	移动(193, 209)
	移动(202, 218)
	移动(206, 218)
	移动(226, 238)
	移动(236, 238)
	移动(248, 250)
	移动(248, 256)
	移动(252, 260)
	移动(252, 261)
	移动(254, 261)
	移动(261, 268)
	移动(266, 268)
	移动(266, 267)
	移动(267, 267)
	
	等待到指定地图("黑历史之石洞　第１层", 1)
	
::洞穴一层::
	移动(164, 169)
	移动(155, 160)
	移动(155, 122)
	移动(132, 122)
	移动(132, 102)
	移动(139, 95)
	移动(150, 95)
	移动(157, 88)
	移动(157, 67)
	移动(163, 67)
	移动(164, 67)
	
	等待到指定地图("黑历史之石洞　第２层", 1)
	
::洞穴二层::
	移动(154, 88)
	移动(154, 131)
	移动(154, 187)
	移动(138, 203)
	移动(133, 203)
	移动(132, 203)
	
	等待到指定地图("黑历史之石洞　第３层", 1)
	
::洞穴三层::
	移动(228, 200)
	
	set("chat")
	
	清除系统消息()
	
	等待(500)
	
::武防路线::
	
	if("脚本参数","选择路线",==,武器制作路线,"武器制作")
	if("脚本参数","选择路线",==,防具制作路线,"防具制作")
	
	goto 武防路线 

--********************************************************************************
::武器制作::
	
	喊话("到达第三层，选择武器制作路线。",01,05,05)
	
	移动(219, 191)
	移动(219, 183)
	移动(212, 176)
	移动(212, 163)--武器中转站
::武器制作2::
	
	if("脚本参数","选择装备",==,铸剑,"铸剑路线")
	if("脚本参数","选择装备",==,造斧,"造斧路线")
	if("脚本参数","选择装备",==,造枪,"造枪路线")
	if("脚本参数","选择装备",==,造弓,"造弓路线")
	if("脚本参数","选择装备",==,造杖,"造杖路线")
	if("脚本参数","选择装备",==,造小刀,"造小刀路线")
	if("脚本参数","选择装备",==,造投掷武器,"造投掷武器路线")
	
	goto 武器制作2 

::铸剑路线::--********************************************************************************
	
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(219, 106)
::库罗对话::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 铸剑路线2 end
	
	goto 库罗对话 
::铸剑路线2::
	
	移动(219, 106)
	移动(215, 110)
	移动(215, 130)
	移动(212, 133)
	移动(212, 163)
::铸剑道具店::
	移动(233, 163)
	移动(233, 156)
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::铸剑路线3::
	
	移动(274, 156)
	移动(233, 156)
	移动(233, 163)
	移动(212, 163)
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(219, 106)
::库罗对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(红哨子) == 1)then goto 铸剑路线4 end
	
	goto 库罗对话2 
::铸剑路线4::
	
	移动(210, 106)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::铸剑路线5::
	移动(352, 177)
::铸剑阮籍::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 铸剑路线6 end
	
	goto 铸剑路线5 
::铸剑路线6::
	
	set("chat")
	清除系统消息()
	喊话("铸剑5C技能学习完毕。",01,05,05)
	结束脚本

::道具店对话::--********************************************************************************
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	移动(264, 103)
	移动(247, 86)
::道具店对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(金床) == 1)then goto 道具店对话3 end
	if(取物品数量(锯子) == 1)then goto 道具店对话3 end
	if(取物品数量(大锤) == 1)then goto 道具店对话3 end
	if(取物品数量(岩清水) == 1)then goto 道具店对话3 end
	if(取物品数量(耐火粘土) == 1)then goto 道具店对话3 end
	if(取物品数量(鹤嘴锹) == 1)then goto 道具店对话3 end
	if(取物品数量(装炭袋) == 1)then goto 道具店对话3 end
	
	goto 道具店对话2 
::道具店对话3::
	
	移动(264, 103)
	移动(264, 158)
	移动(264, 159)
	
	等待到指定地图("黑历史之石洞　第３层", 1)
	
::道具店对话4::
	if("脚本参数","选择装备",==,铸剑,"铸剑路线3")
	if("脚本参数","选择装备",==,造斧,"造斧路线3")
	if("脚本参数","选择装备",==,造枪,"造枪路线3")
	if("脚本参数","选择装备",==,造弓,"造弓路线3")
	if("脚本参数","选择装备",==,造杖,"造杖路线3")
	if("脚本参数","选择装备",==,造小刀,"造小刀路线3")
	if("脚本参数","选择装备",==,造投掷武器,"造投掷武器路线3")
	
	goto 道具店对话4 

::哨子四层::
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	移动(202, 38)
	移动(202, 101)
	移动(202, 188)
	移动(193, 197)
	移动(193, 198)
::哨子五层::
	
	等待到指定地图("黑历史之石洞　第５层", 1)
	
	移动(227, 178)
	移动(214, 178)
	移动(214, 165)
	移动(212, 163)
	移动(212, 123)
::红蓝哨子::
	
	if(取物品数量(红哨子) == 1)then goto 红哨子走起 end
	if(取物品数量(蓝哨子) == 1)then goto 蓝哨子走起 end
	
	goto 红蓝哨子 
::红哨子走起::
	移动(229, 123)
	移动(233, 119)
::红哨子走起2::
	移动(233, 118)
	等待(1000)
	
	移动(237, 115)
	
	if(取当前地图名() ==  "？？？")then goto 武器技能 end
	
	goto 红哨子走起2 
::蓝哨子走起::
	移动(208, 123)
::蓝哨子走起2::
	移动(208, 109)
	等待(1000)
	
	移动(203, 105)
	
	if(取当前地图名() ==  "？？？")then goto 武器技能 end
	
	goto 蓝哨子走起2 
::武器技能::
	
	等待到指定地图("？？？", 1)
	
	if("脚本参数","选择装备",==,铸剑,"铸剑路线5")
	if("脚本参数","选择装备",==,造斧,"造斧路线5")
	if("脚本参数","选择装备",==,造枪,"造枪路线5")
	if("脚本参数","选择装备",==,造弓,"造弓路线5")
	if("脚本参数","选择装备",==,造杖,"造杖路线5")
	if("脚本参数","选择装备",==,造小刀,"造小刀路线5")
	if("脚本参数","选择装备",==,造投掷武器,"造投掷武器路线5")
	
	goto 武器技能 

::造斧路线::--********************************************************************************
	
	移动(231, 163)
	移动(241, 173)
	移动(254, 173)
	移动(259, 178)
	移动(260, 178)
::多朗对话::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造斧路线2 end
	
	goto 多朗对话 
::造斧路线2::
	
	移动(260, 178)
	移动(259, 178)
	移动(259, 174)
	移动(271, 162)
	移动(271, 156)
::造斧道具店::
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造斧路线3::
	
	移动(274, 156)
	移动(271, 156)
	移动(271, 162)
	移动(259, 174)
	移动(259, 178)
	移动(260, 178)
::多朗对话2::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(红哨子) == 1)then goto 造斧路线4 end
	
	goto 多朗对话2 
::造斧路线4::
	
	移动(260, 178)
	移动(259, 178)
	移动(254, 173)
	移动(241, 173)
	移动(231, 163)
	移动(212, 163)--武器中转站
	移动(212, 133)
	移动(214, 131)
	移动(214, 107)
	移动(210, 103)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::造斧路线5::
	移动(349, 177)
::造斧山涛::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造斧路线6 end
	
	goto 造斧路线5 
::造斧路线6::
	
	set("chat")
	清除系统消息()
	喊话("造斧5C技能学习完毕。",01,05,05)
	结束脚本


::造枪路线::--********************************************************************************
	
	移动(212, 137)
	移动(181, 137)
::安凯兹对话::
	
	
	转向(6, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造枪路线2 end
	
	goto 安凯兹对话 
::造枪路线2::
	
	移动(181, 137)
	移动(212, 137)
	移动(212, 163)
::造枪道具店::
	移动(233, 163)
	移动(233, 156)
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造枪路线3::
	
	移动(274, 156)
	移动(233, 156)
	移动(233, 163)
	移动(212, 163)
	移动(212, 137)
	移动(181, 137)
::安凯兹对话2::
	
	
	转向(6, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(蓝哨子) == 1)then goto 造枪路线4 end
	
	goto 安凯兹对话2 
::造枪路线4::
	
	移动(181, 137)
	移动(212, 137)
	移动(212, 133)
	移动(214, 131)
	移动(214, 107)
	移动(210, 103)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::造枪路线5::
	移动(348, 173)
::造枪嵇康::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造枪路线6 end
	
	goto 造枪路线5 
::造枪路线6::
	
	set("chat")
	清除系统消息()
	喊话("造枪5C技能学习完毕。",01,05,05)
	结束脚本


::造弓路线::--********************************************************************************
	
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(211, 106)
	移动(211, 93)
	移动(191, 93)
	移动(191, 91)
::史特提对话::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造弓路线2 end
	
	goto 史特提对话 
::造弓路线2::
	
	移动(191, 91)
	移动(191, 93)
	移动(211, 93)
	移动(211, 106)
	移动(215, 110)
	移动(215, 130)
	移动(212, 133)
	移动(212, 163)
::造弓道具店::
	移动(233, 163)
	移动(233, 156)
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造弓路线3::
	
	移动(274, 156)
	移动(233, 156)
	移动(233, 163)
	移动(212, 163)
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(211, 106)
	移动(211, 93)
	移动(191, 93)
	移动(191, 91)
::史特提对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(红哨子) == 1)then goto 造弓路线4 end
	
	goto 史特提对话2 
::造弓路线4::
	
	移动(191, 93)
	移动(210, 93)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::造弓路线5::
	移动(345, 174)
::造弓阮咸::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造弓路线6 end
	
	goto 造弓路线5 
::造弓路线6::
	
	set("chat")
	清除系统消息()
	喊话("造弓5C技能学习完毕。",01,05,05)
	结束脚本

::造杖路线::--********************************************************************************
	
	移动(212, 137)
	移动(165, 137)
	移动(157, 129)
	移动(157, 122)
::葛龙对话::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造杖路线2 end
	
	goto 葛龙对话 
::造杖路线2::
	
	移动(157, 122)
	移动(157, 129)
	移动(165, 137)
	移动(212, 137)
	移动(212, 163)
::造杖道具店::
	移动(233, 163)
	移动(233, 156)
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造杖路线3::
	
	移动(274, 156)
	移动(233, 156)
	移动(233, 163)
	移动(212, 163)
	移动(212, 137)
	移动(165, 137)
	移动(157, 129)
	移动(157, 122)
::葛龙对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(蓝哨子) == 1)then goto 造杖路线4 end
	
	goto 葛龙对话2 
::造杖路线4::
	
	移动(157, 122)
	移动(157, 129)
	移动(165, 137)
	移动(212, 137)
	移动(212, 133)
	移动(214, 131)
	移动(214, 107)
	移动(210, 103)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::造杖路线5::
	移动(345, 170)
::造杖阮咸::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造杖路线6 end
	
	goto 造杖路线5 
::造杖路线6::
	
	set("chat")
	清除系统消息()
	喊话("造杖5C技能学习完毕。",01,05,05)
	结束脚本

::造小刀路线::--********************************************************************************
	
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(219, 106)
	移动(225, 106)
	移动(225, 92)
	移动(225, 72)
	移动(228, 69)
	移动(250, 69)
	移动(251, 70)
	移动(253, 70)
::库纳对话::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造小刀路线2 end
	
	goto 库纳对话 
::造小刀路线2::
	
	移动(246, 77)
	移动(245, 77)
	移动(240, 82)
	移动(240, 83)
	移动(238, 85)
	移动(237, 85)
	移动(225, 97)
	移动(225, 106)
	移动(219, 106)
	移动(215, 110)
	移动(215, 130)
	移动(212, 133)
	移动(212, 163)
::造小刀道具店::
	移动(233, 163)
	移动(233, 156)
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造小刀路线3::
	
	移动(274, 156)
	移动(233, 156)
	移动(233, 163)
	移动(212, 163)
	移动(212, 133)
	移动(215, 130)
	移动(215, 110)
	移动(219, 106)
	移动(225, 106)
	移动(225, 92)
	移动(225, 72)
	移动(228, 69)
	移动(250, 69)
	移动(251, 70)
	移动(253, 70)
::库纳对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(红哨子) == 1)then goto 造小刀路线4 end
	
	goto 库纳对话2 
::造小刀路线4::
	
	移动(251, 70)
	移动(250, 69)
	移动(229, 69)
	移动(222, 76)
	移动(210, 76)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 
::造小刀路线5::
	移动(352, 181)
::造小刀刘伶::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造小刀路线6 end
	
	goto 造小刀路线5 
::造小刀路线6::
	
	set("chat")
	清除系统消息()
	喊话("造小刀5C技能学习完毕。",01,05,05)
	结束脚本


::造投掷武器路线::--********************************************************************************
	
	移动(231, 163)
	移动(239, 155)
	移动(246, 155)
	移动(259, 142)
	移动(259, 139)
::拉其亚对话::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(订购单) == 1)then goto 造投掷武器路线2 end
	
	goto 拉其亚对话 
::造投掷武器路线2::
	
	移动(259, 139)
	移动(259, 156)
::造投掷武器道具店::
	移动(274, 156)
	移动(274, 148)
	移动(274, 147)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 道具店对话 
::造投掷武器路线3::
	
	移动(274, 156)
	移动(259, 156)
	移动(259, 139)
::拉其亚对话2::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(蓝哨子) == 1)then goto 造投掷武器路线4 end
	
	goto 拉其亚对话2 
::造投掷武器路线4::
	
	移动(259, 139)
	移动(259, 142)
	移动(246, 155)
	移动(231, 163)
	移动(212, 163)--武器中转站
	移动(212, 133)
	移动(214, 131)
	移动(214, 107)
	移动(210, 103)
	移动(210, 53)
	移动(211, 52)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 哨子四层 

::造投掷武器路线5::
	移动(342, 170)
::造投掷武器向秀::
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 造投掷武器路线6 end
	
	goto 造投掷武器路线5 
::造投掷武器路线6::
	
	set("chat")
	清除系统消息()
	喊话("造投掷武器5C技能学习完毕。",01,05,05)
	结束脚本

--********************************************************************************
--	
--	
--	转向(2, "")
--	等待服务器返回()
--	
--	对话选择("4", "", "")       --对话框选 是
--	等待服务器返回()
--	对话选择("32", "", "")  -- 对话框选 下一步
--	等待服务器返回()
--	对话选择("1", "", "")       --对话框选 确定
--	等待(1000)
--	
--********************************************************************************
::防具制作::
	
	喊话("到达第三层，选择防具制作路线。",01,05,05)
	
	移动(228, 194)
::史蒂文斯::
	
	
	转向(1, "")
	等待服务器返回()
	
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("32", "", "")  -- 对话框选 下一步
	等待服务器返回()
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(主从的炊帚) == 1)then goto 防具制作2 end
	
	goto 史蒂文斯 
::防具制作2::
	移动(228, 194)
	移动(228, 195)
	移动(223, 195)
	移动(219, 191)
	移动(219, 183)
	移动(212, 176)
	移动(212, 163)--中转站
::时间判断1::
	
	if("状态", "游戏时间", "==", "凌晨", "白天凌晨杰凯尔")
	if("状态", "游戏时间", "==", "白天", "白天凌晨杰凯尔")
	if("状态", "游戏时间", "==", "黄昏", "黄昏晚上杰凯尔")
	if("状态", "游戏时间", "==", "晚上", "黄昏晚上杰凯尔")
	
	goto 时间判断1 

::白天凌晨杰凯尔::
	
	移动(212, 153)
	移动(213, 152)
	移动(213, 124)
	移动(210, 121)
	移动(210, 61)
	移动(211, 60)
	移动(211, 46)
	移动(218, 46)
	移动(218, 47)
::白天凌晨杰凯尔2::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(工匠之证的模具甲) == 1)then goto 白天凌晨杰凯尔3 end
	
	goto 白天凌晨杰凯尔2 
::白天凌晨杰凯尔3::
	移动(218, 47)
	移动(218, 46)
	移动(211, 46)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 四层走路 

::黄昏晚上杰凯尔::
	移动(228, 163)
	移动(240, 151)
	移动(244, 151)
::黄昏晚上杰凯尔2::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(工匠之证的模具甲) == 1)then goto 黄昏晚上杰凯尔3 end
	
	goto 黄昏晚上杰凯尔2 
::黄昏晚上杰凯尔3::
	移动(244, 151)
	移动(240, 151)
	移动(228, 163)
	移动(212, 163)--中转
	移动(212, 153)
	移动(213, 152)
	移动(213, 124)
	移动(210, 121)
	移动(210, 61)
	移动(211, 60)
	移动(211, 46)
	移动(211, 29)
	移动(211, 28)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 四层走路 

::四层走路::
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	移动(202, 38)
	移动(202, 101)
	移动(202, 188)
	移动(193, 197)
	移动(193, 198)
::五层走路::
	
	等待到指定地图("黑历史之石洞　第５层", 1)
::时间判断2::
	
	if("状态", "游戏时间", "==", "凌晨", "白天凌晨海德尔")
	if("状态", "游戏时间", "==", "白天", "白天凌晨海德尔")
	if("状态", "游戏时间", "==", "黄昏", "黄昏晚上海德尔")
	if("状态", "游戏时间", "==", "晚上", "黄昏晚上海德尔")
	
	goto 时间判断2 

::白天凌晨海德尔::
	
	等待到指定地图("黑历史之石洞　第５层", 1)
	
	移动(231, 188)
	移动(231, 164)
	移动(237, 158)
	移动(237, 149)
	移动(243, 143)
	移动(243, 134)
	移动(246, 131)
	移动(260, 131)
::白天凌晨海德尔2::
	
	
	转向(1, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(工匠之证的模具乙) == 1)then goto 白天凌晨海德尔3 end
	
	goto 白天凌晨海德尔2 
::白天凌晨海德尔3::
	移动(260, 131)
	移动(246, 131)
	移动(243, 134)
	移动(243, 143)
	移动(237, 149)
	移动(237, 158)
	移动(231, 164)
	移动(231, 188)
	移动(228, 191)
	移动(227, 192)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 四层回去 

::黄昏晚上海德尔::
	
	等待到指定地图("黑历史之石洞　第５层", 1)
	
	移动(222, 192)
	移动(222, 185)
	移动(212, 175)
	移动(212, 159)
	移动(210, 157)
	移动(210, 74)
	移动(201, 74)
	移动(201, 61)
	移动(197, 61)
	移动(197, 59)
::黄昏晚上海德尔2::
	
	
	转向(1, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(工匠之证的模具乙) == 1)then goto 黄昏晚上海德尔3 end
	
	goto 黄昏晚上海德尔2 
::黄昏晚上海德尔3::
	移动(197, 59)
	移动(197, 61)
	移动(201, 61)
	移动(201, 74)
	移动(210, 74)
	移动(210, 157)
	移动(212, 159)
	移动(212, 175)
	移动(222, 185)
	移动(222, 192)
	移动(226, 192)
	移动(227, 192)
	
	等待到指定地图("黑历史之石洞　第４层", 1)
	
	goto 四层回去 

::四层回去::
	
	移动(193, 197)
	移动(202, 188)
	移动(202, 101)
	移动(202, 40)
	移动(205, 37)
	移动(205, 36)
	
	等待到指定地图("黑历史之石洞　第３层", 1)
	
::三层回去::
	移动(211, 60)
	移动(210, 61)
	移动(210, 121)
	移动(213, 124)
	移动(213, 152)
	移动(212, 153)
	移动(212, 163)--中转
	移动(212, 176)
	移动(219, 183)
	移动(219, 191)
	移动(228, 200)
	移动(228, 194)
::史蒂文斯回::
	
	
	转向(1, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取物品数量(防具工匠的证明) == 1)then goto 防具制作回 end
	
	goto 史蒂文斯回 
::防具制作回::
	
	移动(228, 202)
	移动(228, 203)
	
	等待到指定地图("黑历史之石洞　第２层", 1)
	
::二层回去::
	移动(133, 203)
	移动(138, 203)
	移动(154, 187)
	移动(154, 131)
	移动(154, 88)
	移动(154, 36)
	移动(154, 35)
	
	等待到指定地图("黑历史之石洞　第１层", 1)
	
::一层回去::
	移动(155, 67)
	移动(155, 78)
	移动(155, 84)
	移动(139, 100)
	移动(131, 100)
	移动(131, 123)
	移动(216, 123)
	移动(219, 120)
	移动(235, 120)
	移动(238, 123)
	移动(258, 123)
	移动(258, 75)
::守门人针山::
	
	
	转向(2, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	if(取当前地图名() ==  "？？？")then goto 防具技能 end
	
	goto 守门人针山 
::防具技能::
	
	移动(157, 139)
	
	if("脚本参数","选择装备",==,制衣服,"防具技能1")
	if("脚本参数","选择装备",==,制长袍,"防具技能1")
	if("脚本参数","选择装备",==,制鞋,"防具技能1")
	if("脚本参数","选择装备",==,制盾,"防具技能2")
	if("脚本参数","选择装备",==,制铠甲,"防具技能2")
	if("脚本参数","选择装备",==,制头盔,"防具技能2")
	if("脚本参数","选择装备",==,制靴,"防具技能3")
	if("脚本参数","选择装备",==,制帽子,"防具技能3")
	
	goto 防具技能 
::防具技能1::
	
	移动(165, 131)
	
	if("脚本参数","选择装备",==,制衣服,"制衣服路线")
	if("脚本参数","选择装备",==,制长袍,"制长袍路线")
	if("脚本参数","选择装备",==,制鞋,"制鞋路线")
	
	goto 防具技能1 
::防具技能2::
	
	移动(149, 131)
	
	if("脚本参数","选择装备",==,制盾,"制盾路线")
	if("脚本参数","选择装备",==,制铠甲,"制铠甲路线")
	if("脚本参数","选择装备",==,制头盔,"制头盔路线")
	
	goto 防具技能2 
::防具技能3::
	
	移动(149, 131)
	移动(157, 123)
	
	if("脚本参数","选择装备",==,制靴,"制靴路线")
	if("脚本参数","选择装备",==,制帽子,"制帽子路线")
	
	goto 防具技能3 

::制头盔路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制头盔技能学习。",01,05,05)
	移动(144, 130)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制头路线2 end
	
	goto 制头路线 
::制头路线2::
	
	set("chat")
	清除系统消息()
	喊话("制头5C技能学习完毕。",01,05,05)
	结束脚本

::制帽子路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制帽子技能学习。",01,05,05)
	移动(158, 122)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制帽子路线2 end
	
	goto 制帽子路线 
::制帽子路线2::
	
	set("chat")
	清除系统消息()
	喊话("制帽子5C技能学习完毕。",01,05,05)
	结束脚本

::制铠甲路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制铠甲技能学习。",01,05,05)
	移动(148, 126)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制铠甲路线2 end
	
	goto 制铠甲路线 
::制铠甲路线2::
	
	set("chat")
	清除系统消息()
	喊话("制铠甲5C技能学习完毕。",01,05,05)
	结束脚本

::制衣服路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制衣服技能学习。",01,05,05)
	移动(163, 126)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制衣服路线2 end
	
	goto 制衣服路线 
::制衣服路线2::
	
	set("chat")
	清除系统消息()
	喊话("制衣服5C技能学习完毕。",01,05,05)
	结束脚本


::制长袍路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制长袍技能学习。",01,05,05)
	移动(166, 126)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制长袍路线2 end
	
	goto 制长袍路线 
::制长袍路线2::
	
	set("chat")
	清除系统消息()
	喊话("制长袍5C技能学习完毕。",01,05,05)
	结束脚本

::制靴路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制靴技能学习。",01,05,05)
	移动(156, 122)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制靴路线2 end
	
	goto 制靴路线 
::制靴路线2::
	
	set("chat")
	清除系统消息()
	喊话("制靴5C技能学习完毕。",01,05,05)
	结束脚本

::制鞋路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制鞋技能学习。",01,05,05)
	移动(170, 130)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制鞋路线2 end
	
	goto 制鞋路线 
::制鞋路线2::
	
	set("chat")
	清除系统消息()
	喊话("制鞋5C技能学习完毕。",01,05,05)
	结束脚本

::制盾路线::--********************************************************************************
	
	set("chat")
	清除系统消息()
	喊话("制盾技能学习。",01,05,05)
	移动(151, 126)
	
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("1", "", "")       --对话框选 确定
	等待(1000)
	
	
	if(取当前地图名() ==  "黑历史之石洞　第１层")then goto 制盾路线2 end
	
	goto 制盾路线 
::制盾路线2::
	
	set("chat")
	清除系统消息()
	喊话("制盾5C技能学习完毕。",01,05,05)
	结束脚本
