生产二转,需要卡好交易再运行，提前设置全跑
 
--warpRoom = require("warpRoom")
--设置("高速延时",3) 
设置("自动加血",0)
设置("移动速度",120)
--导入脚本("脚本/直通车/传送之间.lua")

function TalkNpc(x,y)
	移动到目标附近(x,y,1)
	转向坐标(x,y)
	等待服务器返回()
	对话选择(1,0)
end
function main()
::StartBegin::			
	当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto kaishi  	
	elseif(当前地图名=="阿巴尼斯村的传送点" )then	
		goto chuCun  	
	elseif(当前地图名=="莎莲娜" )then	
		goto shaLianNa  	
	elseif(当前地图名=="魔法大学" )then	
		goto moDa  	
	elseif(当前地图名=="教师室" )then	
		goto jieRenWu  	
	end
	--warpRoom.toTeleRoom("阿巴尼斯村")
	
	等待(2000)	
	goto StartBegin
::kaishi::
	等待到指定地图("艾尔莎岛")	
	等待(500)
	移动(140,105)		
	转向(1)
	等待服务器返回()	
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")		
	移动(41,50)	
	等待到指定地图("里谢里雅堡 1楼")
	移动(45,20)
	等待到指定地图("启程之间")	
	移动(37, 4)
	转向坐标(38,4)		
	等待服务器返回()
	对话选择(4,-1)	
::chuCun::
	等待到指定地图("阿巴尼斯村的传送点")		
	移动(5,4)
	等待到指定地图("4313")		
	移动(6,13)	
	等待到指定地图("4312")
	移动(6, 13)
	等待到指定地图("阿巴尼斯村")
	移动(38, 71)
::shaLianNa::
	等待到指定地图("莎莲娜")
	移动(118, 100)
::moDa::
	等待到指定地图("魔法大学")
	移动(74,93)
	等待到指定地图("魔法大学内部")
	移动(4,30)
::jieRenWu::
	等待到指定地图("教师室")
	移动到目标附近(22,3,1)
::naZhiTiao::
	转向坐标(22,3)
	等待服务器返回()
	对话选择(4,-1)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(1,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(1,0)	
	if(取物品数量("考试用纸条") < 1)then
		goto naZhiTiao
	end
::StartTask::
	--棺木
	TalkNpc(5,4)	
	--木乃伊    
	TalkNpc(7,3)
	--医生
	移动(15,25)
	等待到指定地图("魔法大学内部")
	移动(14,43)
	等待到指定地图("调理室")	
	TalkNpc(17,6)
	--生命之花
	移动(12,18)
	等待到指定地图("魔法大学内部")
	TalkNpc(43,14)
	--花生油
	移动(40,59)
	等待到指定地图("魔法大学")
	TalkNpc(66,89)
	--犹大
	TalkNpc(106,158)
	--大地鼠
	TalkNpc(102,56)
	--鼠王
	移动(74,93)
	等待到指定地图("魔法大学内部")
	TalkNpc(35,44)
	--王冠
	移动(40,59)
	等待到指定地图("魔法大学")
	移动(117,156)
	等待到指定地图("仓库内部")
	TalkNpc(16,8)
	--冠军之戒
	移动(6,14)
	等待到指定地图("魔法大学")
	移动(116,132)
	移动(117,132)
	等待到指定地图("仓库内部")
	TalkNpc(14,9)
	--芥末
	移动(6,14)
	等待到指定地图("魔法大学")
	TalkNpc(46,155)
	--茉莉花茶
	移动(74,93)
	等待到指定地图("魔法大学内部")
	移动(44,17)
	等待到指定地图("礼堂")
	移动(4,10)
	等待到指定地图("学长室")
	TalkNpc(15,12)
	--茶壶
	移动(17,5)
	等待到指定地图("礼堂")
	移动(24,10)
	等待到指定地图("保健室")
	TalkNpc(12,8)
	--狐仙
	移动(3,5)
	等待到指定地图("礼堂")
	移动(14,32)
	等待到指定地图("魔法大学内部")
	移动(50,43)
	等待到指定地图("技术室")
	TalkNpc(6,8)
	--仙人考试官
	移动(7,18)
	等待到指定地图("魔法大学内部")
	移动(4,30)
	等待到指定地图("教师室")
	TalkNpc(21,3)
	喊话("捉迷藏和接字游戏任务完成,恭喜！！！可以去晋级了",2,3,5)
end
main()
	
