生产系1转全自动脚本，起点新旧城均可。建议等级25级以上，请设置好自动战斗遇敌全跑。注：如果没20级 请携带好本职业3级物品。维洞走小路，带够路桥费。

common=require("common")
设置("自动战斗",1)
设置("高速战斗",1)
设置("遇敌全跑",1)

设置("自动加血",0)
设置("移动速度",110)--速度还是110吧  120容易掉哦

::begin::	
	等待空闲()
	if(取物品数量(18320) > 0)then goto yiercun end--18320
	if(取物品数量(18321) > 0)then goto sllkc end--18321
	if(取物品数量(18322) > 0)then goto wryc end--18321
	if(取当前地图名() ==  "启程之间")then goto  warproom end
	if(取当前地图名() ==  "艾尔莎岛")then goto  aiersa end
	if(取当前地图名() ==  "里谢里雅堡")then goto libao end
	if(取当前地图名() ==  "维诺亚村")then goto weiCun end
	if(取当前地图名() ==  "维诺亚村的传送点")then goto dianxin end	
	回城()
	goto begin 
::aiersa::
	等待到指定地图("艾尔莎岛")	
	转向(1)
	等待服务器返回()
	对话选择("4", "", "")
::libao::
	等待到指定地图("里谢里雅堡")	
	自动寻路(41, 50,"里谢里雅堡 1楼")
	自动寻路(45, 20)
	goto warproom		
::warproom::
	等待到指定地图("启程之间")	
	自动寻路(8, 23)	
	转向(0, "")
	dlg=等待服务器返回()
	if(string.find(dlg.message,"此传送点的资格")~=nil)then
		日志(dlg.message,1)
		执行脚本("./脚本/直通车/★开传送-维诺亚生产小路.lua")
		goto dianxin
	end
	对话选择("4", "", "")	
	goto begin 
::yiercun::
	执行脚本("./脚本/直通车/★开传送-伊尔村.lua")
	等待到指定地图("伊尔村的传送点")	
	自动寻路(12, 17,"村长的家")
	自动寻路(6, 13,"伊尔村")
	自动寻路(32, 65,"旧金山酒吧")	
	trynum=0
	while trynum < 3 do
		自动寻路(15, 12)	
		转向(6)
		等待服务器返回()	
		对话选择("4", "", "")
		等待服务器返回()
		对话选择("1", "", "")
		if(取物品数量("点心？") > 0)then
			回城()
			goto begin
		end
		trynum = trynum +1
	end
	goto begin
::wryc::
	执行脚本("./脚本/直通车/★开传送-维诺亚生产小路.lua")
	goto dianxin
::dianxin:: 
	等待到指定地图("维诺亚村的传送点")		
	自动寻路(4,4)	
	等待(1500)	
	自动寻路( 5, 1,"村长家的小房间")		
	自动寻路( 0, 5,"村长的家")	
	自动寻路(10, 16,"维诺亚村")	
::weiCun::
	自动寻路(49, 58,"荷特尔咖哩店")	
	自动寻路(11, 9)
	自动寻路(11, 7)	
	if(取物品数量("18322") > 0)then
		转向(0)
		等待服务器返回()	
		对话选择("4", "", "")
		等待服务器返回()
		对话选择("1", "", "")
		日志("生成1转任务完成，可以去晋级了",1)
		return
	else
		trynum=0
		while trynum < 3 do
			自动寻路(11, 7)	
			转向(0)
			等待服务器返回()	
			对话选择("4", "", "")
			等待服务器返回()
			对话选择("1", "", "")
			if(取物品数量("18320") > 0)then
				回城()
				goto begin
			end
			trynum = trynum +1
		end
		goto begin		
	end
	
::sllkc::
	执行脚本("./脚本/直通车/★开传送-圣拉鲁卡村.lua")
	等待到指定地图("圣拉鲁卡村的传送点")	
	自动寻路(7, 3,"村长的家")
	自动寻路(2, 9,"圣拉鲁卡村")		
	自动寻路(50, 64,"食品店")	
	trynum=0
	while trynum < 3 do
		自动寻路(16, 8)	
		转向(4)
		等待服务器返回()	
		对话选择("4", "", "")
		等待服务器返回()
		对话选择("1", "", "")	
		if(取物品数量("18322") > 0)then
			回城()
			goto begin
		end
		trynum = trynum +1
	end
	goto begin	
	
	
	
	
	
