★起点艾尔莎岛登入点，圣、杰、阿巴、伊、亚、维、奇、加村传送开启脚本。不开传送的村子请设置为【已经】开启。



是否圣村=10000--用户输入框("是否【已经】开启圣拉鲁卡村，否填10000，是填0，", "10000")
是否杰村=10000--用户输入框("是否【已经】开启杰诺瓦村，否填10000，是填0，", "10000")
是否雪山=10000--用户输入框("是否【去】开启阿巴尼斯村，是填10000，否填0，", "10000")

       
::start::
	当前地图名=取当前地图名()
	if(当前地图名=="艾尔莎岛")then
		等待到指定地图("艾尔莎岛", 1)        
		转向(1)		-- 转向北
		等待服务器返回()
		对话选择(4, 0)
		等待到指定地图("里谢里雅堡", 1)	
		自动寻路(34,89)
		renew(1)			-- 转向北边恢复人宠血魔		
		自动寻路(41, 53)
	elseif(当前地图名=="杰诺瓦镇的传送点")then
		goto jnwcf
	elseif(当前地图名=="圣拉鲁卡村的传送点")then
		goto sccf
	end
	if(是否圣村 == 10000) then
		goto qusc
	elseif(是否杰村 == 10000) then
		goto chuansong
	elseif(是否雪山 == 10000) then
		goto chuansong	
	end	
::qusc::     
	自动寻路(17,53)
	等待到指定地图("法兰城")         
	自动寻路(22,88)
	等待到指定地图("芙蕾雅") 	
	自动寻路(134,219)
	等待到指定地图("圣拉鲁卡村")   
	自动寻路(49,81)
	等待到指定地图("村长的家")	      
	自动寻路(8,10)
	等待到指定地图("圣拉鲁卡村的传送点")	
	自动寻路(15, 4)	
	转向(0)
	等待(1000)
	if(是否杰村 == 10000)then
		goto sccf
	end  	
::xhxs::
	喊话("由于您杰诺瓦村已经开启传送，如需开启阿巴尼斯村传送，请重新执行脚本从杰诺瓦村出发!",2,3,5)
	等待(10000)
	goto xhxs
::sccf::	
	等待(1000)
	自动寻路(7, 3)
	等待到指定地图("村长的家")
	自动寻路(2, 9)
	等待到指定地图("圣拉鲁卡村")
	自动寻路(52, 54)	
	等待到指定地图("芙蕾雅")
    自动寻路(201, 166)	
	转向(0)
	等待服务器返回()		
	对话选择(1, 0)
	等待到指定地图("莎莲娜海底洞窟 地下1楼")        
    自动寻路(20, 8)
	等待到指定地图("莎莲娜海底洞窟 地下2楼")
	自动寻路(11, 9)
	等待到指定地图("莎莲娜海底洞窟 地下1楼")
	自动寻路(24, 11)
	等待到指定地图("莎莲娜")	
    自动寻路(217, 456)
	等待到指定地图("杰诺瓦镇")
    自动寻路(58, 43)
	等待到指定地图("村长的家")
	自动寻路(13, 7)
	等待到指定地图("杰诺瓦镇的传送点")
	自动寻路(6, 7)	
	转向(2)
	等待(1000)
	if(是否雪山 == 10000)then
		goto jnwcf
	end  	       
::xhxs3::
	喊话("由于您不需开启阿巴尼斯村传送，请重新执行脚本开启另外路线的传送!",2,3,5)
	等待(10000)
	goto xhxs3

::jnwcf::
	等待(1000)
   	自动寻路(14, 6)	
	等待到指定地图("村长的家")
	自动寻路(1, 9)	
	等待到指定地图("杰诺瓦镇")
	自动寻路(44, 33)	
	等待到指定地图("医院")	
    自动寻路(10, 5)
	renew(2)		
	等待(1000)    
    自动寻路(1, 9)	
	等待到指定地图("杰诺瓦镇")
	自动寻路(24, 39)	
	等待到指定地图("莎莲娜")
	自动寻路(235, 338)	
	等待到指定地图("莎莲娜西方洞窟")
	自动寻路(45, 9)	
	等待到指定地图(14001)
	自动寻路(57, 13)	
	等待到指定地图(14002)
	自动寻路(36, 7)	
	等待到指定地图("莎莲娜")	
    自动寻路(183, 161)	
	等待到指定地图("阿巴尼斯村")
	自动寻路(36, 54)	
	等待到指定地图("村长的家")
	自动寻路(6, 5)	
	等待到指定地图(4313)
	自动寻路(9, 9)	
	等待到指定地图("阿巴尼斯村的传送点")
	自动寻路(5, 14)	
	转向(4)
	等待(1000)        
::xhxs1::
	喊话("请重新执行脚本开启另外的传送路线!",2,3,5)
	等待(10000)
	goto xhxs1

::chuansong::
	自动寻路(41, 50)	
	等待到指定地图("里谢里雅堡 1楼")
	自动寻路(45, 20)	
	等待到指定地图("启程之间")	
	等待(3000)
	自动寻路(25, 29)
	if(是否杰村 == 10000) then
		goto shengcun
	elseif(是否雪山 == 10000) then
		goto jiecun
	end	
::shengcun::	
	自动寻路(44, 44)	
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	goto sccf
::mfgcs1::       
	转向(2)
	等待服务器返回()	
	对话选择(4, 0)
	等待服务器返回()
	对话选择(1, 0)        
	goto sccf
::jiecun::
	自动寻路(15, 4) 	
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	goto jnwcf
