设置脚本简介("新城启动或营地启动，设置好自动逃跑..")
设置("timer",100)

function 去矮人()
::dengru::
	local 当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto star1
	elseif (当前地图名=="里谢里雅堡" )then	
		goto star2
	elseif (当前地图名=="圣骑士营地" )then	
		goto dao
	end	 
::star1::
	自动寻路(140,105)
	等待(500)
	面向("东北")
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")	
	自动寻路(41,82)
    goto begin
::star2::	
	等待到指定地图("里谢里雅堡")	
	自动寻路(41,82)
    goto begin
::begin::
	等待到指定地图("里谢里雅堡",41,82)
	自动寻路(41,98)	
	等待到指定地图("法兰城")	
	自动寻路(153,241)	
	等待到指定地图("芙蕾雅")	
	自动寻路(513,282)	
	等待(1000)	
	等待到指定地图("曙光骑士团营地")	
	自动寻路(55,47)	
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",1,10)
	自动寻路(7,4)	
	等待到指定地图("辛希亚探索指挥部",91,6)
	自动寻路(95,9)
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",19,28)	
	自动寻路(19,30)
	自动寻路(7,22)  	
	面向("北")		-- 转向北	
	等待(2000)
	goto dao
::dao::
	喊话("去矮人城堡喽",2,3,5)	
	等待(1000)	
	自动寻路(36, 87)
	等待到指定地图("肯吉罗岛")	
	自动寻路(384, 245)
	等待到指定地图("蜥蜴洞穴")	
	自动寻路(12, 2)
	等待到指定地图("肯吉罗岛", 307, 362)	
	自动寻路(231, 434)
	等待到指定地图("矮人城镇", 110, 191)
	自动寻路(110, 134)
	自动寻路(97, 134)
	自动寻路(97, 124)	
	面向("西")
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(32,0)	
	等待服务器返回()
	对话选择(1,0)	
::han::
	喊话("OY",2,3,5)
	等待(1000)

end
去矮人()