★起点艾尔莎岛登入点，阿村传送开启脚本。



       
::begin::
	当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto aiersa  
	elseif (当前地图名=="里谢里雅堡" )then	
		goto libao  	
	elseif(当前地图名=="杰诺瓦镇的传送点") then
		goto jlwc	
	elseif (当前地图名=="启程之间" )then	
		goto warproom  	
	end	
	回城()
	等待(1000)
	goto begin	
	
::aiersa::
	if(取当前地图名()~="艾尔莎岛")then	goto begin end
	移动(140,105)
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)	
::libao::
	if(取当前地图名()~="里谢里雅堡")then	goto begin end
	移动(34,89)
	回复(1)	
	移动(41,50,"里谢里雅堡 1楼")	
	移动(45,20,"启程之间")	
::warproom::
	移动(15, 4)	
	离开队伍()
	转向(2)
	dlg=等待服务器返回()
	if(dlg.message~=nil and (string.find(dlg.message,"此传送点的资格")~=nil or string.find(dlg.message,"很抱歉")~=nil or string.find(dlg.message,"不能使用这个传送石")~=nil))then
		执行脚本("./脚本/直通车/★开传送-杰诺瓦镇.lua")
		goto jlwc
	end		
	转向(2)
	等待服务器返回()
	对话选择(4,0)
::jlwc::
	等待到指定地图("杰诺瓦镇的传送点")
	移动(6, 7)	
	转向(2)
	等待(1000)	
   	移动(14, 6,"村长的家")
	移动(1, 9,"杰诺瓦镇")
	移动(44, 33,"医院")	
    移动(10, 5)
	回复(2)		
	等待(1000)    
    移动(1, 9,"杰诺瓦镇")
	移动(24, 39,"莎莲娜")
	移动(235, 338,"莎莲娜西方洞窟")
	移动(45, 9,14001)
	移动(57, 13,14002)
	移动(36, 7,"莎莲娜")	
    移动(183, 161,"阿巴尼斯村")
	移动(36, 54,"村长的家")
	移动(6, 5,4313)
	移动(9, 9,"阿巴尼斯村的传送点")
	移动(5, 14)	
	转向(4)
	等待(1000)        
