★起点艾尔莎岛登入点，维村传送开启脚本。


function main()
::begin::
	当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto aiersa  
	elseif (当前地图名=="里谢里雅堡" )then	
		goto libao  	
	elseif(当前地图名=="维诺亚村的传送点") then
		goto weiCun	
	end	
	回城()
	等待(1000)
	goto begin	

::aiersa::
	等待到指定地图("艾尔莎岛")		
	自动寻路(140,105)
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)	
::libao::
	等待到指定地图("里谢里雅堡")	
	自动寻路(34,89)
	回复(1)	
::quwnyc::
	自动寻路(41, 98,"法兰城")
	自动寻路(153, 241,"芙蕾雅")	
	自动寻路(474, 316)	
	自动寻路(473, 316)	
	对话选是(472,316)	
	等待到指定地图("维诺亚洞穴 地下1楼")	
    自动寻路(20, 59,"维诺亚洞穴 地下2楼")
	自动寻路(24, 81,"维诺亚洞穴 地下3楼")	
    自动寻路(26, 64,"芙蕾雅")	
	自动寻路(330, 480,"维诺亚村")		
	自动寻路(40, 36,"村长的家")
	自动寻路(18, 10,"村长家的小房间")
	自动寻路(8, 2,"维诺亚村的传送点")	
::weiCun::
	等待到指定地图("维诺亚村的传送点")	
	自动寻路(5, 5)	
	转向(0)
	等待(1000)	
end
main()