启动地点，法兰，艾尔莎岛，哥拉尔传送石。阿凯鲁法只支持记忆。


	清除系统消息()
	if(取当前地图名() ==  "哥拉尔镇")then goto   star3 end
::begin::
	if(人物("坐标")  == "99,165")then	goto  jiyi end
	if(取当前地图名() ==  "艾尔莎岛")then goto   star1 end
	if(取当前地图名() ==  "铁达尼号")then goto   tdn1 end
	if(取当前地图名() ==  "往哥拉尔栈桥")then goto   glezq end
	if(取当前地图名() ==  "往阿凯鲁法栈桥")then goto   aklfzq end
	if(人物("坐标")  == "72,123")then	goto  w2 end	-- 西2登录点
	if(人物("坐标")  == "233,78")then	goto  e2 end	-- 东2登录点
	if(人物("坐标")  == "162,130")then	goto  s2 end	-- 南2登录点
	if(人物("坐标")  == "63,79")then	goto  w1 end		-- 西1登录点
	if(人物("坐标")  == "242,100")then	goto  e1 end	-- 东1登录点
	if(人物("坐标")  == "141,148")then	goto  s1 end	-- 南1登录点
	goto begin 

::jiyi::
    if(取物品数量( "吉比雷的帽子") >  0)then goto  i333 end	
	if(取物品数量("黑之记忆") > 0)then goto  hei end
	if(取物品数量("白之记忆") > 0)then goto  bai end
	goto begin 
::hei::	
	使用物品("黑之记忆")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("黑之祭坛", 1)	
	自动寻路(23, 18)	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("召唤之间", 1)	
	自动寻路(7,14)
	自动寻路(7,15)
	自动寻路(3,15)
    自动寻路(3,8)
	自动寻路( 3, 7)	
	等待到指定地图("里谢里雅堡", 1)	
	goto i00 
::bai::	
	使用物品("白之记忆")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("白之祭坛")	
	自动寻路(22, 26)	
	转向(5, "")
	等待服务器返回()
	对话选择("4", "", "")	
	等待到指定地图("召唤之间", 1)	
	自动寻路(7,14)
	自动寻路(7,15)
	自动寻路(3,15)
	自动寻路(3,8)
	自动寻路( 3, 7)	
	等待到指定地图("里谢里雅堡", 1)

::i00::
	等待到指定地图("里谢里雅堡", 47, 85)
	自动寻路(47, 90)
	自动寻路(51,90)
	自动寻路(51,93)
	goto goto2 

::w2::	-- 西2登录点
	转向(2, "")		-- 转向东	
	等待到指定地图("法兰城",233,78)	
	转向(0, "")		-- 转向北	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 			
::e2::	-- 东2登录点
	转向(0, "")		-- 转向北	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 			
::s2::	-- 南2登录点
	等待到指定地图("法兰城", 162, 130)	
	自动寻路(153,130)
	goto begin_1 		
::w1::	-- 西1登录点
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 242, 100)	
	转向(2, "")		-- 转向东	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::e1::	-- 东1登录点
	转向(2, "")		-- 转向东	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")		-- 转向北	
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::s1::	-- 南1登录点
	等待到指定地图("法兰城", 141, 148)	
	自动寻路(153,148)
	自动寻路(153,130)
	goto begin_1 				

::begin_1::
	自动寻路(153, 105)	
	自动寻路( 153, 100)	
	等待到指定地图("里谢里雅堡", 1)
	自动寻路(41, 69)
	goto goto2 


::star1::
	自动寻路(140,105)
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("里谢里雅堡")
	转向(2, "")
	自动寻路(28, 82)
::goto2::
	自动寻路(41, 69)
	自动寻路(41,51)
	自动寻路(41,50)
	等待到指定地图("里谢里雅堡 1楼", 1)
	自动寻路(74,30)
	自动寻路(68,24)
	自动寻路(49,24)
	自动寻路(45,20)
	等待到指定地图("启程之间", 1)
	自动寻路(25, 27)
	自动寻路(33, 27)
	自动寻路(34, 27)
	自动寻路(34, 32)
	自动寻路(34, 33)
	自动寻路(42, 33)
	自动寻路(43, 33)
	if(取物品数量( "传送石优待卷") >  0)then goto  aaa end		
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")	
	goto ylt 
::aaa::
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
::ylt::
	等待到指定地图("伊尔村的传送点")	
	自动寻路(12, 19)
	自动寻路(12, 17)
	等待到指定地图("村长的家")	
	自动寻路(8, 13)
	自动寻路(6, 13)
	等待到指定地图("伊尔村")	
	自动寻路(53, 71)
	自动寻路(58, 71)
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("伊尔", 1)
	自动寻路(22, 20)
	自动寻路(29, 21)
	自动寻路(30, 21)
	等待到指定地图("港湾管理处", 1)
	自动寻路(16, 22)
	自动寻路(19, 25)
	if(取物品数量( "吉比雷的帽子") >  0)then goto  i111 end	
	自动寻路(25, 25)
	转向(0, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
::glezq::
	等待到指定地图("往哥拉尔栈桥")	
	自动寻路(51, 50)
::gle::
	if(人物("坐标") ~= "51,50")then 自动寻路(51, 50) end
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待(15000)
	if(取当前地图名() == "铁达尼号")then goto  tdn end
	goto gle 
::tdn::
	清除系统消息()
	等待(150000)
::tdn1::
	if(string.find(聊天(50),"本船已到达了哥拉尔港")~=nil)then goto xia	end
	等待(3000)
	goto tdn1 
::xia::
	自动寻路(70, 26)
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")	
	if(取当前地图名() == "往伊尔栈桥")then goto  tig end
	goto xia 
::tig::	
	自动寻路(84,55)
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("哥拉尔镇 港湾管理处")	
	自动寻路(14,15,"哥拉尔镇")	
	自动寻路(118,214)
	转向(2)
	等待到指定地图("哥拉尔镇")
::star3::
	if(取物品数量( "吉比雷的胃肠药") >  0)then goto  i222 end		
	自动寻路(89,64,"民家")
	自动寻路(8,5)
	转向(6)
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")	
	自动寻路(9,19,"哥拉尔镇")
	自动寻路(169,114)
	转向(2)
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	回城()
	goto begin 
::i111::
	自动寻路(23, 25)
	转向(0, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("4", "", "")
::aklfzq::
	等待到指定地图("往阿凯鲁法栈桥")	
	自动寻路(51, 50)	
::TOA::
	转向(2, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待(15000)
	if(取当前地图名() == "艾欧奇亚号")then goto  aoqy end
	goto TOA 
::aoqy::
	清除系统消息()
	等待(150000)
::aoqy1::
	if(string.find(聊天(50),"本船已到达了阿凯鲁法港")~=nil)then goto  xia1	end
	goto aoqy1 
::xia1::
	自动寻路(70, 26)
	转向(2)
	等待服务器返回()
	对话选择("4", "", "")
	等待(15000)
	if(取当前地图名() == "往伊尔栈桥")then goto  toa end
	goto xia1 
::toa::
	等待到指定地图("往伊尔栈桥", 50, 49)	
	自动寻路(19, 54)
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("港湾管理处", 1)		
	自动寻路(22, 31,"阿凯鲁法")		
	自动寻路(28,31)
	转向(1)
	等待服务器返回()
	对话选择("4", "", "")
	等待到指定地图("阿凯鲁法村")	
::i444::		
	自动寻路(228,200)
	转向(4, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()

	对话选择("32", "", "")
	等待服务器返回()

	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	等待(1000)
	回城()
	等待(1000)
	goto begin 

::i333::	
	自动寻路(90,185)
	goto i444 

::i222::		
	自动寻路(169,114)
	转向(2, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")		
	自动寻路(89,64,"民家")
	自动寻路(8,5)
	转向(6, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")		
	自动寻路(16,3)
	转向(6)
	等待服务器返回()
	对话选择("4", "", "")		
	自动寻路(9,19,"哥拉尔镇")	
	自动寻路(120,107)	
	转向(0)	
	等待到指定地图("哥拉尔镇", 118, 214)
	自动寻路(140,214,"白之宫殿")
	自动寻路(45,37)
	自动寻路(47,36,"白之宫殿")
	自动寻路(36,51,"谒见之间")
	自动寻路(57,45)
	转向(3, "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")	
	自动寻路(15,45,"白之宫殿")
	自动寻路(32,46)
	自动寻路(10,46)
	移动一格(6)
	等待到指定地图("白之宫殿")
	移动一格(6)	
	自动寻路(23,38)
	自动寻路(22,38)
	等待到指定地图("哥拉尔镇")	
	自动寻路(118,216)
	自动寻路(118,214)
	转向(2)
	等待到指定地图("哥拉尔镇", 120,107)
	自动寻路(118,107)
	自动寻路(118,106)
	转向(0, "")
	等待服务器返回()
	对话选择("4", "", "")











