走路去辛梅尔脚本支持任意地点启动，支持黑白记忆，请设置好自动战斗脚本支持任意地点启动，支持黑白记忆，请设置好自动战斗



::begin::	
	x,y=取当前坐标()
	if(取当前地图名() == "艾尔莎岛") then
		goto Start
	elseif (x==99 and y==165 )then	-- jiyi
		goto  jiyi
	elseif (x==120 and y==107 )then	-- jiyi
		goto  jiyi		
	elseif (x==72 and y==123 )then	-- 西2登录点
		goto  w2
	elseif (x==233 and y==78 )then	-- 东2登录点
		goto  e2
	elseif (x==162 and y==130 )then	-- 南2登录点
		goto  s2
	elseif (x==63 and y==79 )then	-- 西1登录点
		goto  w1
	elseif (x==242 and y==100 )then	-- 东1登录点
		goto  e1
	elseif (x==141 and y==148 )then	-- 南1登录点
		goto  s1
	end		
	回城()
	等待(2000)	
	goto begin
::jiyi::
	if(取物品数量("黑之记忆") > 0 )then 
		goto hei
	elseif(取物品数量("白之记忆") > 0 )then 
		goto bai
	end
	goto begin
::hei::	
	使用物品("黑之记忆")
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("黑之祭坛", 1)	
	自动寻路(23, 18)	
	转向(1)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("召唤之间", 1)		
	自动寻路( 3, 7)	
	等待到指定地图("里谢里雅堡", 1)	
	goto liBao

::bai::	
	使用物品("白之记忆")
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("白之祭坛", 1)	
	自动寻路(22, 26)	
	转向(5)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("召唤之间", 1)
	自动寻路( 3, 7)	
	等待到指定地图("里谢里雅堡", 1)
::liBao::
	等待到指定地图("里谢里雅堡", 47, 85)	
	自动寻路(51,93)	
    goto Go2

::w2::	-- 西2登录点
	转向(2, "")	
	等待到指定地图("法兰城",233,78)

::e2::	-- 东2登录点
	转向(0, "")	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)
	转向(0, "")

::s2::	-- 南2登录点	
	等待到指定地图("法兰城",162,130)	
	自动寻路(153,130)
	goto Go

::w1::	-- 西1登录点
	转向(0, "")	
	等待到指定地图("法兰城", 242, 100)	

::e1::	-- 东1登录点
	转向(2, "")	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0, "")
::s1::	-- 南1登录点	
	等待到指定地图(法兰城,141,148)
	自动寻路(153,148)
::Go::	
	自动寻路(153,100)
	等待到指定地图("里谢里雅堡", 1)	
::Go2::    	
	自动寻路(28,88)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("？")	
	自动寻路(19, 20)
	移动一格(4)		
	等待到指定地图("法兰城遗迹")		
	自动寻路(98, 138)
	等待到指定地图("盖雷布伦森林")		
	自动寻路(124, 168)
	等待到指定地图("温迪尔平原")		
	自动寻路(264, 108)	
	等待到指定地图("艾尔莎岛")	
	自动寻路(140,105)
::Start::
	等待到指定地图("艾尔莎岛")		
	自动寻路(144,105)
	自动寻路(157,93)
	转向(2, "")	
	等待到指定地图("艾夏岛", 1)	
	转向(6, "")
	等待到指定地图("艾夏岛", 164,159)	
	转向(7, "")
	等待到指定地图("艾夏岛", 151,97)
	自动寻路(190,115)	
	等待到指定地图("盖雷布伦森林", 1)
	自动寻路(231,222)	
	等待到指定地图("布拉基姆高地", 1)--31,192	
	自动寻路(231,165)
	等待到指定地图("洞窟之村　第１层")	
	自动寻路(203,100)
	等待到指定地图("洞窟之村　第２层")	
	自动寻路(209,214)
	等待到指定地图("洞窟之村　第３层")
	自动寻路(80,117)
	等待到指定地图("布拉基姆高地")
	自动寻路(277,129)
	等待到指定地图("丘斯特村")	
	自动寻路(130,88)
	转向(2)
	等待服务器返回()
	对话选择(32, 0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("丘斯特村")
	自动寻路(26,19)
::gle::
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待(15000)
	if(取当前地图名() == "修拉特瓦尔号")then
		goto tdn
	end			
	goto gle
::tdn::
	等待(150000)
::tdn1::
	if(string.find(最新系统消息(),"本船已到达了辛梅尔港")~=nil)then
		goto xia
	end   	
	goto tdn1
::xia::
	自动寻路(18,18)
	转向(4)
	等待服务器返回()
	对话选择(4, 0)
	等待(15000)
	if(取当前地图名() == "辛梅尔")then
		goto tig
	end			
	goto xia
::tig::
	自动寻路(18,18)
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("辛梅尔")







