★起点艾尔莎岛登入点，圣、杰、阿巴、伊、亚、维、奇、加村传送开启脚本。不开传送的村子请设置为【已经】开启。



是否圣村=用户输入框("是否【已经】开启圣拉鲁卡村，否填10000，是填0，", "10000")
是否杰村=用户输入框("是否【已经】开启杰诺瓦村，否填10000，是填0，", "10000")
是否雪山=用户输入框("是否【去】开启阿巴尼斯村，是填10000，否填0，", "10000")
是否12村=用户输入框("是否【已经】开启伊尔村，否填10000，是填0，", "10000")
是否亚村=用户输入框("是否【已经】开启亚留特村，否填10000，是填0，", "10000")
是否唯村=用户输入框("是否【已经】开启维诺亚村，否填10000，是填0，", "10000")
是否奇村=用户输入框("是否【已经】开启奇利村，否填10000，是填0，", "10000")
是否加村=用户输入框("是否【去】开启加纳村，是填10000，否填0，", "10000")

喊话("全岛各村传送开启脚本开始运行，请看清楚脚本说明",2,3,5)
等待(2000)    
喊话("开启奇利村要有热砂戒指，没有戒指将无法通过海底",2,3,5)
等待(2000)
等待(1000)
       
::start::
	等待到指定地图("艾尔莎岛", 1)        
	转向(1)		-- 转向北
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("里谢里雅堡", 1)	
	移动(34,89)
	renew(1)			-- 转向北边恢复人宠血魔		
	移动(41, 53)
	if(是否圣村 == 10000) then
		goto qusc
	elseif(是否杰村 == 10000) then
		goto chuansong
	elseif(是否雪山 == 10000) then
		goto chuansong
	elseif(是否12村 == 10000) then
		goto qu12c
	elseif(是否亚村 == 10000) then
		goto chuansong
	elseif(是否唯村 == 10000) then
		goto quwnyc
	elseif(是否奇村 == 10000) then
		goto chuansong
	elseif(是否加村 == 10000) then
		goto chuansong
	end	
::qusc::     
	移动(17,53)
	等待到指定地图("法兰城")         
	移动(22,88)
	等待到指定地图("芙蕾雅") 	
	移动(134,219)
	等待到指定地图("圣拉鲁卡村")   
	移动(49,81)
	等待到指定地图("村长的家")	      
	移动(8,10)
	等待到指定地图("圣拉鲁卡村的传送点")	
	移动(15, 4)	
	转向(0)
	等待(1000)
	if(是否杰村 == 10000)then
		goto sccf
	end  	
::xhxs::
	喊话("由于您杰诺瓦村已经开启传送，如需开启阿巴尼斯村传送，请重新执行脚本从杰诺瓦村出发!",2,3,5)
	等待(10000)
	goto xhxs
::sccf::	
	等待(1000)
	移动(7, 3)
	等待到指定地图("村长的家")
	移动(2, 9)
	等待到指定地图("圣拉鲁卡村")
	移动(52, 54)	
	等待到指定地图("芙蕾雅")
    移动(201, 166)	
	转向(0)
	等待服务器返回()		
	对话选择(1, 0)
	等待到指定地图("莎莲娜海底洞窟 地下1楼")        
    移动(20, 8)
	等待到指定地图("莎莲娜海底洞窟 地下2楼")
	移动(11, 9)
	等待到指定地图("莎莲娜海底洞窟 地下1楼")
	移动(24, 11)
	等待到指定地图("莎莲娜")	
    移动(217, 456)
	等待到指定地图("杰诺瓦镇")
    移动(58, 43)
	等待到指定地图("村长的家")
	移动(13, 7)
	等待到指定地图("杰诺瓦镇的传送点")
	移动(6, 7)	
	转向(2)
	等待(1000)
	if(是否雪山 == 10000)then
		goto jnwcf
	end  	       
::xhxs3::
	喊话("由于您不需开启阿巴尼斯村传送，请重新执行脚本开启另外路线的传送!",2,3,5)
	等待(10000)
	goto xhxs3

::jnwcf::
	等待(1000)
   	移动(14, 6)	
	等待到指定地图("村长的家")
	移动(1, 9)	
	等待到指定地图("杰诺瓦镇")
	移动(44, 33)	
	等待到指定地图("医院")	
    移动(10, 5)
	renew(2)		
	等待(1000)    
    移动(1, 9)	
	等待到指定地图("杰诺瓦镇")
	移动(24, 39)	
	等待到指定地图("莎莲娜")
	移动(235, 338)	
	等待到指定地图("莎莲娜西方洞窟")
	移动(45, 9)	
	等待到指定地图(14001)
	移动(57, 13)	
	等待到指定地图(14002)
	移动(36, 7)	
	等待到指定地图("莎莲娜")	
    移动(183, 161)	
	等待到指定地图("阿巴尼斯村")
	移动(36, 54)	
	等待到指定地图("村长的家")
	移动(6, 5)	
	等待到指定地图(4313)
	移动(9, 9)	
	等待到指定地图("阿巴尼斯村的传送点")
	移动(5, 14)	
	转向(4)
	等待(1000)        
::xhxs1::
	喊话("请重新执行脚本开启另外的传送路线!",2,3,5)
	等待(10000)
	goto xhxs1
::qu12c::
    移动(65, 53)
	等待到指定地图("法兰城")
	移动(281, 88)	
	等待到指定地图("芙蕾雅")
	移动(681, 343)	
	等待到指定地图("伊尔村")	
    移动( 47, 83)	
	等待到指定地图("村长的家")	    
	移动( 14, 17)	
	等待到指定地图("伊尔村的传送点")	
    移动(20, 10)	
	转向(2)
	等待(1000)
::yierccf::
	等待(1000)	       
	移动( 12, 17)
	等待到指定地图("村长的家")
	移动( 6, 13)	
	等待到指定地图("伊尔村")
	移动( 45, 31)	
	等待到指定地图("芙蕾雅")	 
	移动( 672, 223)	
	等待到指定地图("哈巴鲁东边洞穴 地下1楼")		
	移动( 41, 8)	
	等待到指定地图("哈巴鲁东边洞穴 地下2楼")		       
	移动( 17, 18)	
	方向穿墙(0,3)	
	等待(1000)   	       
	移动( 16, 11)
	等待到指定地图("哈巴鲁东边洞穴 地下1楼")      
	移动( 30, 4)	
	等待到指定地图("芙蕾雅")	
	移动( 595, 84)	
	等待到指定地图("亚留特村")
	移动( 56, 48)
	等待到指定地图("村长的家")	
    移动( 22, 9)
	等待到指定地图("亚留特村的传送点")
	移动(5, 15)	
	转向(0)
	等待(1000)
    goto xhxs1
::quwnyc::
	移动(41, 98)	
	等待到指定地图("法兰城")
	移动(153, 241)	
	等待到指定地图("芙蕾雅")	
	移动(474, 316)	
	移动一格(6)    		
	转向(6)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("维诺亚洞穴 地下1楼")	
    移动(20, 59)	
	等待到指定地图("维诺亚洞穴 地下2楼")
	移动(24, 81)	
	等待到指定地图("维诺亚洞穴 地下3楼")	
    移动(26, 64)	
	等待到指定地图("芙蕾雅")	
	移动(330, 480)	
	等待到指定地图("维诺亚村")		
	移动(40, 36)	
	等待到指定地图("村长的家")
	移动(18, 10)	
	等待到指定地图("村长家的小房间")
	移动(8, 2)	
	等待到指定地图("维诺亚村的传送点")	
	移动(5, 5)	
	转向(0)
	等待(1000)
	if(取物品数量("欧兹尼克的戒指") < 1)then
		goto qilicun2
	elseif(是否奇村 == 10000)then
		goto wnycf
	end    
::xhxs7::
    喊话("由于您不需开启奇利村传送，请重新执行脚本开启另外路线的传送!",2,3,5)
	等待(10000)
	goto xhxs7

::wnycf::
	等待(1000)
	移动(5, 1)	
	等待到指定地图("村长家的小房间")	
    移动(0, 5)	
	等待到指定地图("村长的家")	
    移动(9, 16)	
	等待到指定地图("维诺亚村")
	移动(67, 46)	
	等待到指定地图("芙蕾雅")
	移动(343, 497)	
	等待到指定地图("索奇亚海底洞窟 地下1楼")
	移动(18, 34)	
	等待到指定地图("索奇亚海底洞窟 地下2楼")	
    移动(27, 29)	
	等待到指定地图("索奇亚海底洞窟 地下1楼")
	移动(7, 37)	
	等待到指定地图("索奇亚海底洞窟 地下1楼")		
	转向(2)
	等待服务器返回()
	对话选择(1,0)
	等待服务器返回()
	对话选择(4, 0)	
	等待到指定地图("索奇亚")
	移动(274, 294)
	等待到指定地图("奇利村")
	移动(50, 63)	
	等待到指定地图("村长的家")
	移动(10, 15)	
	等待到指定地图("村长的家")
	移动(5, 3)	
	等待到指定地图("奇利村的传送点")
	移动(13, 9)	
	转向(0)
	等待(1000)
	if(是否加村 == 10000)then
		goto qlcf
	end      
::xhxs9::
	喊话("由于您不需开启加纳村传送，脚本到此结束!",2,3,5)
	等待(10000)
	goto xhxs9

::qlcf::
	等待(1000)
    移动(7, 6)	
	等待到指定地图("村长的家")	
    移动(7, 1)	
	等待到指定地图("村长的家")
	移动(1, 8)	
	等待到指定地图("奇利村")	
    移动(79, 76)	
	等待到指定地图("索奇亚")
	移动(356, 334)	
	等待到指定地图("角笛大风穴")
	移动(133, 26)	
	等待到指定地图("索奇亚")	
    移动(529, 328)	
	等待(1000)
    喊话("要学乱射的速度!10秒后出发!",2,3,5)
	等待(10000)
	等待(1000)
	喊话("现在向加纳村出发!",2,3,5)
	等待(1000)
    移动(704, 147)	
	等待到指定地图("加纳村")
	移动(36, 40)	
	等待到指定地图("村长的家")
	移动(17, 6)	
	等待到指定地图("加纳村的传送点")
	移动(14, 7)	
	转向(2)
	等待(1000)        
::xhxs0::
	喊话("全部传送已开启，脚本到此结束!",2,3,5)
	等待(10000)
	goto xhxs0

::chuansong::
	移动(41, 50)	
	等待到指定地图("里谢里雅堡 1楼")
	移动(45, 20)	
	等待到指定地图("启程之间")	
	等待(3000)
	移动(25, 29)
	if(是否杰村 == 10000) then
		goto shengcun
	elseif(是否雪山 == 10000) then
		goto jiecun
	elseif(是否亚村 == 10000) then
		goto yacun
	elseif(是否奇村 == 10000) then
		goto qilicun
	elseif(是否加村 == 10000) then
		goto jianacun
	end	
::shengcun::	
	移动(44, 44)	
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	goto sccf
::mfgcs1::       
	转向(2)
	等待服务器返回()	
	对话选择(4, 0)
	等待服务器返回()
	对话选择(1, 0)        
	goto sccf
::jiecun::
	移动(15, 4) 	
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	goto jnwcf
::yacun::
	移动(44, 33)
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	goto yierccf
::qilicun2::
	喊话("由于没有欧兹尼克的戒指，所以无法通过海底，脚本到此结束!",2,3,5)
	等待(1000)
	等待(10000)
	goto qilicun2
::qilicun::
	if(取物品数量("欧兹尼克的戒指") <  1)then
		goto qilicun2
	end
	移动(8, 23)	
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	goto wnycf
::jianacun::
	移动(8, 33)
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	goto qlcf