超级便民公交车----法兰城至艾尔沙岛v1.0    起点：法兰城靠平民店传送石162, 130！


喊话("欢迎使用 超级便民公交车”之“法兰城→艾尔沙岛",2,3,5)
::StartBegin::
	x,y=取当前坐标()	
	if(取当前地图名() == "艾尔莎岛") then
		goto DingJu
	elseif (x==72 and y==123 )then	-- 西2登录点
		goto  w2
	elseif (x==233 and y==78 )then	-- 东2登录点
		goto  e2
	elseif (x==162 and y==130 )then	-- 南2登录点
		goto  s2
	elseif (x==63 and y==79 )then	-- 西1登录点
		goto  w1
	elseif (x==242 and y==100 )then	-- 东1登录点
		goto  e1
	elseif (x==141 and y==148 )then	-- 南1登录点
		goto  s1
	end	
	回城()
	等待(2000)
	goto StartBegin

::w2::-- 西2登录点
	转向(2)	
	等待到指定地图("法兰城",233,78)	

::e2::	-- 东2登录点
	转向(0)	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0)

::s2::	-- 南2登录点
	等待到指定地图("法兰城",162,130)
	
	移动(153,130)
	goto Go

::w1::	-- 西1登录点
	转向(0, "")
	
	等待到指定地图("法兰城", 242, 100)
	

::e1::	-- 东1登录点
	转向(2, "")
	等待到指定地图("市场三楼 - 修理专区", 46, 16)
	转向(0, "")

::s1::	-- 南1登录点	
	等待到指定地图("法兰城",141,148)
	移动(153,148)
::Go::
	移动(153,102)
	移动(153,100)
	等待到指定地图("里谢里雅堡", 1)	
	移动(41,93)
	移动(28,93)	
	移动(28,88)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()	
	对话选择(32, 0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("？")	
	移动(19, 20)
	移动一格(4)	
	等待到指定地图("法兰城遗迹")		
	移动(98, 138,"盖雷布伦森林")		
	移动(124, 168,"温迪尔平原")		
	移动(264, 108,"艾尔莎岛")	
::DingJu::
	移动(141, 106)	
	转向(1)
	等待服务器返回()
	对话选择(4, 0)
	移动(140, 105)
	喊话("到达目的地，定居完成！",2,3,5)