
设置("timer", 100)


设置("自动战斗", 1)


::dengru::
	if(取当前地图名() ==  "艾尔莎岛")then goto  star1 end
	if(取当前地图名() ==  "里谢里雅堡")then goto  star2 end
	if(取当前地图名() ==  "圣骑士营地")then goto  naairen end
::star1::
	
	等待到指定地图("艾尔莎岛",1)
	自动寻路(140,105)
	等待(500)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("里谢里雅堡", 1)
	
	自动寻路(41,82)
	goto begin 
::star2::
	
	等待到指定地图("里谢里雅堡",1)
	自动寻路(59,82)
	自动寻路(41,82)
	goto begin 
::begin::
	等待到指定地图("里谢里雅堡",41,82)
	自动寻路(41,98)
	
	等待到指定地图("法兰城", 1)
	自动寻路(153,129)
	自动寻路(159,160)
	自动寻路(158,189)
	自动寻路(153,195)
	自动寻路(153,239)
	自动寻路(153,241)
	
	等待到指定地图("芙蕾雅", 1)
	
	自动寻路(424,264)
	
	自动寻路(468,264)
	
	自动寻路(468,266)
	
	自动寻路(498,266)
	
	自动寻路(503,274)
	
	自动寻路(506,280)
	
	自动寻路(511,282)
	
	自动寻路(513,282)
	
	等待(1000)
	
	等待到指定地图("曙光骑士团营地", 1)
	
	自动寻路(30,59)
	自动寻路(30,51)
	自动寻路(55,51)
	自动寻路(55,48)
	自动寻路(55,47)
	
	等待(1000)
	
	等待到指定地图("辛希亚探索指挥部",1,10)
	自动寻路(6,10)
	自动寻路(6,4)
	自动寻路(7,4)
	
	
	自动寻路(91,9)
	自动寻路(94,9)
	自动寻路(95,9)
	
	等待(1000)
	
	等待到指定地图("辛希亚探索指挥部",19,28)
	
	自动寻路(19,30)
	自动寻路(14,30)
	自动寻路(14,24)
	自动寻路(7,24)
	自动寻路(7,22)
	转向(0)
	
	等待(2000)
        goto dao 
::dao::
	喊话("自动去拿矮人戒指喽",02,03,05)
	
	等待(1000)
        goto naairen 
::naairen::
	自动寻路(92, 86)
	自动寻路(92, 74)
	自动寻路(115, 74)
	自动寻路(115, 55)
	自动寻路(116, 55)
	等待到指定地图("酒吧", 1)
	自动寻路(8, 23)
	自动寻路(8, 7)
	自动寻路(14, 7)
	
	转向(0, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
	自动寻路(8, 7)
	自动寻路(8, 23)
自动寻路(0, 23)
	等待到指定地图("圣骑士营地", 1)
	自动寻路(113, 58)
	自动寻路(113, 86)
	自动寻路(107, 86)
	自动寻路(104, 88)
	自动寻路(99, 88)
	自动寻路(95, 87)
	自动寻路(37, 87)
	自动寻路(36, 87)
	等待到指定地图("肯吉罗岛", 1)
	自动寻路(533, 332)
	自动寻路(501, 300)
	自动寻路(482, 300)
	自动寻路(482, 275)
	自动寻路(463, 256)
	自动寻路(457, 256)
	自动寻路(457, 247)
	自动寻路(384, 247)
	自动寻路(384, 245)
	等待到指定地图("蜥蜴洞穴",1)
	自动寻路(11, 2)
	自动寻路(12, 2)
	等待到指定地图("肯吉罗岛", 307, 362)
	自动寻路(254, 415)
	自动寻路(254, 423)
	自动寻路(231, 446)
	自动寻路(231, 434)
	
	等待到指定地图("矮人城镇", 110, 191)
	自动寻路(110, 134)
	自动寻路(97, 134)
	自动寻路(97, 124)
	
	转向(6, "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	
	对话选择("32", "", "")
	等待服务器返回()
	对话选择("1", "", "")
::han::
	喊话("OY",02,03,05)
	
	等待(1000)

