设置平均级<80跑,要求定居新城和身上没有矮人戒


停止遇敌()
设置("自动战斗", 1)		-- 开启自动战斗，0不自动战斗，1自动战斗
设置("高速战斗", 4)	-- 高速战斗时的操作等待时间单位秒，3以上为好，不然容易断线


function main()
::dengru::
	local 当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto star1
	elseif (当前地图名=="里谢里雅堡" )then	
		goto star2
	elseif (当前地图名=="圣骑士营地" )then	
		goto dao
	end	 
::star1::
	自动寻路(140,105)
	等待(500)
	面向("东北")
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")	
	自动寻路(41,82)
    goto begin
::star2::	
	等待到指定地图("里谢里雅堡")	
	自动寻路(41,82)
    goto begin
::begin::
	等待到指定地图("里谢里雅堡",41,82)
	自动寻路(41,98)	
	等待到指定地图("法兰城")	
	自动寻路(153,241)	
	等待到指定地图("芙蕾雅")	
	自动寻路(513,282)	
	等待(1000)	
	等待到指定地图("曙光骑士团营地")	
	自动寻路(55,47)	
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",1,10)
	自动寻路(7,4)	
	等待到指定地图("辛希亚探索指挥部",91,6)
	自动寻路(95,9)
	等待(1000)	
	等待到指定地图("辛希亚探索指挥部",19,28)	
	自动寻路(19,30)
	自动寻路(7,22)  	
	面向("北")		-- 转向北	
	等待(2000)
::dao::
	if(取物品数量("巴萨的破酒瓶") < 1)then
		自动寻路(116,56,"酒吧")
		扔("矮人徽章")
		自动寻路(13, 5) 		
		对话选是(14,5)
		自动寻路(0,23,"圣骑士营地")
	end
	自动寻路(36, 87,"肯吉罗岛")	
	if(取物品叠加数量("龙角") >= 15)then
		自动寻路(475, 209)
		对话选是(0)	
	end	
	自动寻路(384, 245,"蜥蜴洞穴")	
	自动寻路(12, 2)
	等待到指定地图("肯吉罗岛", 307, 362)	
	自动寻路(231, 434)
	等待到指定地图("矮人城镇", 110, 191)
	自动寻路(100, 127)
	自动寻路(97, 124)
	对话选是(96,124)	
end
main()