设置脚本简介("起点支持新城登陆点和城堡打卡处,请自己设置战斗")
设置("timer",100)

function 去营地()
::dengru::
	local 当前地图名 = 取当前地图名()
	if (当前地图名=="艾尔莎岛" )then	
		goto star1
	elseif (当前地图名=="里谢里雅堡" )then	
		goto star2
	elseif (当前地图名=="法兰城" )then	
		goto begin
	end	
::star1::
	自动寻路(140,105)
	等待(500)
	面向("东北")
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")		
    goto star2
::star2::		
	自动寻路(41,98)	
    goto begin
::begin::		
	等待到指定地图("法兰城")		
	自动寻路(153,241,"芙蕾雅")		
	自动寻路(513,282,"曙光骑士团营地")	
	
	自动寻路(55,47)	
	等待到指定地图("辛希亚探索指挥部",1,10)
	自动寻路(7,4)	
	等待到指定地图("辛希亚探索指挥部",91,6)	
	自动寻路(95,9)	
	等待到指定地图("辛希亚探索指挥部",19,28)	
	自动寻路(7,22)  	
	面向("北")		-- 转向北		
	自动寻路(96,86)
    goto dao
::dao::
	喊话("营地到了，等待猪的出现",2,3,5)
end
去营地()