��淖员嘟疟荆鲁瞧舳蛴仄舳柚煤米远优�.身上不要放矮人徽章--278142863
设置("timer", 300)


设置("自动战斗", 1)


::dengru::
        if(取当前地图名() ==  "艾尔莎岛")then goto  star1 end
        if(取当前地图名() ==  "里谢里雅堡")then goto  star2 end
        if(取当前地图名() ==  "圣骑士营地")then goto  naairen end
::star1::
	
	等待到指定地图("艾尔莎岛",1)
	移动(140,105)
	等待(500)
	
	
	转向(1, "")
	等待服务器返回()
	对话选择("4", "", "")
	
	等待到指定地图("里谢里雅堡", 1)
	
	移动(41,82)
        goto begin 
::star2::
	
	等待到指定地图("里谢里雅堡",1)
	移动(59,82)
	移动(41,82)
        goto begin 
::begin::
	等待到指定地图("里谢里雅堡",41,82)
	移动(41,98)
	
	等待到指定地图("法兰城", 1)
	移动(153,129)
	移动(159,160)
        移动(158,189)
        移动(153,195)
        移动(153,239)
        移动(153,241)
	
	等待到指定地图("芙蕾雅", 1)
	
	移动(424,264)
	
	移动(468,264)
	
	移动(468,266)
	
	移动(498,266)
	
	移动(503,274)
	
	移动(506,280)
	
	移动(511,282)
	
	移动(513,282)
	
	等待(1000)
	
	等待到指定地图("曙光骑士团营地", 1)
	
	移动(30,59)
	移动(30,51)
	移动(55,51)
	移动(55,48)
	移动(55,47)
	
	等待(1000)
	
	等待到指定地图("辛希亚探索指挥部",1,10)
	移动(6,10)
	移动(6,4)
	移动(7,4)
	
	
	移动(91,9)
	移动(94,9)
	移动(95,9)
	
	等待(1000)
	
	等待到指定地图("辛希亚探索指挥部",19,28)
	
	移动(19,30)
	移动(14,30)
	移动(14,24)
	移动(7,24)
	移动(7,22)
        转向(0)
	
	等待(2000)
        goto dao 
::dao::
	喊话("自动去拿矮人戒指喽",02,03,05)
	
	等待(1000)
        goto naairen 
::naairen::
        移动(92, 86)
        移动(92, 74)
        移动(115, 74)
        移动(115, 55)
        移动(116, 55)
        等待到指定地图("酒吧", 1)
        移动(8, 23)
        移动(8, 7)
        移动(14, 7)
        
        转向(0, "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        对话选择("1", "", "")
        移动(8, 7)
        移动(8, 23)
        移动(0, 23)
        等待到指定地图("圣骑士营地", 1)
        移动(113, 58)
        移动(113, 86)
        移动(107, 86)
        移动(104, 88)
        移动(99, 88)
        移动(95, 87)
        移动(37, 87)
        移动(36, 87)
        等待到指定地图("肯吉罗岛", 1)
        移动(533, 332)
        移动(501, 300)
        移动(482, 300)
        移动(482, 275)
        移动(463, 256)
        移动(457, 256)
        移动(457, 247)
        移动(384, 247)
        移动(384, 245)
        等待到指定地图("蜥蜴洞穴\\z3",1)
        移动(11, 2)
        移动(12, 2)
        等待到指定地图("肯吉罗岛", 307, 362)
        移动(254, 415)
        移动(254, 423)
        移动(231, 446)
        移动(231, 434)
        
        等待到指定地图("矮人城镇", 110, 191)
        移动(110, 134)
        移动(97, 134)
        移动(97, 124)
        
        转向(6, "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        
        对话选择("32", "", "")
        等待服务器返回()
        对话选择("1", "", "")
::han::
	喊话("OY",02,03,05)
	
	等待(1000)

