启动地点,哥拉尔传送石。

--设置("timer", 100)

function 哥拉尔到法兰(dj)
	if(dj==nil)then
		是否定居=用户输入框("定居否？是11111，否0","0")
	else
		是否定居=dj
	end
::begin::
	当前地图名 = 取当前地图名()
	x,y=取当前坐标()    
	if (当前地图名=="铁达尼号" )then	
		goto  tdn  
	elseif (当前地图名=="哥拉尔镇" )then	
		goto  star1 
	end	
	goto  begin
::star1::	
	等待到指定地图("哥拉尔镇")	
	移动(96, 211)
	等待到指定地图("哥拉尔镇 港湾管理处")
	移动(14, 12)
	移动(8, 6)
	移动(8, 5)
	转向(0)
	等待服务器返回()
	对话选择(32, 0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("往伊尔栈桥")	
	移动(52, 51)
::shang::
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待(5000)
	if(取当前地图名() == "铁达尼号")then
		goto tdn
	end	
	goto shang
::tdn::
	等待(150000)
::tdn1::
	if(string.find(最新系统消息(),"本船已到达了伊尔港")~=nil)then
		goto xia
	end   
	goto tdn1
::xia::
	移动(70, 26)
	转向(2)
	等待服务器返回()
	对话选择(4, 0)
	等待(5000)
	if(取当前地图名() == "往哥拉尔栈桥")then
		goto ty
	end		
	goto xia
::ty::
	移动(20, 54)
	转向(6)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("港湾管理处")	
	移动(9, 22)
	等待到指定地图("伊尔")	
	移动(24, 19)
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待到指定地图("伊尔村")	
	移动(47, 83)
	等待到指定地图("村长的家")	
	移动(14, 17)
	等待到指定地图("伊尔村的传送点")	
	移动(21, 11)		
	转向(0)
	等待服务器返回()
	对话选择(4, 0)		
	goto ylt
::ylt::
	等待到指定地图("启程之间")
	移动(25, 24)
	等待到指定地图("里谢里雅堡 1楼")
	移动(75, 40)
	等待到指定地图("里谢里雅堡")
	移动(42, 97)
	移动(42,98)
	等待到指定地图("法兰城")		
	移动(162, 130)	
	转向(2)	
	等待到指定地图("法兰城",72,123)	
	转向(2)	
	等待到指定地图("法兰城",233,78)		
	移动(231,77)
	if(是否定居 == 0)then
		goto quit1
	end
	转向(0)
	等待服务器返回()
	对话选择(4, 0)
	等待(1000)
::quit1::
	等待(1000)
	移动(238,111,"银行")	
	移动(11,8)
	面向("东")
	等待服务器返回()
end
哥拉尔到法兰(0)