脚本支持任意地点启动，支持黑白记忆，请设置好自动战斗,谢谢支持魔力辅助程序.脚本发现BUG联系群14873104-----------zzg123


common=require("common")
是否卖 =用户输入框("鹿皮卖否？ 是1 否0","1")
是否打卡 =用户输入框("是否打卡？ 是1 否0","0")

设置("timer", 100)			-- 设置定时器，单位毫秒 内置100毫秒 不要太快
设置("自动战斗", 1)			-- 开启自动战斗，0不自动战斗，1自动战斗
设置("高速战斗", 1)			-- 高速战斗
设置("高速延时", 4)			-- 高速战斗速度，0不延时 
设置("遇敌全跑", 1)			-- 遇敌全跑 
设置("自动加血", 0)			-- 遇敌全跑 关闭自动加血，脚本对话加血 

::begin::	
	等待空闲()
	回城()
	等待(1000)	--切换	
    local 当前地图名 = 取当前地图名()
	x,y=取当前坐标()	
	if (当前地图名=="艾尔莎岛" )then	
		goto star	
	elseif (当前地图名 == "法兰城" )then	
		common.艾岛定居()	
		goto begin
	end		
	等待(2000)	
	goto begin
::w2::	-- 西2登录点
	转向(2)	
	等待到指定地图("法兰城",233,78)
::e2::	-- 东2登录点
	转向(0)	
	等待到指定地图("市场一楼 - 宠物交易区", 46, 16)	
	转向(0)

::s2::	-- 南2登录点	
	等待到指定地图("法兰城",162,130)	
	移动(153,130)
	goto Go
::w1::	-- 西1登录点
	转向(0)	
	等待到指定地图("法兰城", 242, 100)
::e1::	-- 东1登录点
	转向(2)	
	等待到指定地图("市场三楼 - 修理专区", 46, 16)	
	转向(0)
::s1::	-- 南1登录点	
	等待到指定地图("法兰城",141,148)
	移动(153,148)
::Go::
	移动(153,102)
	移动(153,100)
	等待到指定地图("里谢里雅堡")	
::Go2::        
	移动(41,93)
	移动(28,93)
	移动(28,88)
	等待服务器返回()
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()	
	对话选择(32,0)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("？")		
 	移动(19,21,"法兰城遗迹")		
	移动(98,138,"盖雷布伦森林")	
	移动(124,168,"温迪尔平原")
	移动(264,108,"艾尔莎岛")
	移动(140,105)
	移动(141,106)	
	转向(1)
	等待服务器返回()
	对话选择(4,0)

::star::
    移动(140,105)
	if (人物("魔") < 1 )then	
		goto bu
	end
	if (取包裹空格() < 2 )then	
		goto mai
	end        
::go::		
	移动(130, 50)             
::gogogo::
	等待到指定地图("盖雷布伦森林")	
	移动(178,179)
	移动(175,182)        
	扔("魔石")
	扔("地的水晶碎片")
	扔("水的水晶碎片")
	扔("火的水晶碎片")
	扔("风的水晶碎片")
::work::
	工作("狩猎",0,5000)
	等待工作返回(5000)
	if (取包裹空格() < 1 )then	
		goto begin
	end	
	if (人物("魔") < 1 )then	
		goto begin
	end			
    goto work
::bu::
	移动(140,105)     	
	转向(1)
	等待服务器返回()
	对话选择(4,0)	
	等待到指定地图("里谢里雅堡")	
	移动(31,82)
	移动(31,90)
	移动(34,90)
	移动(34,89)
	转向(0)			-- 转向北边恢复人宠血魔
	等待回补()
	goto begin
::mai::	
	转向(1)
	等待服务器返回()
	对话选择(4,0)
	等待到指定地图("里谢里雅堡")
	if(是否卖 ~= 1)then
		goto cun
	end	
	移动(30, 82)
	移动(30, 79)
	扔叠加物("鹿皮", 40)	
	卖(0,"鹿皮")	
	等待(1000)	
	--卖(0,"鹿皮")	
	--printf(钱)
	goto begin
::cun::

	移动(41, 82)
	移动(41, 97)
	移动( 41, 98)	
	等待(1000)	--切换	
	移动(153, 130)
	移动(162, 130)	
	转向(2)
		
	等待(1000)	--切换		
	转向(2)	
	等待(1000)	--切换	
	移动(233,88)
	移动(237,92)
	移动(237,104)
	移动(235,106)
	移动(235,111)
	移动(237,111)
	等待(3000)
	移动(238,111)	
	等待到指定地图("银行")	
	
	扔叠加物("鹿皮", 40)
	移动(6,13)
	移动(11,8)
	等待到指定地图("银行", 11, 8)	
	转向(2)
	等待服务器返回()

::sale_4::
	银行("全存","鹿皮",40)
	goto begin


::manle::
	if (取包裹空格() < 2 )then	
		goto begin
	end
::Endl::
	
        
	








                                   

