★做1A鞋冲技能，起始点任意，要求定居艾尔莎岛，魔至少250，身上物品清空，会狩猎、做帽1、治疗，设好自动战斗，自动扔碎片魔石，自动治疗，自动叠加 鹿皮&40 麻布&20，星落制造：274100927

makeShoe={}

设置("timer", 100)			-- 设置定时器，单位毫秒 内置100毫秒 不要太快
设置("自动战斗", 1)			-- 开启自动战斗，0不自动战斗，1自动战斗
设置("高速战斗", 1)			-- 高速战斗
设置("高速延时", 4)			-- 高速战斗速度，0不延时 
设置("遇敌全跑", 1)			-- 遇敌全跑 
设置("自动加血", 0)			-- 遇敌全跑 关闭自动加血，脚本对话加血 
设置("自动叠",1, "麻布&20")			
设置("自动叠",1, "鹿皮&40")		
设置("自动扔",1,"卡片？")
设置("自动扔",1,"魔石")
设置("自动扔",1,"盐")	
       
function makeShoe.main()
::begin::	
	if (取当前地图名()=="艾尔莎岛" )then	
		goto island
	end
::back::
	回城()	
	等待(1000)
::begin2::
	if (取当前地图名()=="艾尔莎岛" )then	
		goto island
	end
	goto begin2
::island::
	x,y=取当前坐标()	
	if (x==140 and y==105 )then	
		goto juge
	end
	goto back
::juge::
	if(取物品数量("运动鞋") >  0)then-- 物品大于指定值时跳转到卖鞋
		goto sale	
	elseif(人物("魔") < 250) then	-- 人魔小于指定值时跳转到加魔
		goto supply
	elseif(取物品数量("鹿皮") < 9) then-- 物品小于指定值时跳转到狩猎
		goto hunt
	elseif(取物品数量("鹿皮") > 9) then	-- 物品小于指定值时跳转
		goto juge2
	elseif(取物品叠加数量("鹿皮") < 20) then	-- 物品小于指定值时跳转到狩猎
		goto hunt			
	end
::juge2::
	if(取物品数量("麻布") >  1)then
		goto shoes	
	elseif(取物品数量("麻布") < 1) then	
		goto cloth
	elseif(取物品叠加数量("麻布") < 4) then	
		goto cloth			
	end	
	goto shoes
::cloth::								-- 开始买布
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)
	等待(500)
	等待到指定地图("里谢里雅堡")	
	自动寻路(37, 82)	
	自动寻路(41, 97)	
	自动寻路(40, 98)
	等待(500)
	等待到指定地图("法兰城")	
	自动寻路(153, 123)
::cloth2::
	自动寻路(115, 123)	
	自动寻路(117, 112)
	等待(500)
	等待到指定地图("流行商店")
	等待(500)
	自动寻路(8, 7)
::buy::
	转向(0)
	等待服务器返回()		
	对话选择(0, 0)
	等待服务器返回()		
	买(0,72)		
	goto back

::hunt::								-- 开始狩猎
	自动寻路(142,105)
	自动寻路(130, 50)
	等待(500)
	等待到指定地图("盖雷布伦森林")	
	自动寻路(177,181)
::hunt1::
	扔("盐")
	自动寻路(175,182)
::hunt2::
	if(取物品数量("鹿皮") >  9)then
		goto enough	
	elseif(人物("魔") < 35) then	
		goto back
	elseif(取物品数量("盐") > 0) then	
		goto hunt1			
	end		
	工作("狩猎", 0,5000)	
	等待工作返回(5000)
	goto hunt2
::enough::
	转向(1)
	goto back

::supply::								-- 开始补魔
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)
	等待(500)
	等待到指定地图("里谢里雅堡")	
	自动寻路(34, 89)		
	回复(1)
	goto back

::shoes::								-- 开始做鞋
	工作(100,7)	
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)
	等待(500)
	等待到指定地图("里谢里雅堡")
	自动寻路(27, 90)
	自动寻路(33, 90)
	自动寻路(34, 89)
	回复(1)	
	
::work::								-- 开始工作
	合成("运动鞋")		
	if(取物品数量("麻布") >  0)then-- 物品大于指定值时跳转
		goto pause		
	end	
	转向(4)
	等待服务器返回()		
	对话选择(4,0)
	等待服务器返回()	
	对话选择(1,0)
	自动寻路(34, 89)	
	回复(1)	
::work2::
	自动寻路(33, 90)
	自动寻路(28, 90)
	自动寻路(28, 93)
	自动寻路(41, 93)
	goto sale2
::pause::
	叠("麻布", 40)
	叠("鹿皮", 20)	
	自动寻路(34, 89)
	回复(1)	
::pause2::	
	等待(2000)
	合成("运动鞋")	
	回复(1)	
	if(取包裹空格() <  1)then-- 物品大于指定值时跳转
		goto renbu		
	end		
	goto back
::renbu::
	扔("麻布")
	goto pause2
::sale::								-- 开始卖鞋	
	转向(1)
	等待服务器返回()	
	对话选择(4, 0)
	等待(500)
	等待到指定地图("里谢里雅堡")
	自动寻路(37, 82)
	自动寻路(41, 86)
::sale2::
	扔("麻布")
	if(取物品数量("麻布") >  0)then-- 物品大于指定值时跳转
		goto sale2		
	end	
	自动寻路(41, 97)	
	自动寻路(40, 98)
	等待(500)
	等待到指定地图("法兰城", 1)
	自动寻路(153, 120)
	自动寻路(150, 123)
	卖(0, "运动鞋")		
	goto cloth2

end
makeShoe.main()
return makeShoe